pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// bl602_demo_wifi_text_0003.c
// Generated by decompiling bl602_demo_wifi.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_wifi.h"

// 2303030A: Register Eq_2 xTaskGetTickCountFromISR(Register out ptr32 a5Out)
// Called from:
//      get_dts_addr.part.2
//      bl_main_cfg_task_req
//      tc_blfdtdump
//      tc_fdt_wifi_module
//      ef_get_env_blob
//      ef_del_env
//      ef_set_env
//      psm_test_cmd
//      _cb_cmd
//      bl_cks_test
//      _cb_cmd
//      bl_dma_IRQHandler
//      bl_dma_irq_register
//      bl_dma_init
//      bl_dma_test
//      _irq_num_check.part.0
//      bl_irq_register
//      bl_irq_unregister
//      wait_trng4feed
//      sec_trng_IRQHandler
//      _pka_test_case2
//      cmd_gpio_get
//      cmd_gpio_set
//      cmd_gpio_func
//      Aes_Compare_Data
//      Sec_Eng_AES_Link_Case_CBC_128
//      Sec_Eng_AES_Link_Case_CTR_128
//      bl_sha_mutex_take
//      bl_sha_mutex_give
//      cmd_wdt_init
//      dev_uart_init
//      vfs_uart_init
//      hal_gpio_init_from_dts
//      hal_boot2_init
//      hal_board_cfg
//      bl_tsen_adc_get
//      bl_flash_config_update
//      _cb_led_trigger
//      _led_bloop_msg
//      _led_bloop_evt
//      loopset_led_trigger
//      file_info
//      dirent_file
//      romfs_opendir
//      romfs_stat
//      romfs_open
//      romfs_register
//      log_buf_out
//      bl_mtd_write
//      bloop_run
Eq_2 xTaskGetTickCountFromISR(ptr32 & a5Out)
{
	Eq_2 a0_5 = g_t4200DE68;
	a5Out = 0x4200E000;
	return a0_5;
}

// 23030314: void pcTaskGetName(Register word32 a0, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      aws_main_entry
void pcTaskGetName(word32 a0, Eq_2 a4, ptr32 mstatus)
{
	if (a0 != 0x00 || g_t4200DE38 != 0x00)
		return;
	word32 a5_37;
	vAssertCalled(a4, mstatus, out a5_37);
}

// 2303033C: Register Eq_2 xTaskIncrementTick(Register Eq_2 s0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out (ptr32 Eq_2) s3Out, Register out ptr32 s4Out)
// Called from:
//      xTaskResumeAll
//      int_timer_cb
Eq_2 xTaskIncrementTick(Eq_2 s0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out)
{
	Eq_2 a2_32;
	Eq_2 a4_114;
	ptr32 s2_37;
	Eq_2 a3_162;
	ptr32 a0_29 = bl_sys_time_sync_state(fp + -52, a4, mstatus, dwLoc08, out a2_32, out a3_162, out a4_114, out s2_37);
	ptr32 s1_150 = a0_29;
	if (a0_29 == 0x00)
	{
l23030384:
		0x00 = (uint16) dwArg0198;
		s1Out = s1_150;
		a0Out = s1_150;
		a3Out = a3_162;
		a4Out = a4_114;
		s2Out = s2_37;
		s3Out = s3;
		s4Out = dwLoc14;
		return dwArg0158;
	}
	if (g_t4200DE50 != 0x00)
	{
		*((word32) a4_114 + 1) = *a4_114;
		s1_150 = 0x00;
		a4_114 = (word32) a4_114 + 1;
		goto l23030378;
	}
	Eq_2 s3_45 = g_t4200DE68;
	g_t4200DE68 = (word32) s3_45 + 1;
	s3 = (word32) s3_45 + 1;
	if (s3_45 == 0x01)
	{
		s2_37 = 0x4200DE3C;
		if (*g_t4200DE3C != 0x00)
		{
			word32 a5_410;
			a2_32 = vAssertCalled(a4_114, mstatus, out a5_410);
		}
		a3_162 = g_t4200DE3C;
		Eq_2 a4_59 = *a2_32;
		g_t4200DE3C = a2_32;
		*a3_162 = a4_59;
		*((word32) a4_59 + 1) = *a4_59;
		a4_114 = (word32) a4_59 + 1;
		if (*g_t4200DE3C == 0x00)
		{
			g_ptr4200DE5C = (struct Eq_156045 *) ~0x00;
l2303040E:
			if ((word32) s3_45 + 1 >= g_ptr4200DE5C)
			{
				s1_150 = 0x00;
				s2_37 = 0x4200DE3C;
l23030436:
				while (*g_t4200DE3C != 0x00)
				{
					struct Eq_156045 * a5_106 = *((word32) s0 + 0x0C);
					word32 s0_107 = a5_106->dw0004;
					if ((word32) s3_45 + 1 < a5_106)
					{
						g_ptr4200DE5C = a5_106;
						goto l230304B2;
					}
					Eq_2 a4_116;
					word32 a5_117;
					uxListRemove(a3_162, a4_114, out a4_116, out a5_117);
					if (a5_117 != 0x00)
					{
						word32 a4_413;
						uxListRemove(a3_162, a4_116, out a4_413, out a5_117);
					}
					a4_114 = *a3_162;
					Eq_2 a5_134 = 0x01 << a5_117 | a3_162;
					*a5_134 = a4_114;
					word32 a5_412;
					vListInsertEnd(s0_107 + 4, a4_114, a5_134, out a5_412);
					s0 = *((word32) a4_114 + 44);
					if (a4_114 < *((word32) g_t4200DE38 + 44))
						goto l23030436;
					s1_150 = 0x01;
				}
				g_ptr4200DE5C = (struct Eq_156045 *) ~0x00;
			}
			else
				s1_150 = 0x00;
l230304B2:
			a3_162.u0 = 0x01;
			if (*((char *) &g_t4201253C + a4_114 * 0x14) > 0x01)
				s1_150 = 0x01;
l23030378:
			if (g_dw4200DE6C != 0x00)
				s1_150 = 0x01;
			goto l23030384;
		}
		word32 a5_411;
		a4_114 = prvResetNextTaskUnblockTime.part.0(out a5_411);
	}
	goto l2303040E;
}

// 230304DC: Register word32 xTaskResumeAll(Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out (ptr32 Eq_150128) a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out ptr32 s4Out, Register out ptr32 t3Out)
// Called from:
//      xEventGroupWaitBits
//      xEventGroupSetBits
//      vEventGroupDelete
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      xStreamBufferSend
//      xStreamBufferReceive
//      vTaskDelay
//      vTaskGetInfo
//      uxTaskGetSystemState
//      prvTimerTask
//      pvPortMalloc
//      vPortFree
word32 xTaskResumeAll(Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, union Eq_2 & s0Out, union Eq_2 & s1Out, struct Eq_150128 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & s4Out, ptr32 & t3Out)
{
	if (a5 == 0x00)
		vAssertCalled(a4, mstatus, out a5);
	__csrrc(mstatus, 0x08);
	Eq_2 s0_113 = *a5;
	if (a5 != 0x00)
		a4 = vTaskEnterCritical.part.7(a4, out a5);
	struct Eq_150128 * a0_148;
	Eq_2 a5_147 = (word32) a5 - 1;
	*a5_147 = *a5;
	Eq_2 s1_111 = *a5_147;
	if (a5_147 == 0x00)
	{
		a5_147 = g_t4200DE44;
		if (a5_147 != 0x00)
		{
			struct Eq_156174 * s6_50 = null;
			union Eq_2 * s3_131 = &g_dw4200DE6C;
l2303054C:
			while (g_dw420127E4 != 0x00)
			{
				s6_50 = g_ptr420127F0->ptr000C;
				Eq_2 a4_68;
				word32 a5_456;
				uxListRemove(a3, a4, out a4_68, out a5_456);
				word32 a4_457;
				word32 a5_458;
				uxListRemove(a3, a4_68, out a4_457, out a5_458);
				Eq_2 a4_76 = *a3;
				Eq_2 a5_82 = 0x01 << s6_50->t002C | a3;
				*a5_82 = a4_76;
				word32 a5_459;
				vListInsertEnd((char *) s6_50 + 4, a4_76, a5_82, out a5_459);
				a4 = s6_50->t002C;
				if (a4 < *((word32) g_t4200DE38 + 44))
					goto l2303054C;
				g_dw4200DE6C = 0x01;
			}
			if (s6_50 != null)
			{
				if (*g_t4200DE3C == 0x00)
				{
					g_dw4200EE5C = ~0x00;
					a4.u0 = ~0x00;
				}
				else
				{
					word32 a5_460;
					a4 = prvResetNextTaskUnblockTime.part.0(out a5_460);
				}
			}
			s1_111 = g_t4200DE4C;
			if (s1_111 != 0x00)
			{
				do
				{
					word32 s1_125;
					word32 * s2_126;
					Eq_2 s4_127;
					word32 a0_130;
					s0_113 = xTaskIncrementTick(s0_113, a4, mstatus, dwArg0158, out s1_125, out a0_130, out a3, out a4, out s2_126, out s3_131, out s4_127);
					s1_111 = s1_125 + ~0x00;
					if (a0_130 != 0x00)
						*s3_131 = (union Eq_2 *) s4_127;
				} while (s1_125 != ~0x00);
				*s2_126 = 0x00;
			}
			a5_147 = *s3_131;
			if (a5_147 != 0x00)
			{
				__syscall();
				a0_148 = (struct Eq_150128 *) 0x01;
l230305EC:
				if (a5_147 != 0x00)
				{
					a5_147 = *((word32) g_t4200DE38 + 0x0044);
					if (a5_147 != 0x00)
						a3 = vTaskExitCritical.part.8(a3, mstatus, out a4, out a5_147);
				}
				0x00 = (uint16) dwArg0198;
				s0Out = dwArg0158;
				s1Out = s1_111;
				a0Out = a0_148;
				a2Out = dwArg0138;
				a3Out = a3;
				a4Out = a4;
				a5Out = a5_147;
				a6Out = dwArg0118;
				s4Out = dwArgF4;
				t3Out = dwArgA8;
				return dwArg0178;
			}
		}
	}
	a0_148 = null;
	goto l230305EC;
}

// 23030630: Register word32 vTaskDelay(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_1021 s1Out, Register out Eq_2 a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      proc_hellow_entry
//      aws_main_entry
//      txl_frame_get
//      scanu_start
//      bl_main_rtthread_start
//      wifi_mgmr_event_notify
//      cmd_wifi_coex_pta_force_on
//      wifi_disconnect_cmd
//      bl_cks_test
//      bl_dma_test
//      proc_entry_looprt
//      tcpc_entry
//      iperf_server_udp
//      iperf_client_udp
//      iperf_client_tcp
//      has_timer_expired
//      bloop_wait_startup
word32 vTaskDelay(Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_1021 & s1Out, union Eq_2 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	if (a0 != 0x00)
	{
		if (a5 != 0x00)
		{
			vAssertCalled(a4, mstatus, out a5);
			a2 = dwArg24;
		}
		*((word32) a5 + 1) = *a5;
		ptr32 a1_32;
		Eq_2 a4_34;
		Eq_2 a5_35;
		ptr32 s2_39;
		ptr32 s3_40;
		word32 s1_126;
		word32 a0_127;
		word32 a2_128;
		word32 s4_129;
		prvAddCurrentTaskToDelayedList(a0, 0x00, a2, a3, a4, dwArg28, out s1_126, out a0_127, out a1_32, out a2_128, out a4_34, out a5_35, out s2_39, out s3_40, out s4_129);
		Eq_2 a0_45;
		Eq_2 a2_46;
		Eq_2 a5_47;
		word32 s0_49;
		Eq_1021 s1_50;
		ptr32 s4_51;
		Eq_2 a3_54;
		Eq_2 a4_55;
		word32 a6_130;
		word32 t3_131;
		xTaskResumeAll(a3, a4_34, a5_35, mstatus, dwArg0138, dwArg0178, out s0_49, out s1_50, out a0_45, out a2_46, out a3_54, out a4_55, out a5_47, out a6_130, out s4_51, out t3_131);
		if (a0_45 == 0x00)
			__syscall();
		s1Out = s1_50;
		a0Out = a0_45;
		a1Out = a1_32;
		a2Out = a2_46;
		a3Out = a3_54;
		a4Out = a4_55;
		a5Out = a5_47;
		s2Out = s2_39;
		s3Out = s3_40;
		s4Out = s4_51;
		s8Out = dwLoc1C;
		return s0_49;
	}
	else
	{
		__syscall();
		s1Out = s1;
		a0Out = a0;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s8Out = s8;
		return s0;
	}
}

// 23030672: Register ui32 vTaskSwitchContext(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Register out Eq_2 a0Out, Register out (ptr32 Eq_62019) a4Out, Register out Eq_2 a5Out)
// Called from:
//      bl_irq_handler
//      int_timer_cb
//      __uart_rx_irq
//      __uart_tx_irq
//      aos_sem_signal
ui32 vTaskSwitchContext(Eq_2 ra, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, union Eq_2 & a0Out, struct Eq_62019 & a4Out, union Eq_2 & a5Out)
{
	if (g_t4200DE50 == 0x00)
	{
		g_dw4200EE6C = 0x00;
		if (a3 != 0xA5A5A5A5 || (a3 != 0xA5A5A5A5 || (a3 != 0xA5A5A5A5 || a3 != 0xA5A5A5A5)))
			vApplicationStackOverflowHook(ra, a3, s2, dwArg30, dwArg34, dwArg58, dwArg7C);
		else
		{
			Eq_2 a4_43;
			Eq_2 a0_42 = __clzsi2(g_t4200DE58, out a4_43);
			ui32 s3_45 = 0x1F - a0_42;
			struct Eq_156406 * a5_51 = *((char *) &g_t4201253C + s3_45 * 0x14);
			if (a5_51 == null)
				vAssertCalled(a4_43, mstatus, out a5_51);
			ui32 s0_62 = s3_45 * 0x14 + 0x08;
			struct Eq_62019 * a4_61 = a5_51->ptr0004;
			struct Eq_62019 * a5_65 = a5_51->ptr0004;
			a5_65->ptr0004 = a4_61;
			if (a5_65 == s0_62 + 1107371324)
			{
				a5_65 = a5_65->ptr0004;
				a5_65->ptr0004 = a4_61;
			}
			Eq_2 a5_71 = a5_65->t000C;
			g_t4200DE38 = a5_71;
			a0Out = a0_42;
			a4Out = a4_61;
			a5Out = a5_71;
			return s0_62 + 1107371324;
		}
	}
	else
	{
		g_dw4200EE6C = 0x01;
		a0Out = a0;
		a4Out = (struct Eq_62019 *) 0x01;
		a5Out.u0 = 0x4200E000;
		return s0;
	}
}

// 2303073C: Register word32 vTaskPlaceOnEventList(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
word32 vTaskPlaceOnEventList(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg48, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out)
{
	if (a0 == 0x00)
	{
		word32 a5_65;
		vAssertCalled(a4, mstatus, out a5_65);
		a2 = dwArg24;
	}
	Eq_2 a4_28;
	word32 a5_66;
	vListInsert(a0, a2, a3, out a4_28, out a5_66);
	ptr32 a1_38;
	ptr32 a2_39;
	ptr32 a4_40;
	ptr32 s2_45;
	ptr32 s3_46;
	word32 s1_67;
	word32 a0_68;
	word32 a5_69;
	word32 s4_70;
	word32 s0_43 = prvAddCurrentTaskToDelayedList(a1, 0x01, a2, a3, a4_28, dwArg48, out s1_67, out a0_68, out a1_38, out a2_39, out a4_40, out a5_69, out s2_45, out s3_46, out s4_70);
	a1Out = a1_38;
	a2Out = a2_39;
	a4Out = a4_40;
	s2Out = s2_45;
	s3Out = s3_46;
	return s0_43;
}

