pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 230309AC: Register Eq_2 xTaskCheckForTimeOut(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register word32 a5, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 s4Out)
// Called from:
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      xStreamBufferSend
Eq_2 xTaskCheckForTimeOut(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, word32 a5, ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & s4Out)
{
	Eq_2 s1_13 = a0;
	if (a0 != 0x00)
	{
		if (a1 != 0x00)
			goto l230309C0;
	}
	else
	{
		a2 = vAssertCalled(a4, mstatus, out a5);
		if (a1 != 0x00)
			goto l230309C0;
	}
	a2 = vAssertCalled(a4, mstatus, out a5);
l230309C0:
	__csrrc(mstatus, 0x08);
	if (a5 != 0x00)
	{
		word32 a5_179;
		vTaskEnterCritical.part.7(a4, out a5_179);
	}
	Eq_2 s0_163;
	Eq_2 a4_100 = *a1;
	Eq_2 a5_101 = *a2;
	Eq_2 a3_158 = ~0x00;
	ptr32 a0_154 = 0x00;
	if (a4_100 != ~0x00)
	{
		a3_158 = null;
		s1_13 = *((word32) a1 + 4);
		if (*a0 != 0x00)
		{
			a0_154 = 0x01;
			if (a2 >= a1)
				goto l23030A1A;
		}
		if (a2 - a1 >= a4_100)
		{
			s0_163 = *a5_101;
			a1->u0 = 0x00;
			a0_154 = 0x01;
			if (a5_101 == 0x00)
				goto l23030A32;
l23030A1E:
			a5_101 = *((word32) g_t4200DE38 + 0x0044);
			if (a5_101 != 0x00)
			{
				a3_158 = vTaskExitCritical.part.8(a3_158, mstatus, out a4_100, out a5_101);
				a2 = dwArg24;
			}
l23030A32:
			s1Out = s1_13;
			a0Out = a0_154;
			a2Out = a2;
			a3Out = a3_158;
			a4Out = a4_100;
			a5Out = a5_101;
			s2Out = a1;
			s4Out = dwArg04;
			return s0_163;
		}
		a3_158 = *a3_158;
		a5_101 = *a5_101;
		a4_100 = a4_100 - a2 + a1;
		*a1 = a4_100;
		*a3_158 = s1_13;
		*((word32) a5_101 + 4) = s1_13;
		a0_154 = 0x00;
	}
l23030A1A:
	s0_163 = *a5_101;
	if (a5_101 == 0x00)
		goto l23030A32;
	goto l23030A1E;
}

// 23030A5E: Register word32 vTaskMissedYield()
// Called from:
//      prvUnlockQueue
word32 vTaskMissedYield()
{
	g_dw4200EE6C = 0x01;
	return 0x01;
}

// 23030A6A: Register Eq_2 vTaskGetInfo(Register Eq_2 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      prvListTasksWithinSingleList.part.11
Eq_2 vTaskGetInfo(Eq_2 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & s1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	Eq_2 s0_11 = a0;
	if (a0 == 0x00)
		s0_11 = g_t4200DE38;
	Eq_2 a5_164;
	*((word32) s0_11 + 56) = a1;
	*s0_11 = a1;
	*((word32) a4 + 16) = a1;
	*((word32) a4 + 28) = a1;
	*((word32) a4 + 8) = a1;
	Eq_2 s0_174 = *((word32) a4 + 80);
	*((word32) a1 + 24) = 0x00;
	*((word32) a4 + 20) = a1;
	if (a3 != 0x05)
	{
		a5_164 = g_t4200DE38;
		if (a5_164 != s0_174)
		{
			((word32) a1 + 0x0C)->u1 = (byte) a3;
			a5_164.u0 = 0x03;
			if (a3 == 0x03)
			{
				Eq_2 a5_62 = *a4;
				*((word32) a4 + 1) = a5_62;
				if (a5_62 != 0x00)
				{
					((word32) a1 + 0x0C)->u1 = 0x02;
					a5_62.u0 = 0x02;
				}
				word32 s1_82;
				word32 s4_83;
				word32 a0_218;
				word32 a2_219;
				word32 a6_220;
				word32 t3_221;
				word32 s0_217;
				xTaskResumeAll(a3, (word32) a4 + 1, a5_62, mstatus, dwArg0138, dwArg0178, out s0_217, out s1_82, out a0_218, out a2_219, out a3, out a4, out a5_164, out a6_220, out s4_83, out t3_221);
				s0_174 = dwArg44;
			}
		}
		else
			((word32) a1 + 0x0C)->u1 = 0x00;
	}
	else
	{
		word32 a0_40;
		word32 s2_46;
		word32 s4_47;
		word32 s3_52;
		eTaskGetState(s0_174, a3, a4, 0x05, mstatus, out a0_40, out a3, out a4, out a5_164, out s2_46, out s3_52, out s4_47);
		((word32) a1 + 0x0C)->u1 = (byte) a0_40;
		s0_174 = dwArg44;
	}
	if (a2 == 0x00)
	{
		((word32) a1 + 32)->u0 = 0x00;
		s1Out.u0 = <invalid>;
		a3Out.u0 = <invalid>;
		a4Out = a4;
		a5Out = a5_164;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		return s0_174;
	}
	else
	{
		Eq_2 a5_102;
		Eq_2 s0_99 = *((word32) a3 + 48);
		Eq_2 a4_101 = (word32) *a3;
		if (a4_101 == 0x00A5)
		{
			Eq_157013 a5_104 = 0x00;
			do
			{
				a5_104 = (word32) a5_104 + 1;
				a4_101 = CONVERT(Mem98[a3 + a5_104:byte], byte, word32);
			} while (a4_101 == 0x00A5);
			uint32 a5_114 = a5_104 >> 2 << 16;
			*((word32) a1 + 32) = (word16) (a5_114 >> 16);
			a5_102 = a5_114 >> 16;
		}
		else
		{
			((word32) a1 + 32)->u0 = 0x00;
			a5_102.u0 = 0x00;
		}
		s1Out.u0 = <invalid>;
		a3Out.u0 = <invalid>;
		a4Out = a4_101;
		a5Out = a5_102;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		return s0_99;
	}
}

// 23030B40: Register Eq_2 prvListTasksWithinSingleList.part.11(Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_157074 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      uxTaskGetSystemState
Eq_2 prvListTasksWithinSingleList.part.11(Eq_2 s1, Eq_2 a0, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgA8, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_157074 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 a1_21 = *((word32) a5 + 4);
	Eq_2 a5_24 = *((word32) a5 + 4);
	*((word32) a5_24 + 4) = a1_21;
	Eq_2 s4_110 = (word32) a1_21 + 8;
	Eq_2 s2_182 = a1_21;
	if (a5_24 == (word32) a1_21 + 8)
		*((word32) a5_24 + 4) = *((word32) a5_24 + 0x0C);
	Eq_2 s5_32 = *((word32) a5_24 + 0x0C);
	Eq_2 s0_105 = a0;
	s1_112 = s1;
	while (true)
	{
		ptr32 a3_178;
		Eq_157074 a5_180;
		ptr32 s3_65;
		Eq_2 s1_112;
		Eq_2 a5_39 = *((word32) a5_24 + 4);
		*((word32) s2_182 + 4) = a5_39;
		if (s4_110 == a5_39)
		{
			*((word32) s2_182 + 4) = *((word32) s4_110 + 4);
			s0_105 = vTaskGetInfo(s1_112, s0_105, 0x01, a2, a4, mstatus, dwArg0118, dwArg0158, out s1_112, out a3_178, out a4, out a5_180, out s2_182, out s3_65, out s4_110);
			if (s5_32 == s1_112)
			{
l23030BAE:
				0x00 = (uint16) dwArgA8;
				s1Out = s1_112;
				a0Out = s3_65;
				a1Out = s0_105;
				a3Out = a3_178;
				a4Out = a4;
				a5Out = a5_180;
				s2Out = s2_182;
				s3Out = s3_65;
				s4Out = dwArg04;
				return s1;
			}
		}
		else
		{
			s0_105 = vTaskGetInfo(s1_112, s0_105, 0x01, a2, a4, mstatus, dwArg0118, dwArg0158, out s1_112, out a3_178, out a4, out a5_180, out s2_182, out s3_65, out s4_110);
			if (s5_32 == s1_112)
				goto l23030BAE;
		}
		a5_24 = *((word32) s2_182 + 4);
	}
}

// 23030BCA: Register word32 uxTaskGetSystemState(Register word32 a0, Register Eq_2 a1, Register (ptr32 word32) a2, Register Eq_2 a3, Register (ptr32 Eq_157157) a4, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_157163 a0Out, Register out Eq_2 a1Out, Register out ptr32 a5Out, Register out ptr32 s8Out)
// Called from:
//      vTaskList
word32 uxTaskGetSystemState(word32 a0, Eq_2 a1, word32 * a2, Eq_2 a3, struct Eq_157157 * a4, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_157163 & a0Out, union Eq_2 & a1Out, ptr32 & a5Out, ptr32 & s8Out)
{
	a4->dw0001 = a4->dw0000;
	Eq_2 a4_181 = &a4->dw0001;
	Eq_2 a5_112 = g_t4200DE44;
	Eq_157163 s2_108 = 0x00;
	if (a1 >= a5_112)
	{
		word32 s4_259 = a0;
		word32 * s0_130 = a2;
		Eq_2 s1_120 = 32;
		s2_108.u0 = 0x00;
		Eq_2 a4_258 = 0x00;
		do
		{
			s1_120 = (word32) s1_120 - 1;
			a5_112 = (a4_258 + s2_108 << 2) + s4_259;
			if (a3 != 0x00)
			{
				s2_108 = s2_66 + a0_57;
				word32 a0_57;
				word32 s2_66;
				word32 a1_378;
				word32 a4_379;
				word32 a5_380;
				word32 s3_381;
				s0_130 = prvListTasksWithinSingleList.part.11(s1_120, a5_112, 0x01, a4_258, a5_112, mstatus, dwArg88, dwArgF8, dwArg0138, out s1_120, out a0_57, out a1_378, out a3, out a4_379, out a5_380, out s2_66, out s3_381, out s4_259);
				a4_258 = s2_108 << 0x03;
				a5_112 = s2_108 * 0x24 + s4_259;
			}
		} while (s1_120 != 0x00);
		if (true)
		{
			s2_108 = s2_100 + a0_91;
			word32 a0_91;
			word32 s2_100;
			word32 s4_102;
			word32 a5_384;
			word32 s3_385;
			word32 a1_382;
			word32 a4_383;
			s0_130 = prvListTasksWithinSingleList.part.11(s1_120, a5_112, 0x02, 0x4200E000, a5_112, mstatus, dwArg88, dwArgF8, dwArg0138, out s1_120, out a0_91, out a1_382, out a3, out a4_383, out a5_384, out s2_100, out s3_385, out s4_102);
			a5_112 = s2_108 * 0x24 + s4_102;
		}
		if (true)
		{
			s2_108 = s2_132 + a0_123;
			word32 a0_123;
			word32 s2_132;
			word32 s4_134;
			word32 a1_386;
			word32 a4_387;
			word32 a5_388;
			word32 s3_389;
			s0_130 = prvListTasksWithinSingleList.part.11(s1_120, a5_112, 0x02, 0x4200E000, a5_112, mstatus, dwArg88, dwArgF8, dwArg0138, out s1_120, out a0_123, out a1_386, out a3, out a4_387, out a5_388, out s2_132, out s3_389, out s4_134);
			a5_112 = s2_108 * 0x24 + s4_134;
		}
		Eq_2 a4_148 = g_t4201280C;
		if (a4_148 != 0x00)
		{
			s2_108 = s2_165 + a0_156;
			word32 a0_156;
			word32 s2_165;
			word32 s4_167;
			word32 a4_391;
			word32 a5_392;
			word32 s3_393;
			word32 a1_390;
			s0_130 = prvListTasksWithinSingleList.part.11(s1_120, a5_112, 0x04, a4_148, a5_112, mstatus, dwArg88, dwArgF8, dwArg0138, out s1_120, out a0_156, out a1_390, out a3, out a4_391, out a5_392, out s2_165, out s3_393, out s4_167);
			a5_112 = s2_108 * 0x24 + s4_167;
		}
		a1.u0 = 0x42012000;
		a4_181 = g_t420127F8;
		if (a4_181 != 0x00)
		{
			word32 a0_189;
			word32 s2_198;
			word32 s1_394;
			word32 s3_395;
			word32 s4_396;
			s0_130 = prvListTasksWithinSingleList.part.11(s1_120, a5_112, 0x03, a4_181, a5_112, mstatus, dwArg88, dwArgF8, dwArg0138, out s1_394, out a0_189, out a1, out a3, out a4_181, out a5_112, out s2_198, out s3_395, out s4_396);
			s2_108 = s2_198 + a0_189;
		}
		if (s0_130 != null)
			*s0_130 = 0x00;
	}
	ptr32 a5_234;
	word32 t3_377;
	word32 s1_370;
	word32 a0_371;
	word32 a2_372;
	word32 a3_373;
	word32 a4_374;
	word32 a6_375;
	word32 s4_376;
	word32 s0_369;
	xTaskResumeAll(a3, a4_181, a5_112, mstatus, dwArg0138, dwArg0178, out s0_369, out s1_370, out a0_371, out a2_372, out a3_373, out a4_374, out a5_234, out a6_375, out s4_376, out t3_377);
	a0Out = s2_108;
	a1Out = a1;
	a5Out = a5_234;
	s8Out = s4;
	return s1;
}

