pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23030CDE: Register int32 uxTaskGetStackHighWaterMark(Register word32 a0, Register Eq_2 a4)
// Called from:
//      aws_main_entry
int32 uxTaskGetStackHighWaterMark(word32 a0, Eq_2 a4)
{
	int32 a3_11;
	if (a0 != 0x00)
	{
		a3_11 = (word32) *a4;
		if (a3_11 != 0x00A5)
			return a3_11;
	}
	else
	{
		a3_11 = (word32) *a4;
		if (a3_11 != 0x00A5)
			return a3_11;
	}
	int32 a0_17 = 0x00;
	do
		++a0_17;
	while ((word32) *((word32) a4 + a0_17) == 0x00A5);
	return 0x00A5;
}

// 23030D24: Register Eq_2 xTaskGetCurrentTaskHandle(Register out ptr32 a5Out)
// Called from:
//      ipc_emb_init
//      bl_output
//      xQueueGiveMutexRecursive
//      xQueueTakeMutexRecursive
//      xStreamBufferSend
//      xStreamBufferReceive
//      aos_task_key_create
//      aos_task_setspecific
//      aos_task_getspecific
//      bloop_run
Eq_2 xTaskGetCurrentTaskHandle(ptr32 & a5Out)
{
	Eq_2 a0_5 = g_t4200DE38;
	a5Out = 0x4200E000;
	return a0_5;
}

// 23030D2E: Register ui32 xTaskGetSchedulerState(Register out Eq_2 a5Out)
// Called from:
//      xEventGroupWaitBits
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      xTimerGenericCommand
ui32 xTaskGetSchedulerState(union Eq_2 & a5Out)
{
	Eq_2 a5_12 = g_t4200DE64;
	ui32 a0_10 = 0x01;
	if (a5_12 != 0x00)
	{
		a5_12.u0 = 0x4200E000;
		a0_10 = (word32) (g_t4200DE50 < 1) << 1;
	}
	a5Out = a5_12;
	return a0_10;
}

// 23030D4A: Register word32 xTaskPriorityInherit(Register word32 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register out ptr32 s4Out)
// Called from:
//      xQueueSemaphoreTake
word32 xTaskPriorityInherit(word32 a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 & s4Out)
{
	if (a0 == 0x00)
	{
		s4Out = s4;
		return a1;
	}
	else
	{
		Eq_2 a4_21 = *((word32) a4 + 44);
		if (a3 < a4_21)
		{
			word32 a0_28 = *((word32) a4_21 + 24);
			if (a4_21 >= 0x00)
				(32 - a2)->dw0018 = a0_28;
			Eq_2 s0_40 = *((word32) a3 + 20);
			Eq_2 a4_43 = a3 * 0x14 + 1107371324;
			if (a3 != a4_43)
			{
				*((word32) *((word32) a4_43 + 44) + 44) = s0_40;
				s4Out = dwArg04;
				return a1;
			}
			Eq_2 s0_51;
			word32 a4_165;
			word32 a5_166;
			if (uxListRemove(a3, a4_43, out a4_165, out a5_166) == 0x00)
			{
				s0_51 = *((word32) a3 + 44);
				if (*((char *) &g_t4201253C + a3 * 0x14) == 0x00)
					*(~(0x01 << a3) & a2) = (union Eq_2 *) *a2;
			}
			else
				s0_51 = s0_40;
			Eq_2 a4_70 = *a2;
			*((word32) a3 + 44) = s0_51;
			Eq_2 a5_80 = 0x01 << a3 | a2;
			*a5_80 = a4_70;
			word32 a5_167;
			vListInsertEnd((word32) s0_40 + 4, a4_70, a5_80, out a5_167);
			a1 = (word32) s0_40 + 4;
		}
		s4Out = dwArg04;
		return a1;
	}
}

// 23030E2C: Register Eq_2 xTaskPriorityDisinherit(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_150765) a5Out)
// Called from:
//      prvCopyDataToQueue
Eq_2 xTaskPriorityDisinherit(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a4Out, struct Eq_150765 & a5Out)
{
	if (a0 == 0x00)
	{
		a0Out = 0x00;
		a1Out = a1;
		a4Out = a4;
		a5Out = a5;
		return s1;
	}
	Eq_2 a5_19 = g_t4200DE38;
	if (a5_19 != a0)
		vAssertCalled(a4, mstatus, out a5_19);
	struct Eq_150765 * a5_134;
	Eq_2 s0_31;
	if (a5_19 != 0x00)
	{
		s0_31 = *((word32) a4 + 80);
		a5_134 = (word32) a5_19 - 1;
		a5_134->t0054 = s0_31;
		if (a3 == a4)
			goto l23030E5A;
	}
	else
	{
		struct Eq_157503 * a5_26;
		vAssertCalled(a4, mstatus, out a5_26);
		s0_31 = *((word32) a4 + 80);
		a5_26->t0053 = s0_31;
		a5_134 = (struct Eq_150765 *) ((char *) a5_26 - 1);
		if (a3 == a4)
			goto l23030E5A;
	}
	if (a5_134 == null)
	{
		Eq_2 s1_40 = (word32) s0_31 + 4;
		ui32 a4_45;
		word32 a5_152;
		if (uxListRemove(a3, a4, out a4_45, out a5_152) == 0x00 && *((char *) (&g_t4201253C) + a4_45 * 0x14) == 0x00)
			*(~(0x01 << a4_45) & a3) = (word32) *a3;
		Eq_2 s0_70 = *((word32) a3 + 80);
		word32 a2_75 = *a1;
		*((word32) a3 + 44) = s0_70;
		*((word32) s0_70 + 24) = 32 - a3;
		Eq_2 a5_83 = 0x01 << a3 | a1;
		*a5_83 = a2_75;
		struct Eq_150765 * a5_92;
		vListInsertEnd(s1_40, a3 * 0x14, a5_83, out a5_92);
		a0Out = 0x01;
		a1Out = s1_40;
		a4Out = a3 * 0x14;
		a5Out = a5_92;
		return s1_40;
	}
l23030E5A:
	a0Out = 0x00;
	a1Out = a1;
	a4Out = a4;
	a5Out = a5_134;
	return s1;
}

// 23030F04: Register Eq_2 vTaskPriorityDisinheritAfterTimeout(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out)
// Called from:
//      xQueueSemaphoreTake
Eq_2 vTaskPriorityDisinheritAfterTimeout(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg38, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & s2Out)
{
	if (a0 == 0x00)
	{
		a1Out = a1;
		a3Out = a3;
		s2Out = s2;
		return s1;
	}
	Eq_2 s2_198;
	Eq_2 a0_14 = *((word32) a5 + 84);
	Eq_2 s1_16 = a1;
	if (a5 != 0x00)
	{
		s2_198 = *((word32) a0_14 + 80);
		if (s2_198 >= a1)
		{
l23030F20:
			if (a5 == s2_198)
				goto l23030F2E;
l23030F26:
			Eq_2 s0_38 = *((word32) a3 + 84);
			if (a3 == 0x01)
			{
				Eq_2 a4_41 = g_t4200DE38;
				if (a4_41 == s0_38)
					a2 = vAssertCalled(a4_41, mstatus, out a5);
				struct Eq_157625 * s0_50 = *((word32) a4_41 + 24);
				s0_50->t002C = s2_198;
				if (a4_41 >= 0x00)
				{
					s2_198 = 32 - s2_198;
					s0_50->t0018 = s2_198;
				}
				Eq_2 a4_60 = a5 << 0x02;
				word32 s0_64 = *((word32) a4_60 + 20);
				s1_16.u0 = 1107371324;
				if (a4_60 == (a5 + a4_60 << 2) + 1107371324)
				{
					ui32 a3_114;
					word32 a4_206;
					word32 a5_207;
					ui32 a0_72 = uxListRemove(a3, a4_60, out a4_206, out a5_207);
					if (a0_72 != 0x00)
						a3_114 = 0x01 << a0_72;
					else
					{
						a3_114 = 0x01 << a0_72;
						if (*((char *) &g_t4201253C + a0_72 * 0x14) == 0x00)
						{
							a2 = ~a3_114 & a1;
							*a2 = *a1;
						}
					}
					Eq_2 a4_109 = *a2;
					Eq_2 a3_115 = a3_114 | a2;
					*a3_115 = a4_109;
					0x00 = (uint16) dwArg38;
					word32 a5_208;
					vListInsertEnd(s0_64 + 4, a4_109, a0_72 * 0x05, out a5_208);
					a1Out = s0_64 + 4;
					a3Out = a3_115;
					s2Out = s0_64 + 4;
					return 1107371324;
				}
			}
l23030F2E:
			0x00 = (uint16) dwArg38;
			a1Out = a1;
			a3Out = a3;
			s2Out = s2_198;
			return s1_16;
		}
	}
	else
	{
		a2 = vAssertCalled(a4, mstatus, out a5);
		s2_198 = *((word32) a0_14 + 80);
		if (s2_198 >= a1)
			goto l23030F20;
	}
	s2_198 = a1;
	if (a5 == a1)
		goto l23030F2E;
	goto l23030F26;
}

