pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303100A: Register Eq_2 vTaskEnterCritical(Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a5Out)
// Called from:
//      rxl_hwdesc_init
//      txl_frame_get
//      rxu_swdesc_upload_evt
//      bl_tx_resend
//      bl_tx_try_flush
//      bl_output
//      my_pbuf_free_custom
//      stateConnectedIPNoEnter
//      cmd_wifi_dump
//      wifi_mgmr_sta_ip_unset
//      wifi_mgmr_scan_filter_hidden_ssid
//      bl_sys_time_sync_state
//      xEventGroupWaitBits
//      prvUnlockQueue
//      xQueueGenericReset
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      uxQueueMessagesWaiting
//      vQueueWaitForMessageRestricted
//      xStreamBufferSend
//      xStreamBufferReceive
//      prvCheckForValidListAndQueue
//      pvTimerGetTimerID
//      bl_dma_copy
//      loopset_led_trigger
//      sys_arch_protect
//      sntp_recv
//      sntp_get_time
//      vfs_uart_poll
//      bloop_evt_set_async
//      bloop_run
Eq_2 vTaskEnterCritical(Eq_2 a4, ptr32 mstatus, union Eq_2 & a5Out)
{
	__csrrc(mstatus, 0x08);
	Eq_2 a5_6 = g_t4200DE64;
	if (a5_6 == 0x00)
	{
		a5Out = a5_6;
		return a4;
	}
	else
	{
		Eq_2 a5_9;
		Eq_2 a4_8 = vTaskEnterCritical.part.7(a4, out a5_9);
		a5Out = a5_9;
		return a4_8;
	}
}

// 2303101E: Register Eq_2 vTaskExitCritical(Register Eq_2 a3, Register ptr32 mstatus, Register out (ptr32 (ptr32 Eq_2)) a4Out, Register out Eq_2 a5Out)
// Called from:
//      rxl_hwdesc_init
//      txl_frame_get
//      rxu_swdesc_upload_evt
//      bl_tx_resend
//      bl_tx_try_flush
//      bl_output
//      my_pbuf_free_custom
//      stateConnectedIPNoEnter
//      cmd_wifi_dump
//      wifi_mgmr_sta_ip_unset
//      wifi_mgmr_scan_filter_hidden_ssid
//      bl_sys_time_sync_state
//      xEventGroupWaitBits
//      prvUnlockQueue
//      xQueueGenericReset
//      xQueueGenericSend
//      xQueueReceive
//      xQueueSemaphoreTake
//      uxQueueMessagesWaiting
//      vQueueWaitForMessageRestricted
//      xStreamBufferSend
//      xStreamBufferReceive
//      prvCheckForValidListAndQueue
//      pvTimerGetTimerID
//      bl_dma_copy
//      loopset_led_trigger
//      sys_arch_unprotect
//      sntp_recv
//      sntp_get_time
//      vfs_uart_poll
//      bloop_evt_set_async
//      bloop_run
Eq_2 vTaskExitCritical(Eq_2 a3, ptr32 mstatus, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a5_20 = g_t4200DE64;
	if (a5_20 != 0x00)
	{
		a5_20 = *((word32) g_t4200DE38 + 0x0044);
		if (a5_20 != 0x00)
		{
			union Eq_2 ** a4_12;
			Eq_2 a5_13;
			Eq_2 a3_11 = vTaskExitCritical.part.8(a3, mstatus, out a4_12, out a5_13);
			a4Out = a4_12;
			a5Out = a5_13;
			return a3_11;
		}
	}
	a4Out = a4;
	a5Out = a5_20;
	return a3;
}

// 2303103A: Register Eq_2 vTaskList(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 byte) a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s7, Register Eq_2 s9, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack word32 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198)
// Called from:
//      ps_cmd
Eq_2 vTaskList(Eq_2 ra, Eq_2 s1, byte * a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s5, Eq_2 s7, Eq_2 s9, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg34, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArg0108, word32 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0198)
{
	Eq_2 a5_28 = **s1;
	*a0 = 0x00;
	word32 a0_38;
	Eq_2 a3_41;
	struct Eq_157157 * a4_42;
	Eq_2 s1_46;
	word32 s3_396;
	word32 s4_397;
	word32 s8_398;
	word32 a1_391;
	word32 a2_392;
	word32 s2_395;
	word32 a5_393;
	word32 a6_394;
	pvPortMalloc(ra, s1, a5_28 * 0x24, a3, a4, a5_28, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_46, out a0_38, out a1_391, out a2_392, out a3_41, out a4_42, out a5_393, out a6_394, out s2_395, out s3_396, out s4_397, out s8_398);
	if (a0_38 == 0x00)
	{
		0x00 = dwArg0128;
		return s1_46;
	}
	else
	{
		word32 a0_67;
		struct Eq_157778 * s8_77;
		union Eq_133241 * a1_104;
		Eq_2 a5_189;
		Eq_2 s0_108 = uxTaskGetSystemState(a0_38, s1_46, null, a3_41, a4_42, mstatus, s5, dwArgC8, dwArg0108, dwArg0148, out a0_67, out a1_104, out a5_189, out s8_77);
		if (a0_67 != 0x00)
		{
			struct Eq_157778 * s1_192 = s8_77;
			word32 s6_150 = 0x23082000;
			up32 s5_177 = 0x04;
			Eq_2 s4_121 = 0x0E;
			int32 s3_175 = 32;
			do
			{
				s5_177 < (word32) s1_192->b000C;
				word32 a5_400;
				word32 a4_399;
				strcpy(s0_108, a1_104, out a4_399, out a5_400);
				word32 a1_401;
				word32 a2_402;
				word32 a5_405;
				word32 a3_403;
				word32 a4_404;
				Eq_2 a0_114 = strlen(s0_108, out a1_401, out a2_402, out a3_403, out a4_404, out a5_405);
				if (s4_121 >= a0_114)
				{
					word32 a0_122 = a0_114 + s0_108;
					byte * a5_123 = (word32) s0_108 + 0x0F;
					do
					{
						*a0_122 = (byte) s3_175;
						++a0_122;
					} while (a5_123 != a0_122);
					a0_114.u0 = 0x0F;
				}
				word32 s0_133 = s0_108 + a0_114;
				s0_133->u1 = 0x00;
				Eq_2 s0_170;
				word32 s1_171;
				word32 s2_174;
				word32 s11_411;
				word32 a0_406;
				word32 a5_407;
				word32 s10_410;
				word32 s7_408;
				word32 s9_409;
				ra = sprintf(ra, s0_133, s6_150 + 2004, dwLoc18, dwArg08, dwArg34, s9, s7, dwArg78, dwArg9C, out s0_170, out s1_171, out a0_406, out a5_407, out s2_174, out s3_175, out s4_121, out s5_177, out s6_150, out s7_408, out s9_409, out s10_410, out s11_411);
				s1_192 = s1_171 + 36;
				word32 a2_412;
				word32 a3_413;
				word32 a4_414;
				s0_108 = s0_170 + strlen(s0_170, out a1_104, out a2_412, out a3_413, out a4_414, out a5_189);
			} while (s1_171 + 36 != s2_174);
		}
		0x00 = dwArg0128;
		Eq_2 s1_218;
		word32 a6_422;
		word32 t3_424;
		word32 s4_423;
		word32 a3_419;
		word32 a5_421;
		word32 a4_420;
		word32 a0_416;
		word32 a2_418;
		word32 a1_417;
		word32 s0_415;
		vPortFree(s5, dwArgB8, a5_189, mstatus, dwArg0158, dwArg0198, out s0_415, out s1_218, out a0_416, out a1_417, out a2_418, out a3_419, out a4_420, out a5_421, out a6_422, out s4_423, out t3_424);
		return s1_218;
	}
}

// 23031138: Register (ptr32 Eq_150186) uxTaskResetEventItemValue(Register (ptr32 Eq_150186) a3, Register Eq_2 a4)
// Called from:
//      xEventGroupWaitBits
struct Eq_150186 * uxTaskResetEventItemValue(struct Eq_150186 * a3, Eq_2 a4)
{
	struct Eq_150186 * a3_12 = a3->ptr002C;
	(32 - a3_12)->t0018 = a4;
	return a3_12;
}

// 23031154: Register Eq_2 pvTaskIncrementMutexHeldCount(Register Eq_2 a0, Register Eq_2 a4, Register out Eq_2 a4Out, Register out (ptr32 Eq_152800) a5Out)
// Called from:
//      xQueueSemaphoreTake
Eq_2 pvTaskIncrementMutexHeldCount(Eq_2 a0, Eq_2 a4, union Eq_2 & a4Out, struct Eq_152800 & a5Out)
{
	if (a4 != 0x00)
	{
		a3 = *((word32) a4 + 84);
		*((word32) a4 + 0x0055) = a3;
		a4 = (word32) a4 + 1;
	}
	struct Eq_152800 * a5_15 = *a0;
	a4Out = a4;
	a5Out = a5_15;
	return a3;
}

