pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303116C: Register word32 ulTaskNotifyTake(Register (ptr32 Eq_62092) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack word32 dwArg0128, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_62092) s2Out, Register out Eq_2 s3Out)
// Called from:
//      ipc_emb_wait
//      bloop_run
word32 ulTaskNotifyTake(struct Eq_62092 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, word32 dwArg0128, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_62092 & s2Out, union Eq_2 & s3Out)
{
	__csrrc(mstatus, 0x08);
	struct Eq_62092 * s2_15 = a0;
	Eq_2 s3_17 = a1;
	if (a5 != 0x00)
		a4 = vTaskEnterCritical.part.7(a4, out a5);
	Eq_2 a5_29 = *((word32) a5 + 88);
	if (a5_29 == 0x00)
	{
		((word32) a5_29 + 92)->u1 = 0x01;
		a4.u0 = 0x01;
		if (a1 != 0x00)
		{
			word32 a2_216;
			word32 a1_215;
			word32 s1_214;
			word32 s4_217;
			prvAddCurrentTaskToDelayedList(a1, 0x01, a2, a3, 0x01, dwArg18, out s1_214, out a0, out a1_215, out a2_216, out a4, out a5_29, out s2_15, out s3_17, out s4_217);
			__syscall();
		}
	}
	if (a5_29 != 0x00)
	{
		a5_29 = *((word32) a5_29 + 0x0044);
		if (a5_29 != 0x00)
			a3 = vTaskExitCritical.part.8(a3, mstatus, out a4, out a5_29);
	}
	__csrrc(mstatus, 0x08);
	if (a5_29 != 0x00)
	{
		word32 a5_218;
		a4 = vTaskEnterCritical.part.7(a4, out a5_218);
	}
	Eq_2 a5_81 = a0->t0058;
	if (a0 != null)
	{
		if (s2_15 != null)
			((word32) a5_81 + 88)->u0 = 0x00;
		else
		{
			a4 = (char *) a0 - 1;
			*((word32) a4 + 88) = a5_81;
		}
	}
	((word32) a5_81 + 92)->u1 = 0x00;
	word32 s1_94 = *a5_81;
	if (a5_81 != 0x00 && *((word32) a5_81 + 0x0044) != 0x00)
	{
		word32 a5_219;
		a3 = vTaskExitCritical.part.8(a3, mstatus, out a4, out a5_219);
	}
	0x00 = dwArg0128;
	a2Out = dwArg0100;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2_15;
	s3Out = s3_17;
	return s1_94;
}

// 23031212: Register word32 xTaskNotifyWait(Register (ptr32 Eq_154046) a0, Register Eq_154047 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_154046) s1Out, Register out ptr32 a2Out, Register out (ptr32 (ptr32 Eq_2)) a4Out, Register out Eq_2 a5Out, Register out Eq_154047 s2Out, Register out (ptr32 Eq_2) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out)
// Called from:
//      xStreamBufferSend
//      xStreamBufferReceive
word32 xTaskNotifyWait(struct Eq_154046 * a0, Eq_154047 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg0128, struct Eq_154046 & s1Out, ptr32 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_154047 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out)
{
	__csrrc(mstatus, 0x08);
	struct Eq_154046 * s1_19 = a0;
	Eq_154047 s2_107 = a1;
	Eq_2 s4_23 = a2;
	union Eq_2 * s3_28 = &g_t4200DE64;
	Eq_2 a5_29 = g_t4200DE64;
	if (a5_29 != 0x00)
		vTaskEnterCritical.part.7(a4, out a5_29);
	Eq_2 a4_37 = 0x02;
	if ((word32) *((word32) a5_29 + 92) != 0x02)
	{
		Eq_2 a5_44 = a0->t0058;
		s1_19 = ~a0 & a0;
		s1_19->t0058 = a5_44;
		((word32) a5_44 + 92)->u1 = 0x01;
		a4_37.u0 = 0x01;
		if (a3 != 0x00)
		{
			word32 a1_267;
			word32 a2_268;
			word32 a5_269;
			word32 a0_266;
			prvAddCurrentTaskToDelayedList(a3, 0x01, a2, a3, 0x01, dwArg18, out s1_19, out a0_266, out a1_267, out a2_268, out a4_37, out a5_269, out s2_107, out s3_28, out s4_23);
			__syscall();
		}
	}
	Eq_2 a3_134;
	Eq_2 a5_71 = *s3_28;
	a3_134 = a3;
	if (a5_71 != 0x00)
	{
		a3_134 = a3;
		if (*((word32) a5_71 + 0x0044) != 0x00)
		{
			word32 a5_270;
			a3_134 = vTaskExitCritical.part.8(a3, mstatus, out a4_37, out a5_270);
		}
	}
	__csrrc(mstatus, 0x08);
	Eq_2 a5_83 = *s3_28;
	if (a5_83 != 0x00)
		vTaskEnterCritical.part.7(a4_37, out a5_83);
	if (s4_23 != 0x00)
	{
		a5_83 = *((word32) a5_83 + 88);
		*s4_23 = a5_83;
	}
	union Eq_2 ** a4_100 = (union Eq_2 **) 0x02;
	struct Eq_158155 * a5_102 = (word32) *((word32) a5_83 + 92);
	if (a5_102 == (struct Eq_158155 *) 0x02)
	{
		ui32 s2_109 = ~s2_107;
		a5_102 = *(struct Eq_158155 **) 0x5A;
		a5_102->dw0058 = s2_109 & 0x02;
		s2_107 = s2_109 & 0x02;
	}
	a5_102->b005C = 0x00;
	Eq_2 a5_121 = *s3_28;
	if (a5_121 != 0x00)
	{
		a5_121 = *((word32) a5_121 + 0x0044);
		if (a5_121 != 0x00)
			vTaskExitCritical.part.8(a3_134, mstatus, out a4_100, out a5_121);
	}
	0x00 = (uint16) dwArg0128;
	s1Out = s1_19;
	a2Out = dwArg0100;
	a4Out = a4_100;
	a5Out = a5_121;
	s2Out = s2_107;
	s3Out = s3_28;
	s4Out = dwArg78;
	s5Out = a3;
	return dwArgE4;
}

// 230312F2: Register Eq_2 xTaskGenericNotify(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_62063 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      bl_irq_handler
//      bl_tx_notify
//      xStreamBufferSend
//      xStreamBufferReceive
//      bloop_evt_set_async
Eq_2 xTaskGenericNotify(Eq_2 ra, Eq_2 a0, ptr32 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_62063 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	Eq_2 a2_26;
	Eq_2 s0_17 = a0;
	Eq_2 s1_21 = a2;
	a2_26 = a2;
	if (a0 == 0x00)
	{
		word32 a5_290;
		a2_26 = vAssertCalled(a4, mstatus, out a5_290);
	}
	__csrrc(mstatus, 0x08);
	Eq_2 a5_32 = g_t4200DE64;
	if (a5_32 != 0x00)
		a4 = vTaskEnterCritical.part.7(a4, out a5_32);
	if (a3 != 0x00)
	{
		s0_17 = *((word32) a5_32 + 88);
		*a3 = a5_32;
	}
	ui32 s2_46 = (word32) *((word32) s0_17 + 92);
	((word32) s0_17 + 92)->u1 = 0x02;
	Eq_62063 s2_264 = s2_46 & 0x00FF;
	if (a2 > 0x04)
	{
		Eq_2 s0_56 = *((word32) a4 + 88);
		if (a4 != ~0x00)
		{
			word32 a5_291;
			a2_26 = vAssertCalled(a4, mstatus, out a5_291);
		}
		ptr32 a1_238;
		a1_238 = a1;
		if ((s2_46 & 0x00FF) == 0x01)
		{
			word32 a4_292;
			word32 a5_293;
			uxListRemove(a3, a4, out a4_292, out a5_293);
			a4 = *a2_26;
			s2_264 = (s2_46 & 0x00FF) << a3 | a2_26;
			*a4 = s2_264;
			word32 a5_94;
			vListInsertEnd((word32) s0_56 + 4, a4, a3 * 0x14, out a5_94);
			s1_21 = (word32) s0_56 + 4;
			a1_238 = (word32) s0_56 + 4;
			if (a5_94 != 0x00)
			{
				word32 a5_294;
				vAssertCalled(a4, mstatus, out a5_294);
			}
			if (*((word32) g_t4200DE38 + 44) < a4)
				__syscall();
		}
		Eq_2 a5_112 = g_t4200DE64;
		if (a5_112 != 0x00)
		{
			a5_112 = *((word32) g_t4200DE38 + 0x0044);
			if (a5_112 != 0x00)
				a3 = vTaskExitCritical.part.8(a3, mstatus, out a4, out a5_112);
		}
		0x00 = (uint16) dwArg0128;
		s0Out = dwArgE4;
		s1Out = s1_21;
		a0Out = 0x01;
		a1Out = a1_238;
		a2Out = dwArg0100;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_112;
		s2Out = s2_264;
		s3Out = 0x4200DE64;
		s4Out = a1;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s0_156;
		Eq_2 s1_157;
		Eq_62063 s2_158;
		ptr32 s4_159;
		Eq_2 ra_160;
		ptr32 s3_161;
		ptr32 a0_162;
		ptr32 a1_163;
		Eq_2 a2_164;
		Eq_2 a3_165;
		ptr32 mstatus_166;
		Eq_2 a5_167;
		Eq_2 a4_168;
		(*(<anonymous> *) 0x04)();
		s0Out = s0_156;
		s1Out = s1_157;
		a0Out = a0_162;
		a1Out = a1_163;
		a2Out = a2_164;
		a3Out = a3_165;
		a4Out = a4_168;
		a5Out = a5_167;
		s2Out = s2_158;
		s3Out = s3_161;
		s4Out = s4_159;
		mstatusOut = mstatus_166;
		return ra_160;
	}
}

// 23031420: Register Eq_2 xTaskGenericNotifyFromISR(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_2) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack word32 dwArg28, Stack word32 dwArg44, Stack Eq_2 dwArg84, Register out Eq_2 s0Out, Register out Eq_154333 s1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      xStreamBufferSendFromISR
//      xStreamBufferReceiveFromISR
Eq_2 xTaskGenericNotifyFromISR(Eq_2 ra, Eq_2 a0, union Eq_2 * a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, word32 dwArg00, word32 dwArg04, word32 dwArg28, word32 dwArg44, Eq_2 dwArg84, union Eq_2 & s0Out, union Eq_154333 & s1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, ptr32 & mstatusOut)
{
	Eq_2 s0_13 = a0;
	if (a0 == 0x00)
	{
		vAssertCalled(a4, mstatus, out a5);
		dwLoc1C = a2;
		a2 = dwArg84;
		s0_13 = a3;
	}
	if (a3 != 0x00)
	{
		s0_13 = *((word32) a5 + 88);
		*a5 = a3;
	}
	ui32 s1_37 = (word32) *((word32) s0_13 + 92);
	((word32) s0_13 + 92)->u1 = 0x02;
	Eq_154333 s1_234 = s1_37 & 0x00FF;
	if (a2 > 0x04)
	{
		Eq_2 s0_104 = *((word32) a4 + 88);
		if (a4 != ~0x00)
		{
			word32 a5_262;
			a2 = vAssertCalled(a4, mstatus, out a5_262);
		}
		Eq_2 a4_103;
		Eq_2 a5_105 = 0x01;
		a4_103 = a4;
		if ((s1_37 & 0x00FF) == 0x01)
		{
			Eq_2 s0_55 = *(union Eq_2 *) 0x29;
			if (true)
			{
				word32 a5_263;
				a2 = vAssertCalled(a4, mstatus, out a5_263);
			}
			Eq_2 a5_62 = g_t4200DE50;
			if (a5_62 != 0x00)
			{
				word32 a5_267;
				vListInsertEnd((word32) s0_55 + 24, a4, a5_62, out a5_267);
				a4_103 = a4;
			}
			else
			{
				word32 a5_265;
				word32 a4_264;
				uxListRemove(a3, a4, out a4_264, out a5_265);
				a3 = *a1;
				Eq_2 a5_89 = 0x01 << a2 | a1;
				*a5_89 = a3;
				ui32 a4_83 = a2 * 0x05;
				word32 a5_266;
				vListInsertEnd((word32) s0_55 + 4, a4_83 << 2, a5_89, out a5_266);
				s1_234 = (word32) s0_55 + 4;
				a4_103 = a4_83 << 2;
			}
			s0_104 = *((word16) a4_103.u0 + 44);
			a5_105 = *((word32) g_t4200DE38 + 44);
			if (a5_105 < a4_103)
			{
				if (a4 != 0x00)
					*a4 = 0x01;
				g_dw4200EE6C = 0x01;
				a5_105.u0 = 0x4200E000;
				a4_103.u0 = 0x01;
			}
		}
		s0Out = s0_104;
		s1Out = s1_234;
		a3Out = a3;
		a4Out = a4_103;
		a5Out = a5_105;
		s2Out = a4;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 s0_139;
		Eq_2 s2_140;
		Eq_2 ra_141;
		Eq_154333 s1_142;
		Eq_2 a4_144;
		Eq_2 a3_145;
		Eq_2 a5_146;
		word32 tp_149;
		ptr32 mstatus_154;
		g_t230827C0();
		s0Out = s0_139;
		s1Out = s1_142;
		a3Out = a3_145;
		a4Out = a4_144;
		a5Out = a5_146;
		s2Out = s2_140;
		mstatusOut = mstatus_154;
		return ra_141;
	}
}

