pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303153C: void vTaskNotifyGiveFromISR(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg38)
// Called from:
//      bl_irq_handler
void vTaskNotifyGiveFromISR(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg38)
{
	if (a0 == 0x00)
	{
		word32 a5_156;
		a2 = vAssertCalled(a4, mstatus, out a5_156);
	}
	Eq_2 a4_23 = (word32) *((word32) a0 + 92);
	((word32) a0 + 92)->u1 = 0x02;
	*(struct Eq_158155 **) 0x5B = *(struct Eq_158155 **) 0x5A;
	if (a4_23 == 0x01)
	{
		Eq_2 s0_29 = *(union Eq_2 *) 0x2B;
		if (true)
		{
			word32 a5_157;
			a2 = vAssertCalled(a4_23, mstatus, out a5_157);
		}
		Eq_2 a5_35 = g_t4200DE50;
		if (a5_35 != 0x00)
		{
			word32 a5_161;
			vListInsertEnd((word32) s0_29 + 24, a4_23, a5_35, out a5_161);
		}
		else
		{
			word32 a5_159;
			word32 a4_158;
			uxListRemove(0x01, a4_23, out a4_158, out a5_159);
			Eq_2 a5_59 = 0x01 << a2 | a1;
			*a5_59 = *a1;
			ui32 a4_53 = a2 * 0x05;
			word32 a5_160;
			vListInsertEnd((word32) s0_29 + 4, a4_53 << 2, a5_59, out a5_160);
			a4_23 = a4_53 << 2;
		}
		if (*((word32) g_t4200DE38 + 44) < a4_23)
		{
			if (a1 != 0x00)
				*(union Eq_2 *) 0x01 = a1;
			g_dw4200EE6C = 0x01;
			0x00 = (uint16) dwArg38;
			return;
		}
	}
	0x00 = (uint16) dwArg38;
}

// 230315FC: Register Eq_2 xTaskNotifyStateClear(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out ptr32 a4Out, Register out Eq_2 a5Out)
// Called from:
//      xStreamBufferSend
//      xStreamBufferReceive
Eq_2 xTaskNotifyStateClear(Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, ptr32 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 s1_11 = a0;
	if (a0 == 0x00)
	{
		a5.u0 = 0x4200E000;
		s1_11 = g_t4200DE38;
	}
	__csrrc(mstatus, 0x08);
	if (a5 != 0x00)
	{
		word32 a5_98;
		vTaskEnterCritical.part.7(a4, out a5_98);
	}
	Eq_2 a5_28 = (word32) *((word32) s1_11 + 92);
	ptr32 a4_29 = 0x02;
	if (a5_28 == 0x02)
		((word32) s1_11 + 92)->u1 = 0x00;
	if (a5_28 != 0x00)
	{
		a5_28 = *((word32) g_t4200DE38 + 0x0044);
		if (a5_28 != 0x00)
			a3 = vTaskExitCritical.part.8(a3, mstatus, out a4_29, out a5_28);
	}
	a4Out = a4_29;
	a5Out = a5_28;
	return a3;
}

// 2303165A: Register word32 prvCheckForValidListAndQueue(Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a6Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      xTimerCreateTimerTask
//      xTimerCreateStatic
word32 prvCheckForValidListAndQueue(Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg0118, ptr32 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a6Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	word32 a5_16;
	vTaskEnterCritical(a4, mstatus, out a5_16);
	if (a5_16 == 0x00)
	{
		vListInitialise(0x42012860);
		vListInitialise(0x42012874);
		g_dw4200EE70 = 0x42012860;
		g_dw4200EE74 = 0x42012874;
		struct Eq_153180 * a0_40;
		word32 a4_108;
		word32 a5_109;
		a0_40->dw0000 = xQueueGenericCreateStatic(0x04, (struct Eq_151190 *) 0x10, &g_t42012820, &g_t42012888, 0x00, mstatus, dwArg0118, out s1, out a0_40, out a3, out a4_108, out a5_109, out s2, out s3, out s4);
		if (a0_40 != null)
			a6 = vQueueAddToRegistry(a0_40, &g_dw23082810, a3);
	}
	0x00 = (uint16) dwArg38;
	ptr32 a4_72;
	word32 a5_110;
	Eq_2 a3_71 = vTaskExitCritical(a3, mstatus, out a4_72, out a5_110);
	s1Out = s1;
	a3Out = a3_71;
	a4Out = a4_72;
	a6Out = a6;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	return dwArg14;
}

// 230316DE: Register Eq_2 prvInsertTimerInActiveList(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register out Eq_2 a5Out)
// Called from:
//      prvTimerTask
Eq_2 prvInsertTimerInActiveList(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, union Eq_2 & a5Out)
{
	*((word32) a1 + 4) = a0;
	*((word32) a0 + 16) = a0;
	if (a2 >= a1)
	{
		Eq_2 a2_31 = a2 - a3;
		if (a2_31 < a4)
		{
			Eq_2 a5_39;
			word32 a4_62;
			vListInsert(g_t4200DE74, a2_31, a3, out a4_62, out a5_39);
			a5Out = a5_39;
			return 0x00;
		}
	}
	else if (a2 >= a3 || a1 < a3)
	{
		word32 a4_63;
		Eq_2 a5_24;
		vListInsert(g_t4200DE70, a2, a3, out a4_63, out a5_24);
		a5Out = a5_24;
		return 0x00;
	}
	a5Out = a0;
	return 0x01;
}

// 23031736: Register word32 xTimerCreateTimerTask(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg64, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0194, Register out ptr32 t0Out, Register out ptr32 a0Out, Register out Eq_2 a4Out)
// Called from:
//      vTaskStartScheduler
word32 xTimerCreateTimerTask(Eq_2 ra, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg64, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0194, ptr32 & t0Out, ptr32 & a0Out, union Eq_2 & a4Out)
{
	Eq_2 a6_15;
	word32 s1_139;
	word32 a3_140;
	word32 s2_141;
	word32 s3_142;
	word32 s4_143;
	Eq_2 a4_13;
	word32 tp_135 = prvCheckForValidListAndQueue(a3, a4, mstatus, dwArg18, dwArgF8, out s1_139, out a3_140, out a4_13, out a6_15, out s2_141, out s3_142, out s4_143);
	if (g_dw4200DE7C != 0x00)
	{
		word32 a0_40;
		word32 s0_145;
		word32 a2_146;
		word32 a3_147;
		word32 a5_148;
		word32 s2_149;
		xTaskCreateStatic(ra, &g_ptr23031932, 0x23082818, dwArg64, 0x00, 0x1F, vApplicationGetTimerTaskMemory(fp + ~0x1B, fp + ~0x17, fp + ~0x13), a6_15, mstatus, 0x00, dwArg04, dwArgC8, dwArg0194, out tp_135, out t0, out s0_145, out a0_40, out a2_146, out a3_147, out a4_13, out a5_148, out s2_149);
		g_dw4200EE80 = a0_40;
		if (a0_40 != 0x00)
		{
			t0Out = t0;
			a0Out = 0x01;
			a4Out = a4_13;
			return tp_135;
		}
	}
	word32 a5_144;
	vAssertCalled(a4_13, mstatus, out a5_144);
	t0Out = t0;
	a0Out = 0x00;
	a4Out = a4_13;
	return tp_135;
}

