pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23031792: Register word32 xTimerCreateStatic(Register (ptr32 Eq_111562) a1, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_111565) a5, Register int32 a7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_111562) s1Out, Register out Eq_2 a3Out)
// Called from:
//      stateConnectedIPNoEnter
//      stateDisconnect_enter
//      wifi_mgmr_start
word32 xTimerCreateStatic(struct Eq_111562 * a1, Eq_2 a3, Eq_2 a4, struct Eq_111565 * a5, int32 a7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArgE8, Eq_2 dwArg0128, struct Eq_111562 & s1Out, union Eq_2 & a3Out)
{
	struct Eq_111562 * s1_142 = a1;
	if (a7 != 44)
	{
		word32 a5_150;
		vAssertCalled(a4, mstatus, out a5_150);
	}
	if (a5 != null)
	{
		a5->b0028 = 0x02;
		if (a1 == null)
		{
			word32 a5_152;
			vAssertCalled(a4, mstatus, out a5_152);
		}
		word32 s2_63;
		word32 s3_64;
		word32 s4_65;
		word32 a4_153;
		word32 a6_154;
		prvCheckForValidListAndQueue(a3, a4, mstatus, dwArg08, dwArgE8, out s1_142, out a3, out a4_153, out a6_154, out s2_63, out s3_64, out s4_65);
		a5->dw0000 = s2_63;
		s1_142->ptr0018 = a5;
		a5->dw001C = s4_65;
		a5->t0020 = a4;
		vListInitialiseItem(&a5->dw0000 + 1);
		if (s3_64 != 0x00)
			a5->b0028 = (byte) ((word32) a5->b0028 | 4);
	}
	else
	{
		word32 a5_151;
		vAssertCalled(a4, mstatus, out a5_151);
	}
	0x00 = (uint16) dwArg0128;
	s1Out = s1_142;
	a3Out = a3;
	return dwArgE4;
}

// 23031814: Register Eq_2 xTimerGenericCommand(Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_2) a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg64, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_2) a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_2) s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out (ptr32 (arr (ptr32 code))) s6Out, Register out Eq_2 s8Out)
// Called from:
//      stateConnectedIPNoExit
//      stateConnectedIPNoEnter
//      stateDisconnect_exit
//      stateDisconnect_enter
//      wifi_mgmr_start
//      prvSwitchTimerLists
//      prvTimerTask
Eq_2 xTimerGenericCommand(Eq_2 a0, Eq_2 a1, union Eq_2 * a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg64, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, <anonymous> * (& s6Out, union Eq_2 & s8Out)
{
	Eq_2 s1_125 = a0;
	union Eq_2 * s2_126 = a3;
	Eq_2 s3_127 = a4;
	if (a0 == 0x00)
		vAssertCalled(a4, mstatus, out a5);
	Eq_2 s0_124 = *a5;
	ptr32 a0_116 = 0x00;
	if (a5 != 0x00)
	{
		if (a1 > 0x05)
		{
			ptr32 a0_50;
			union Eq_2 * a3_53;
			Eq_2 a4_54;
			Eq_2 a5_55;
			Eq_2 s1_59;
			union Eq_2 * s2_60;
			Eq_2 s3_61;
			Eq_2 s0_58 = xQueueGenericSendFromISR(a5, fp + -48, a3, 0x00, a4, a5, mstatus, a1, dwArgE8, out s1_59, out a0_50, out a3_53, out a4_54, out a5_55, out s2_60, out s3_61);
			s1Out = s1_59;
			a0Out = a0_50;
			a3Out = a3_53;
			a4Out = a4_54;
			a5Out = a5_55;
			s2Out = s2_60;
			s3Out = s3_61;
			s4Out.u0 = <invalid>;
			s5Out = s5;
			s6Out = s6;
			s8Out.u0 = <invalid>;
			return s0_58;
		}
		word32 a5_255;
		Eq_2 a0_75 = xTaskGetSchedulerState(out a5_255);
		if (a0_75 == 0x02)
		{
			ptr32 a0_83;
			union Eq_2 * a3_86;
			Eq_2 a4_87;
			Eq_2 a5_88;
			Eq_2 s0_91;
			Eq_2 s1_92;
			union Eq_2 * s2_93;
			Eq_2 s3_94;
			ptr32 s5_96;
			<anonymous> * (* s6_97)[];
			word32 a1_256;
			word32 a2_257;
			word32 a7_258;
			word32 s4_259;
			word32 s8_260;
			xQueueGenericSend(a0_75, fp + -48, 0x00, a4, 0x02, mstatus, a1, dwLoc1C, dwArg64, dwArgD8, dwArg0118, dwArg0158, out s0_91, out s1_92, out a0_83, out a1_256, out a2_257, out a3_86, out a4_87, out a5_88, out a7_258, out s2_93, out s3_94, out s4_259, out s5_96, out s6_97, out s8_260);
			s1Out = s1_92;
			a0Out = a0_83;
			a3Out = a3_86;
			a4Out = a4_87;
			a5Out = a5_88;
			s2Out = s2_93;
			s3Out = s3_94;
			s4Out.u0 = <invalid>;
			s5Out = s5_96;
			s6Out = s6_97;
			s8Out.u0 = <invalid>;
			return s0_91;
		}
		word32 a1_261;
		word32 a2_262;
		word32 a7_263;
		word32 s4_264;
		word32 s8_265;
		xQueueGenericSend(a0_75, fp + -48, 0x00, a4, 0x02, mstatus, a1, dwLoc1C, dwArg64, dwArgD8, dwArg0118, dwArg0158, out s0_124, out s1_125, out a0_116, out a1_261, out a2_262, out a3, out a4, out a5, out a7_263, out s2_126, out s3_127, out s4_264, out s5, out s6, out s8_265);
	}
	s1Out = s1_125;
	a0Out = a0_116;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2_126;
	s3Out = s3_127;
	s4Out.u0 = <invalid>;
	s5Out = s5;
	s6Out = s6;
	s8Out.u0 = <invalid>;
	return s0_124;
}

// 230318A8: Register Eq_2 prvSwitchTimerLists(Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg44, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out Eq_158942 s1Out, Register out (ptr32 Eq_150378) a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_158946) a5Out, Register out (ptr32 Eq_2) s2Out, Register out Eq_2 s3Out, Register out (ptr32 (ptr32 Eq_159089)) s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      prvTimerTask
Eq_2 prvSwitchTimerLists(Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg44, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0138, union Eq_158942 & s1Out, struct Eq_150378 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_158946 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, struct Eq_159089 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	union Eq_2 * s2_15 = &g_t4200DE70;
	while (true)
	{
		struct Eq_158946 * a5_20 = *a4;
		if (a4 == 0x00)
			break;
		s3 = **((word32) s0 + 0x0C);
		word32 a4_29;
		struct Eq_158969 * a5_30;
		uxListRemove(a3, a4, out a4_29, out a5_30);
		a5_30();
		s0 = a5_30->t0020;
		s1 = (word32) s0 + 4;
		ui32 a5_36 = (word32) *((word32) s0 + 40);
		if ((a5_36 & 0x04) != 0x00)
		{
			s0 = (a5_36 & 0x04)->t0018;
			a3.u0 = 0x00;
			Eq_2 a5_41 = (word32) s3 + (a5_36 & 0x04);
			if (s3 < a5_41)
			{
				Eq_2 a0_72 = *s2_15;
				*((word32) a5_41 + 4) = s0;
				*((word32) s0 + 16) = s0;
				word32 a5_156;
				a0 = vListInsert(a0_72, s3, 0x00, out a4, out a5_156);
			}
			else
			{
				word32 a5_153;
				word32 s4_154;
				word32 s8_155;
				s0 = xTimerGenericCommand(s0, 0x00, null, 0x00, a5_41, mstatus, dwArg44, dwArgB8, dwArgC8, dwArgF8, dwArg0138, out s1, out a0, out a3, out a4, out a5_153, out s2_15, out s3, out s4_154, out s5, out s6, out s8_155);
				if (a0 == null)
				{
					word32 a5_157;
					vAssertCalled(a4, mstatus, out a5_157);
				}
			}
		}
	}
	Eq_2 a4_81 = *a3;
	a5_20->t0000 = (<anonymous>) a4_81;
	*s2_15 = (union Eq_2 *) a3;
	s1Out = s1;
	a0Out = a0;
	a3Out = a3;
	a4Out = a4_81;
	a5Out = a5_20;
	s2Out = s2_15;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s8Out = dwLoc1C;
	return s0;
}

// 23031932: void prvTimerTask(Register word32 ra, Register Eq_159055 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
void prvTimerTask(word32 ra, Eq_159055 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	struct Eq_159059 * sp_186 = fp + -80;
	struct Eq_159089 ** s4_271 = &g_t4200DE70;
	union Eq_2 * s3_148 = &g_dw4200DE7C;
	<anonymous> * s6_163[] = g_a230827E8;
	word32 s7_191 = 0x4200DE74;
	Eq_2 s5_162 = 0x09;
l23031972:
	Eq_2 a5_197;
	Eq_2 a4_221;
	Eq_2 a2_105;
	Eq_2 s0_217;
	ptr32 mstatus_205;
	Eq_2 a3_203;
	Eq_2 a4_202;
	struct Eq_159089 * a5_37 = *s4_271;
	Eq_2 s2_147 = a5_37->t0000;
	if (s2_147 != 0x00)
	{
		s2_147 = *a5_37->ptr000C;
		word32 a5_444;
		a4_221 = vTaskSuspendAll(a4, out a5_444);
		Eq_2 a5_57;
		Eq_2 a0_56 = xTaskGetTickCount(out a5_57);
		word32 s1_58 = *a5_57;
		s0_217 = a0_56;
		if (a0_56 >= a5_57)
		{
			*a0_56 = s1_58;
			a2_105.u0 = 0x00;
			if (a0_56 >= s2_147)
			{
				Eq_2 a3_115;
				Eq_2 a4_116;
				word32 t3_460;
				word32 a5_458;
				word32 a6_459;
				word32 a2_457;
				word32 a0_456;
				word32 s1_111;
				struct Eq_159214 ** s4_112;
				Eq_2 s0_110;
				xTaskResumeAll(a3, a4_221, a5_57, mstatus, sp_186->t0158, sp_186->t0198, out s0_110, out s1_111, out a0_456, out a2_457, out a3_115, out a4_116, out a5_458, out a6_459, out s4_112, out t3_460);
				Eq_2 s8_119 = *((char *) *((char *) *s4_112 + 0x0C) + 0x0C);
				word32 a5_462;
				word32 a4_461;
				uxListRemove(a3_115, a4_116, out a4_461, out a5_462);
				ui32 a5_124 = (word32) *((word32) s8_119 + 40);
				if ((a5_124 & 4) == 0x00)
					*((word32) s8_119 + 40) = (byte) (a5_124 & ~0x01);
				else
				{
					Eq_2 a5_135;
					if (prvInsertTimerInActiveList(s8_119, Mem104[s8_119 + 24:int32] + s2_147, s0_110, s2_147, a5_124 & 4, out a5_135) != 0x00)
					{
						word32 a5_472;
						word32 a3_471;
						word32 a0_141;
						Eq_2 a4_154;
						s0_110 = xTimerGenericCommand(s8_119, 0x00, null, 0x00, a5_135, mstatus, sp_186->t0064, sp_186->t00D8, sp_186->t00E8, sp_186->t0118, sp_186->t0158, out s1_111, out a0_141, out a3_471, out a4_154, out a5_472, out s2_147, out s3_148, out s4_112, out s5_162, out s6_163, out s8_119);
						if (a0_141 == 0x00)
						{
							word32 a5_473;
							vAssertCalled(a4_154, mstatus, out a5_473);
						}
					}
				}
				word32 a2_199;
				(*((word32) s8_119 + 32))();
				mstatus = mstatus_205;
				a4 = a4_202;
				a3 = a3_203;
l230319B2:
				do
				{
					word32 s1_469;
					word32 a0_259;
					word32 a1_260;
					word32 s2_269;
					word32 s0_267 = xQueueReceive(*s3_148, &sp_186->t0010, 0x00, a3, a4, a5_197, mstatus, sp_186->t0008, sp_186->t0024, sp_186->t00A4, sp_186->t0118, sp_186->t0158, out s1_469, out a0_259, out a1_260, out a2, out a3, out a4, out a5_197, out s2_269, out s3_148, out s4_271);
					if (a0_259 == 0x00)
						goto l23031972;
					word32 s8_281 = sp_186->dw0004;
					if (a5_197 < 0x00)
					{
						a5_197();
						if (a5_197 < 0x00)
							continue;
						s8_281 = sp_186->dw0004;
					}
					Eq_2 s0_310 = *((word32) a5_197 + 20);
					if (a5_197 != 0x00)
					{
						word32 a5_470;
						uxListRemove(a3, a4, out a4, out a5_470);
					}
					Eq_2 a0_317 = xTaskGetTickCount(out a5_197);
					Eq_159362 s1_320 = *a5_197;
					if (a0_317 < a5_197)
					{
						sp_186->t0084 = a0_317;
						s0_310 = prvSwitchTimerLists(s0_310, a3, a4, mstatus, sp_186->t0044, sp_186->t00B8, sp_186->t00C8, sp_186->t00F8, sp_186->t0138, out s1_320, out a0_317, out a3, out a4, out a5_197, out s2_269, out s3_148, out s4_271, out s5_162, out s6_163, out s8_281);
					}
					*a0_317 = s1_320;
				} while (s5_162 < a5_197);
				<anonymous> * a5_371 = s6_163[a5_197];
				word32 a2_410;
				word32 a4_413;
				word32 a3_414;
				word32 mstatus_416;
				a5_371();
				return;
			}
			goto l2303199C;
		}
	}
	else
	{
		word32 a5_443;
		a4_221 = vTaskSuspendAll(a4, out a5_443);
		Eq_2 a5_43;
		Eq_2 a0_42 = xTaskGetTickCount(out a5_43);
		word32 s1_44 = *a5_43;
		s0_217 = a0_42;
		if (a0_42 >= a5_43)
		{
			*a0_42 = s1_44;
			a2_105 = (word32) (a2 < 1);
l2303199C:
			word32 t3_468;
			word32 s4_467;
			word32 a6_466;
			word32 a2_465;
			word32 s1_464;
			word32 s0_463;
			Eq_2 a4_228;
			Eq_2 a5_229;
			word32 a0_238;
			xTaskResumeAll(vQueueWaitForMessageRestricted(*s3_148, s2_147 - s0_217, a2_105, a3, a4_221, mstatus, sp_186->t0010, sp_186->t0014, sp_186->t0038, out a4_228, out a5_229, out s3_148), a4_228, a5_229, mstatus, sp_186->t0158, sp_186->t0198, out s0_463, out s1_464, out a0_238, out a2_465, out a3, out a4, out a5_197, out a6_466, out s4_467, out t3_468);
			if (a0_238 == 0x00)
				__syscall();
			goto l230319B2;
		}
	}
	Eq_2 a3_72;
	Eq_2 a4_73;
	Eq_2 a5_74;
	word32 s1_78;
	word32 s8_448;
	word32 s4_447;
	word32 s2_446;
	word32 a0_445;
	*prvSwitchTimerLists(s0_217, a3, a4_221, mstatus, sp_186->t0044, sp_186->t00B8, sp_186->t00C8, sp_186->t00F8, sp_186->t0138, out s1_78, out a0_445, out a3_72, out a4_73, out a5_74, out s2_446, out s3_148, out s4_447, out s5_162, out s6_163, out s8_448) = s1_78;
	word32 s4_454;
	word32 t3_455;
	word32 a6_453;
	word32 a0_451;
	word32 a2_452;
	word32 s0_449;
	word32 s1_450;
	xTaskResumeAll(a3_72, a4_73, a5_74, mstatus, sp_186->t0158, sp_186->t0198, out s0_449, out s1_450, out a0_451, out a2_452, out a3, out a4, out a5_197, out a6_453, out s4_454, out t3_455);
	goto l230319B2;
}

// 23031B24: Register (ptr32 Eq_111400) pvTimerGetTimerID(Register (ptr32 Eq_111400) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a3Out)
// Called from:
//      ip_obtaining_timeout
//      __reload_tsen
//      disconnect_retry
struct Eq_111400 * pvTimerGetTimerID(struct Eq_111400 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a3Out)
{
	if (a0 == null)
	{
		word32 a5_37;
		vAssertCalled(a4, mstatus, out a5_37);
	}
	word32 a5_38;
	vTaskEnterCritical(a4, mstatus, out a5_38);
	struct Eq_111400 * s0_20 = a0->ptr001C;
	word32 a4_39;
	word32 a5_40;
	a3Out = vTaskExitCritical(a3, mstatus, out a4_39, out a5_40);
	return s0_20;
}

// 23031B48: void vPortSetupTimerInterrupt()
// Called from:
//      xPortStartScheduler
void vPortSetupTimerInterrupt()
{
	do
	{
		Eq_2 a2_7 = *(union Eq_2 *) 0x0200BFF8;
		Eq_2 a4_8 = *(union Eq_2 *) 0x0200BFFC;
	} while (a4_8 != *((union Eq_2 *) 0x0200BFFC));
	*((word32) a2_7 + 0x02000710) = 0x02004000;
	(word32) a4_8 + (word32) ((word32) a2_7 + 0x02000710 < a2_7) + 4 = 0x02004000;
	*((word32) a2_7 + 0x04FFFE20) = 0x4200DE88;
	(word32) a4_8 + (word32) ((word32) a2_7 + 0x04FFFE20 < a2_7) + 4 = 0x4200DE88;
}

// 23031B92: void xPortStartScheduler(Register ptr32 gp, Register Eq_2 tp, Register Eq_2 t0, Register Eq_2 a4, Register ptr32 fcsr, Register ptr32 mstatus, Register ptr32 mie, Register ptr32 mtvec)
// Called from:
//      vTaskStartScheduler
void xPortStartScheduler(ptr32 gp, Eq_2 tp, Eq_2 t0, Eq_2 a4, ptr32 fcsr, ptr32 mstatus, ptr32 mie, ptr32 mtvec)
{
	__csrrs(mtvec, t0);
	if (false)
	{
		word32 a5_64;
		vAssertCalled(a4, mstatus, out a5_64);
	}
	vPortSetupTimerInterrupt();
	__csrrs(mie, tp);
	*(byte *) 0x02800407 = 0x01;
	fn23031F00(gp, fcsr, mstatus, mtvec);
}

// 23031F00: void fn23031F00(Register ptr32 gp, Register ptr32 fcsr, Register ptr32 mstatus, Register ptr32 mtvec)
// Called from:
//      xPortStartScheduler
void fn23031F00(ptr32 gp, ptr32 fcsr, ptr32 mstatus, ptr32 mtvec)
{
	__csrrw(mtvec, 0x23031C02);
	Eq_2 sp_9 = g_t4200DE38;
	0x00 = (uint16) *((word32) sp_9 + 64);
	0x00 = (uint16) *((word32) sp_9 + 32);
	0x00 = (int32) *((word32) sp_9 + 992);
	Eq_159574 sp_40 = *((word32) sp_9 + 472);
	__csrrw(fcsr, gp);
	__csrrw(mstatus, 0x00);
	0x00 = (word32) *((word32) sp_40 + 508);
}

// 23032000: Register int32 fn23032000(Register (ptr32 Eq_154879) a0, Register (ptr32 ptr32) a1, Register Eq_2 a2, Register ptr32 mstatus, Register out ptr32 a0Out)
// Called from:
//      prvInitialiseNewTask.isra.2
int32 fn23032000(struct Eq_154879 * a0, ptr32 * a1, Eq_2 a2, ptr32 mstatus, ptr32 & a0Out)
{
	a0->dwFFFFFFFC = (__csrrs(mstatus, 0x00) | 0x1880) & -9;
	*a2 = &a0->dwFFFFFF8C + 6;
	a0->dwFFFFFF8C = 0x00;
	word32 * a0_15 = &a0->dwFFFFFF8C + -1;
	int32 t0_17;
	for (t0_17 = 0x0022; t0_17 != 0x00; t0_17 += ~0x00)
	{
		a0_15 += -1;
		*a0_15 = 0x00;
	}
	ptr32 a0_20 = a0_15;
	*a1 = a0_20;
	a0Out = a0_20;
	return t0_17;
}

// 23032138: Register Eq_2 prvInsertBlockIntoFreeList(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a5, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      pvPortMalloc
//      vPortFree
Eq_2 prvInsertBlockIntoFreeList(Eq_2 a0, Eq_2 a2, Eq_2 a3, Eq_2 a5, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	do
		;
	while (a5 < a0);
	Eq_2 a4_12 = *((word32) a2 + 4);
	Eq_2 a0_15 = *((word32) a3 + 4);
	word32 a1_16 = a4_12 + a2;
	if (a0_15 == a1_16)
	{
		a3 += a2;
		*((word32) a3 + 4) = a4_12;
		a0_15 = a4_12;
	}
	if (a5 != a0_15 + a3 || a5 == g_t4200DE90)
		*a5 = a0_15;
	else
	{
		union Eq_2 * a5_27 = *((word32) a5 + 4);
		a3 += a5_27;
		*((word32) a3 + 4) = a0_15;
		a4_12 = *a5_27;
		a5 = *a5_27;
		*a5 = a0_15;
	}
	if (a0_15 != a4_12)
		*a0_15 = a4_12;
	a3Out = a3;
	a4Out = a4_12;
	a5Out = a5;
	return a1_16;
}

// 2303218A: Register Eq_2 pvPortMalloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out (ptr32 byte) s1Out, Register out (ptr32 byte) a0Out, Register out (ptr32 Eq_1792) a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_2) a5Out, Register out ptr32 a6Out, Register out Eq_1798 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_1800) s4Out, Register out ptr32 s8Out)
// Called from:
//      http_test_cmd
//      aws_main_entry
//      Encrypt_keyData
//      cm_AllocResources
//      cm_InitConnection
//      bl_send_msg
//      bl_msg_zalloc.constprop.3
//      bl_ipc_init
//      ota_tcp_cmd
//      ps_cmd
//      ls_cmd
//      dns_server_init
//      psm_test_cmd
//      xQueueGenericCreate
//      xStreamBufferGenericCreate
//      xTaskCreate
//      vTaskList
//      bl_dma_irq_register
//      bl_dma_init
//      bl_dma_test
//      dev_uart_init
//      cmd_looprt_test_schedule_evt2
//      loopset_led_trigger
//      tcpc_entry
//      tcpclient_cmd
//      TCP_Server
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      ipus_test_cmd
//      ipu_test_cmd
//      ipc_test_cmd
//      ips_test_cmd
//      ping_api_init
//      utils_memp_init
//      inode_reserve
//      aos_loop_init
//      aos_poll_read_fd
//      aos_post_delayed_action
//      aos_task_new
//      aos_malloc
//      bl_mtd_open
//      mycalloc
Eq_2 pvPortMalloc(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg8C, Eq_2 dwArg0138, Eq_2 dwArg0178, byte & s1Out, byte & a0Out, struct Eq_1792 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, union Eq_1798 & s2Out, ptr32 & s3Out, struct Eq_1800 & s4Out, ptr32 & s8Out)
{
	if (a5 == 0x00)
	{
		word32 a5_286;
		vAssertCalled(a4, mstatus, out a5_286);
	}
	Eq_2 a3_122;
	word32 a5_287;
	Eq_2 a4_126 = vTaskSuspendAll(a4, out a5_287);
	int32 s2_30 = g_dw4200DE94;
	Eq_2 a5_124 = s2_30 & a0;
	if (a5_124 == 0x00 && a0 != 0x00)
	{
		a5_124 = (word32) a0 + 8;
		a4_126 = (word32) a0 + 8 & 7;
		if (a4_126 != 0x00)
			a5_124 = ((word32) a0 + 8 & ~0x07) + 0x08;
		if (a5_124 != 0x00)
		{
			Eq_2 s4_41 = g_t4200DE98;
			if (s4_41 >= a5_124)
			{
				a3.u0 = 0x4200DEA0;
				while (true)
				{
					Eq_2 s0_47 = *((word32) a4_126 + 4);
					if (a4_126 >= a5_124)
						break;
					s0_47 = *a4_126;
					if (a4_126 == 0x00)
						break;
					a3 = s0_47;
				}
				Eq_2 s1_54 = *a4_126;
				if (a4_126 != s0_47)
				{
					*a4_126 = *s1_54;
					Eq_2 s0_60 = *((word32) a4_126 + 4);
					Eq_2 a3_63 = a4_126 - a5_124;
					if (a3_63 > 0x10)
					{
						word32 a0_64 = s0_60 + a5_124;
						*((word32) a3_63 + 4) = a0_64;
						*((word32) a5_124 + 4) = s0_60;
						word32 a5_297;
						a1 = prvInsertBlockIntoFreeList(a0_64, 0x10, a3_63, a5_124, out a3_63, out a4_126, out a5_297);
						s0_60 = *((word32) a4_126 + 4);
					}
					Eq_2 a5_77 = *a3_63;
					Eq_2 s4_82 = s4_41 - a4_126;
					g_t4200DE98 = s4_82;
					if (s4_82 < a3_63)
						*a5_77 = s4_82;
					Eq_1798 s2_94 = s2_30 | a4_126;
					*((word32) s0_60 + 4) = s2_94;
					*s0_60 = 0x00;
					union Eq_2 * a5_115;
					byte * s1_118;
					ptr32 a4_123;
					word32 s0_298;
					word32 a6_301;
					word32 s4_302;
					word32 t3_303;
					word32 a0_299;
					word32 a2_300;
					xTaskResumeAll(a3_63, a4_126, a5_77, mstatus, dwArg0138, dwArg0178, out s0_298, out s1_118, out a0_299, out a2_300, out a3_122, out a4_123, out a5_115, out a6_301, out s4_302, out t3_303);
					if (s1_118 != null)
					{
						s1Out = s1_118;
						a0Out = s1_118;
						a1Out = a1;
						a2Out = dwArg48;
						a3Out = a3_122;
						a4Out = a4_123;
						a5Out = a5_115;
						a6Out = dwArg28;
						s2Out = s2_94;
						s3Out = 0x4200DE98;
						s4Out = dwArg04;
						s8Out = s4;
						return s1;
					}
l230321BE:
					vApplicationMallocFailedHook(ra, a3_122, dwLoc08, dwArg40, dwArg44, s1, dwArg8C);
				}
			}
		}
	}
	word32 a0_290;
	word32 a5_293;
	word32 t3_296;
	word32 a6_294;
	word32 s4_295;
	word32 a2_291;
	word32 a4_292;
	word32 s0_288;
	word32 s1_289;
	xTaskResumeAll(a3, a4_126, a5_124, mstatus, dwArg0138, dwArg0178, out s0_288, out s1_289, out a0_290, out a2_291, out a3_122, out a4_292, out a5_293, out a6_294, out s4_295, out t3_296);
	goto l230321BE;
}

