pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23032272: Register word32 vPortFree(Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_1945) s0Out, Register out (ptr32 Eq_1946) s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_1792) a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 a6Out, Register out ptr32 s4Out, Register out ptr32 t3Out)
// Called from:
//      http_test_cmd
//      GeneratePWKMsg3
//      GenerateApEapolMsg
//      Encrypt_keyData
//      cm_InitConnection
//      cm_DeleteConnection
//      bl_send_msg
//      cmd_complete.isra.1
//      cmd_mgr_llind
//      cmd_mgr_queue
//      ota_tcp_cmd
//      ps_cmd
//      ls_cmd
//      psm_test_cmd
//      vEventGroupDelete
//      vStreamBufferDelete
//      prvDeleteTCB
//      xTaskCreate
//      vTaskList
//      bl_dma_test
//      sys_sem_free
//      tcpc_entry
//      TCP_Server
//      iperf_server_udp
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      ping_free
//      ping_api_init
//      utils_memp_deinit
//      aos_register_driver
//      aos_register_fs
//      aos_poll_read_fd
//      aos_loop_run
//      dfl_entry
//      aos_task_new
//      aos_free
//      bl_mtd_close
//      bloop_run
//      mbedtls_pk_load_file
//      mbedtls_pk_parse_keyfile
//      rsa_free_wrap
//      eckey_free_wrap
//      mbedtls_rsa_pkcs1_sign
//      ssl_flight_free
//      mbedtls_ssl_handshake_free
//      ssl_handshake_wrapup_free_hs_transform
//      mbedtls_ssl_session_free
//      mbedtls_ssl_handshake_wrapup
//      mbedtls_ssl_setup
//      mbedtls_ssl_free
//      mbedtls_ssl_config_free
//      mbedtls_ssl_write_record
//      mbedtls_ssl_prepare_handshake_record
//      mbedtls_ssl_parse_certificate
//      mbedtls_x509_crt_free
//      mbedtls_x509_crt_parse_der
//      mbedtls_x509_crt_parse_file
//      mbedtls_mpi_free
//      mbedtls_mpi_grow
//      mbedtls_mpi_shrink
//      gcm_ctx_free
//      aes_ctx_free
//      ecp_normalize_jac_many
//      mbedtls_ecp_group_free
//      mbedtls_ecp_mul
//      mbedtls_md_free
//      md5_ctx_free
//      sha1_ctx_free
//      sha224_ctx_free
//      mbedtls_pem_read_buffer
//      mbedtls_pem_free
word32 vPortFree(Eq_2 a0, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, struct Eq_1945 & s0Out, struct Eq_1946 & s1Out, union Eq_2 & a0Out, struct Eq_1792 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & a6Out, ptr32 & s4Out, ptr32 & t3Out)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a0Out = a0;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		a6Out = a6;
		s4Out = s4;
		t3Out = t3;
		return tp;
	}
	struct Eq_1946 * s1_124;
	Eq_2 a3_111;
	Eq_2 a4_114 = *((word32) a0 - 4);
	if ((a4_114 & a5) != 0x00)
	{
		a3_111 = *((word32) a0 - 8);
		if (a3_111 == 0x00)
			goto l230322CE;
	}
	else
	{
		word32 a5_147;
		a2 = vAssertCalled(a4_114, mstatus, out a5_147);
		a5 = *((word32) a0 - 8);
		if (a5 == 0x00)
		{
			a4_114 = *((word32) a0 - 4);
			s1_124 = (struct Eq_1946 *) *a5;
			a3_111 = a4_114 & a5;
			if (a3_111 == 0x00)
				goto l230322AE;
			goto l230322CE;
		}
	}
	a2 = vAssertCalled(a4_114, mstatus, out a5);
	a4_114 = *((word32) a0 - 4);
	s1_124 = (struct Eq_1946 *) *a5;
	a3_111 = a4_114 & a5;
	if (a3_111 == 0x00)
		goto l230322AE;
	a3_111 = *((word32) a0 - 8);
	if (a3_111 != 0x00)
	{
l230322AE:
		s0Out = s0;
		s1Out = s1_124;
		a0Out = a0;
		a1Out = a1;
		a2Out = dwArg10;
		a3Out = a3_111;
		a4Out = a4_114;
		a5Out = a5;
		a6Out = a6;
		s4Out = s4;
		t3Out = t3;
		return dwArg14;
	}
l230322CE:
	*((word32) a0 + 0x0FFC) = ~a5 & a4_114;
	word32 a5_148;
	vTaskSuspendAll(a4_114, out a5_148);
	Eq_2 a5_45 = *a3_111;
	Mem49[Mem40[a0 + -4:int32] + a3_111:word32] = a5_45;
	Eq_2 a3_55;
	Eq_2 a4_56;
	Eq_2 a5_57;
	struct Eq_1792 * a1_53 = prvInsertBlockIntoFreeList((word32) a0 - 8, a2, a3_111, a5_45, out a3_55, out a4_56, out a5_57);
	Eq_2 a0_65;
	Eq_2 a2_66;
	Eq_2 a5_67;
	ptr32 a6_68;
	struct Eq_1945 * s0_69;
	struct Eq_1946 * s1_70;
	ptr32 s4_71;
	ptr32 t3_72;
	Eq_2 a3_74;
	Eq_2 a4_75;
	word32 tp_73 = xTaskResumeAll(a3_55, a4_56, a5_57, mstatus, dwArg0158, dwArg0198, out s0_69, out s1_70, out a0_65, out a2_66, out a3_74, out a4_75, out a5_67, out a6_68, out s4_71, out t3_72);
	s0Out = s0_69;
	s1Out = s1_70;
	a0Out = a0_65;
	a1Out = a1_53;
	a2Out = a2_66;
	a3Out = a3_74;
	a4Out = a4_75;
	a5Out = a5_67;
	a6Out = a6_68;
	s4Out = s4_71;
	t3Out = t3_72;
	return tp_73;
}

// 23032304: void xPortGetFreeHeapSize()
// Called from:
//      vApplicationMallocFailedHook
//      version_cmd
void xPortGetFreeHeapSize()
{
}

// 2303230E: void vPortDefineHeapRegions(Register int32 s0, Register (ptr32 Eq_5041) a0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0128)
// Called from:
//      bfl_main
void vPortDefineHeapRegions(int32 s0, struct Eq_5041 * a0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0128)
{
	Eq_2 a5_159 = g_t4200DE90;
	struct Eq_5041 * s3_106 = a0;
	if (a5_159 != 0x00)
	{
		word32 a5_293;
		vAssertCalled(a4, mstatus, out a5_293);
		s0 = a0->dw0004;
		if (s0 != 0x00)
		{
			a5_159 = g_t4200DE90;
l23032340:
			word32 s4_119 = 0x00;
			word32 s5_112 = 0x00;
			do
			{
				Eq_2 s1_44 = s3_106->dw0000;
				Eq_2 a4_45 = s1_44 & 7;
				Eq_2 s2_46 = s1_44;
				if ((s1_44 & 7) != 0x00)
				{
					a4_45 = (word32) s1_44 + 7 & ~0x07;
					s0 = (word32) s1_44 + s0 - a4_45;
					s1_44 = a4_45;
					s2_46 = a4_45;
				}
				if (s4_119 == 0x00)
				{
					g_t4200DEA0 = s1_44;
					g_dw4200DEA4 = 0x00;
					a4 = a5_159;
				}
				else
				{
					if (a5_159 == 0x00)
					{
						word32 a5_294;
						vAssertCalled(a4_45, mstatus, out a5_294);
						a5_159 = g_t4200DE90;
					}
					a4 = a5_159;
					if (a5_159 >= s2_46)
					{
						word32 a5_295;
						vAssertCalled(a5_159, mstatus, out a5_295);
						a4 = g_t4200DE90;
					}
				}
				a5_159 = (word32) s2_46 + s0 + ~0x07 & -8;
				*((word32) a5_159 + 4) = null;
				a5_159->u0 = 0x00;
				g_t4200DE90 = a5_159;
				struct Eq_160016 * s2_101 = a5_159 - s2_46;
				*((word32) s1_44 + 4) = s2_101;
				*a5_159 = s1_44;
				if (a4 != 0x00)
				{
					*s1_44 = a4;
					s2_101 = (struct Eq_160016 *) *((word32) s1_44 + 4);
				}
				++s3_106;
				s0 = s3_106->dw0004;
				s5_112 = s2_101 + s5_112 / 8;
				++s4_119;
			} while (s0 != 0x00);
			g_dw4200EE9C = s5_112;
			g_dw4200EE98 = s5_112;
			if (s5_112 != 0x00)
			{
l230323BA:
				g_dw4200EE94 = 0x80000000;
				0x00 = (uint16) dwArg0128;
				return;
			}
l2303240C:
			word32 a5_296;
			vAssertCalled(a4, mstatus, out a5_296);
			goto l230323BA;
		}
	}
	else if (s0 != 0x00)
		goto l23032340;
	g_dw4200EE9C = 0x00;
	g_dw4200EE98 = 0x00;
	goto l2303240C;
}

// 23032412: void uart_generic_notify_handler(Register word32 ra, Register ui32 a0)
// Called from:
//      UART0_IRQHandler
//      UART1_IRQHandler
void uart_generic_notify_handler(word32 ra, ui32 a0)
{
	struct Eq_160085 * s3_106 = *((char *) g_a2308DE74 + a0 * 0x04);
	int32 s1_110 = s3_106->dw0020;
	int32 s0_109 = s3_106->dw0024;
	ui32 s2_107 = a0;
	if ((s1_110 & 1) != 0x00 && (s0_109 & 1) == 0x00)
		s3_106->dw0028 = 0x01;
	if ((s1_110 & 2) != 0x00 && (s0_109 & 2) == 0x00)
	{
		s3_106->dw0028 = 0x02;
		if (true)
			g_t42012888.ptr0050();
	}
	if ((s1_110 & 4) != 0x00 && ((s0_109 & 4) == 0x00 && true))
		g_t42012888.ptr0050();
	if ((s1_110 & 8) != 0x00 && ((s0_109 & 8) == 0x00 && true))
		g_t42012888.ptr0050();
	if ((s1_110 & 16) != 0x00 && (s0_109 & 16) == 0x00)
	{
		s3_106->dw0028 = 0x10;
		struct Eq_160157 * s2_126 = s2_107 << 4;
		<anonymous> * a5_128 = s2_126->ptr420128D8;
		if (a5_128 != null)
			a5_128();
	}
	if ((s1_110 & 32) != 0x00 && (s0_109 & 32) == 0x00)
		s3_106->dw0028 = 32;
}

// 23032504: void UART0_IRQHandler(Register word32 ra)
void UART0_IRQHandler(word32 ra)
{
	uart_generic_notify_handler(ra, 0x00);
}

