pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303284A: void bl_uart_int_tx_notify_register(Register uint32 a0, Register (ptr32 Eq_160614) a1, Register Eq_2 a2)
// Called from:
//      hal_uart_notify_register
void bl_uart_int_tx_notify_register(uint32 a0, struct Eq_160614 * a1, Eq_2 a2)
{
	if (a0 > 0x01)
		return;
	ui32 a0_9 = (a0 << 0x04) + 0x420128D8;
	a1->dw0008 = a0_9;
	*((word32) a2 + 0x0C) = a0_9;
}

// 2303286A: Register Eq_2 bl_chip_info(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 misa)
// Called from:
//      bfl_main
Eq_2 bl_chip_info(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 misa)
{
	byte * a0_35;
	__csrrs(misa, ra);
	Eq_2 s0_11 = a0;
	if (s1 >> 0x1E != 0x02)
	{
		if (s1 >> 0x1E != 0x03)
		{
			Eq_2 a1_58;
			s0_11 = (word32) a0 + 4;
			if (s1 >> 0x1E == 0x01)
				a1_58.u0 = 587737852;
			else
				a1_58.u0 = 587737876;
			word32 a1_173;
			word32 a2_174;
			word32 a3_175;
			word32 a4_176;
			word32 a5_177;
			word32 a6_178;
			word32 a7_179;
			memcpy(a0, a1_58, 0x04, out a1_173, out a2_174, out a3_175, out a4_176, out a5_177, out a6_178, out a7_179);
			a0_35 = (word32) a0 + 4;
		}
		else
		{
			word32 a4_169;
			word32 a7_172;
			word32 a6_171;
			word32 a2_167;
			word32 a3_168;
			word32 a5_170;
			word32 a1_166;
			memcpy(a0, 587737868, 0x05, out a1_166, out a2_167, out a3_168, out a4_169, out a5_170, out a6_171, out a7_172);
			a0_35 = (word32) a0 + 5;
		}
	}
	else
	{
		word32 a7_165;
		word32 a5_163;
		word32 a6_164;
		word32 a3_161;
		word32 a4_162;
		word32 a1_159;
		word32 a2_160;
		memcpy(a0, 587737860, 0x04, out a1_159, out a2_160, out a3_161, out a4_162, out a5_163, out a6_164, out a7_165);
		a0_35 = (word32) a0 + 4;
	}
	*a0_35 = 0x2D;
	byte * a4_82 = a0_35 + 1;
	word32 a5_83;
	for (a5_83 = 0x00; a5_83 != 0x1A; ++a5_83)
	{
		if ((0x01 << a5_83 & s1) != 0x00)
		{
			*a4_82 = (byte) (a5_83 + 65);
			++a4_82;
		}
	}
	*a4_82 = 0x00;
	return s0_11;
}

// 23032914: Register ptr32 bl_chip_banner(Register ptr32 a0)
// Called from:
//      bfl_main
ptr32 bl_chip_banner(ptr32 a0)
{
	g_ptr23082840 = a0;
	return 0x00;
}

// 23032922: Register word32 bl_chip_memory_ram(Register (ptr32 Eq_139121) a1, Register ptr32 a2, Register Eq_2 a3, Register (ptr32 Eq_2) a4, Stack word32 dwArg38)
// Called from:
//      version_cmd
word32 bl_chip_memory_ram(struct Eq_139121 * a1, ptr32 a2, Eq_2 a3, union Eq_2 * a4, word32 dwArg38)
{
	Eq_2 a0_5 = *a4;
	if (a4 <= (union Eq_2 *) 0x02)
		return ~0x00;
	*(union Eq_2 *) 0x03 = a0_5;
	g_ptr23000000 = a1;
	*(ptr32 *) 0x00400000 = a2;
	word32 a4_84;
	word32 a5_85;
	strcpy(a3, &g_t23082B1C, out a4_84, out a5_85);
	a1->dw0004 = 0x4200C000;
	*(ptr32 *) 221188 = a2;
	word32 a4_86;
	word32 a5_87;
	strcpy((word32) a3 + 6, &g_t23082B24, out a4_86, out a5_87);
	a1->dw0008 = 0x42042000;
	*(ptr32 *) 0x0A000008 = a2;
	word32 a4_88;
	word32 a5_89;
	strcpy((word32) a3 + 0x0C, &g_t23072C3C, out a4_88, out a5_89);
	0x00 = dwArg38;
	return 0x00;
}

// 230329BC: void _cb_cmd(Register Eq_2 ra, Register (ptr32 Eq_160810) a0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void _cb_cmd(Eq_2 ra, struct Eq_160810 * a0, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5D <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_122;
			xTaskGetTickCountFromISR(out a5_122);
		}
		else
		{
			word32 a5_121;
			xTaskGetTickCount(out a5_121);
		}
		word32 s1_123;
		word32 a0_124;
		word32 a1_125;
		word32 a2_126;
		word32 a3_127;
		word32 a4_128;
		word32 a5_129;
		word32 s2_130;
		word32 s3_131;
		word32 s4_132;
		word32 s5_133;
		word32 s6_134;
		word32 s7_135;
		word32 s8_136;
		word32 s9_137;
		word32 s10_138;
		word32 s11_139;
		bl_printk(ra, &g_t23082B34, 0x23082B28, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_123, out a0_124, out a1_125, out a2_126, out a3_127, out a4_128, out a5_129, out s2_130, out s3_131, out s4_132, out s5_133, out s6_134, out s7_135, out s8_136, out s9_137, out s10_138, out s11_139);
	}
	a0->dw0008 = 0x00;
}

// 23032A22: void bl_cks_test(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8)
// Called from:
//      cmd_cks
void bl_cks_test(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgB8, Eq_2 dwArgF8)
{
	Eq_2 ra_1017;
	Eq_2 s0_1257 = 0x42020000;
	ra_1017 = ra;
	if ((word32) g_b4201FC5C <= 0x02)
	{
		ra_1017 = ra;
		if ((word32) g_b4201FC5D <= 0x02)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_2413;
				xTaskGetTickCountFromISR(out a5_2413);
			}
			else
			{
				word32 a5_2412;
				xTaskGetTickCount(out a5_2412);
			}
			word32 s8_2429;
			word32 s9_2430;
			word32 s3_2424;
			word32 a3_2420;
			word32 a4_2421;
			word32 a0_2417;
			word32 a1_2418;
			word32 a2_2419;
			word32 s1_2416;
			word32 a5_2422;
			word32 s5_2426;
			word32 s4_2425;
			word32 s2_2423;
			word32 s11_2432;
			word32 s10_2431;
			word32 s6_2427;
			word32 s7_2428;
			ra_1017 = bl_printk(ra, &g_t23082B78, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2416, out a0_2417, out a1_2418, out a2_2419, out a3_2420, out a4_2421, out a5_2422, out s2_2423, out s3_2424, out s4_2425, out s5_2426, out s6_2427, out s7_2428, out s8_2429, out s9_2430, out s10_2431, out s11_2432);
		}
	}
	*(byte *) 0x4000A700 = 0x01;
	ptr32 s1_127 = 587738528;
	byte * a5_70 = g_a23082DA0;
	do
	{
		*(byte *) 0x4000A704 = (byte) (word32) *a5_70;
		++a5_70;
	} while (a5_70 != (byte *) 3707228788);
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5D <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2415;
			xTaskGetTickCountFromISR(out a5_2415);
		}
		else
		{
			word32 a5_2414;
			xTaskGetTickCount(out a5_2414);
		}
		word32 s6_2443;
		word32 s7_2444;
		word32 a1_2434;
		word32 a2_2435;
		word32 a3_2436;
		word32 a4_2437;
		word32 s2_2439;
		word32 a5_2438;
		word32 a0_2433;
		word32 s9_2446;
		word32 s8_2445;
		word32 s4_2441;
		word32 s5_2442;
		word32 s10_2447;
		word32 s11_2448;
		word32 s3_2440;
		ra_1017 = bl_printk(ra_1017, &g_t23082BA0, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_127, out a0_2433, out a1_2434, out a2_2435, out a3_2436, out a4_2437, out a5_2438, out s2_2439, out s3_2440, out s4_2441, out s5_2442, out s6_2443, out s7_2444, out s8_2445, out s9_2446, out s10_2447, out s11_2448);
	}
	*(byte *) 0x4000A700 = 0x01;
	*(byte *) 0x4000A700 = 0x02;
	int32 a5_146;
	for (a5_146 = 0x00; a5_146 != 0x14; ++a5_146)
		*(byte *) 0x4000A704 = (byte) (word32) (s1_127 + a5_146);
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5D <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2475;
			xTaskGetTickCountFromISR(out a5_2475);
		}
		else
		{
			word32 a5_2474;
			xTaskGetTickCount(out a5_2474);
		}
		word32 s2_207;
		struct Eq_161274 * s3_208;
		struct Eq_161267 * s4_209;
		word32 a0_2496;
		word32 a1_2497;
		word32 s8_2505;
		word32 s9_2506;
		word32 s11_2508;
		word32 s10_2507;
		word32 a3_2499;
		word32 s7_2504;
		word32 s6_2503;
		word32 a4_2500;
		word32 s5_2502;
		word32 a5_2501;
		word32 a2_2498;
		word32 s1_2495;
		ra_1017 = bl_printk(ra_1017, &g_t23082BE4, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2495, out a0_2496, out a1_2497, out a2_2498, out a3_2499, out a4_2500, out a5_2501, out s2_207, out s3_208, out s4_209, out s5_2502, out s6_2503, out s7_2504, out s8_2505, out s9_2506, out s10_2507, out s11_2508);
		if ((word32) g_b4201FC5C <= 0x02 && (word32) s4_209->bFFFFFC5D <= 0x02)
		{
			if (s3_208->dwFFFFFE84 != 0x00)
			{
				word32 a5_2477;
				xTaskGetTickCountFromISR(out a5_2477);
			}
			else
			{
				word32 a5_2476;
				xTaskGetTickCount(out a5_2476);
			}
			word32 s6_2489;
			word32 s8_2491;
			word32 s5_2488;
			word32 a1_2480;
			word32 a4_2483;
			word32 a0_2479;
			word32 a3_2482;
			word32 a2_2481;
			word32 s9_2492;
			word32 s7_2490;
			word32 s10_2493;
			word32 s11_2494;
			word32 s2_2485;
			word32 s4_2487;
			word32 s3_2486;
			word32 a5_2484;
			word32 s1_2478;
			ra_1017 = bl_printk(ra_1017, &g_t23082C28, s2_207 + -0x04D8, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2478, out a0_2479, out a1_2480, out a2_2481, out a3_2482, out a4_2483, out a5_2484, out s2_2485, out s3_2486, out s4_2487, out s5_2488, out s6_2489, out s7_2490, out s8_2491, out s9_2492, out s10_2493, out s11_2494);
		}
	}
	*(byte *) 0x4000A700 = 0x01;
	*(byte *) 0x4000A704 = 0x1F;
	*(byte *) 0x4000A704 = 0x3F;
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5D <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2450;
			xTaskGetTickCountFromISR(out a5_2450);
		}
		else
		{
			word32 a5_2449;
			xTaskGetTickCount(out a5_2449);
		}
		word32 s2_2458;
		word32 a0_2452;
		word32 s1_2451;
		word32 s3_2459;
		word32 s8_2464;
		word32 s10_2466;
		word32 a2_2454;
		word32 a3_2455;
		word32 a4_2456;
		word32 a5_2457;
		word32 a1_2453;
		word32 s9_2465;
		word32 s5_2461;
		word32 s6_2462;
		word32 s7_2463;
		word32 s4_2460;
		word32 s11_2467;
		ra_1017 = bl_printk(ra_1017, &g_t23082C50, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2451, out a0_2452, out a1_2453, out a2_2454, out a3_2455, out a4_2456, out a5_2457, out s2_2458, out s3_2459, out s4_2460, out s5_2461, out s6_2462, out s7_2463, out s8_2464, out s9_2465, out s10_2466, out s11_2467);
	}
	struct Eq_274 * a0_418;
	Eq_2 a3_416;
	*(byte *) 0x4000A700 = 0x01;
	*(byte *) 0x4000A700 = 0x02;
	*(byte *) 0x4000A704 = 0x1F;
	*(byte *) 0x4000A704 = 0x3F;
	word32 s1_336 = (word32) (word16) (word32) *(uint16 *) 0x4000A708;
	if ((word32) g_b4201FC5C <= 0x02)
	{
		if ((word32) g_b4201FC5D > 0x02)
		{
			if (s1_336 == 0x0C0000E0)
				goto l23032C88;
			goto l23033338;
		}
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2469;
			xTaskGetTickCountFromISR(out a5_2469);
		}
		else
		{
			word32 a5_2468;
			xTaskGetTickCount(out a5_2468);
		}
		word32 s1_378;
		word32 s2_381;
		word32 s4_383;
		struct Eq_161187 * s5_384;
		struct Eq_161194 * s6_385;
		word32 s11_2753;
		word32 s7_2749;
		word32 s9_2751;
		word32 s10_2752;
		word32 s8_2750;
		word32 a4_2746;
		word32 s3_2748;
		word32 a5_2747;
		word32 a1_2743;
		word32 a2_2744;
		word32 a3_2745;
		word32 a0_2742;
		ra_1017 = bl_printk(ra_1017, &g_t23082C84, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_378, out a0_2742, out a1_2743, out a2_2744, out a3_2745, out a4_2746, out a5_2747, out s2_381, out s3_2748, out s4_383, out s5_384, out s6_385, out s7_2749, out s8_2750, out s9_2751, out s10_2752, out s11_2753);
		if (s1_378 == s2_381)
		{
			if ((word32) g_b4201FC5C > 0x02 || (word32) s5_384->bFFFFFC5D > 0x02)
				goto l23032C88;
			if (s6_385->dwFFFFFE84 != 0x00)
			{
				word32 a5_2471;
				xTaskGetTickCountFromISR(out a5_2471);
			}
			else
			{
				word32 a5_2470;
				xTaskGetTickCount(out a5_2470);
			}
			a3_416 = s4_383 + -0x04D8;
			a0_418 = (struct Eq_274 *) &g_t23082CB8;
			goto l23032C7A;
		}
	}
	else if (s1_336 == 0x0C0000E0)
		goto l23032C88;
	if ((word32) g_b4201FC5C > 0x02)
		goto l23032C88;
l23033338:
	if ((word32) g_b4201FC5D > 0x02)
		goto l23032C88;
	if (g_t4200DE84 != 0x00)
	{
		word32 a5_2724;
		xTaskGetTickCountFromISR(out a5_2724);
	}
	else
	{
		word32 a5_2723;
		xTaskGetTickCount(out a5_2723);
	}
	a3_416.u0 = 0x23082B28;
	a0_418 = (struct Eq_274 *) &g_t23082CF0;
l23032C7A:
	word32 s11_2741;
	word32 a3_2729;
	word32 a4_2730;
	word32 s2_2732;
	word32 s5_2735;
	word32 s6_2736;
	word32 s8_2738;
	word32 s9_2739;
	word32 s10_2740;
	word32 s7_2737;
	word32 s4_2734;
	word32 s3_2733;
	word32 a5_2731;
	word32 a2_2728;
	word32 s1_2725;
	word32 a0_2726;
	word32 a1_2727;
	ra_1017 = bl_printk(ra_1017, a0_418, a3_416, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2725, out a0_2726, out a1_2727, out a2_2728, out a3_2729, out a4_2730, out a5_2731, out s2_2732, out s3_2733, out s4_2734, out s5_2735, out s6_2736, out s7_2737, out s8_2738, out s9_2739, out s10_2740, out s11_2741);
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5D <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2705;
			xTaskGetTickCountFromISR(out a5_2705);
		}
		else
		{
			word32 a5_2704;
			xTaskGetTickCount(out a5_2704);
		}
		word32 s1_2706;
		word32 a1_2708;
		word32 s3_2714;
		word32 s5_2716;
		word32 s6_2717;
		word32 s7_2718;
		word32 s9_2720;
		word32 s10_2721;
		word32 s11_2722;
		word32 s8_2719;
		word32 s4_2715;
		word32 a3_2710;
		word32 a4_2711;
		word32 s2_2713;
		word32 a5_2712;
		word32 a2_2709;
		word32 a0_2707;
		ra_1017 = bl_printk(ra_1017, &g_t23082D28, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2706, out a0_2707, out a1_2708, out a2_2709, out a3_2710, out a4_2711, out a5_2712, out s2_2713, out s3_2714, out s4_2715, out s5_2716, out s6_2717, out s7_2718, out s8_2719, out s9_2720, out s10_2721, out s11_2722);
	}
l23032C88:
	*(byte *) 0x4000A700 = 0x01;
	int32 a4_527;
	for (a4_527 = 1000; a4_527 != 0x00; a4_527 += ~0x00)
	{
		*(byte *) 0x4000A704 = 0x1F;
		*(byte *) 0x4000A704 = 0x3F;
	}
	uint32 s1_539 = 16159000;
	while (true)
	{
		uint32 a4_542 = s1_539 >> 0x10;
		if (a4_542 == 0x00)
			break;
		s1_539 = (s1_539 & 0x0FFFFFFF) + a4_542;
	}
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5D <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2473;
			xTaskGetTickCountFromISR(out a5_2473);
		}
		else
		{
			word32 a5_2472;
			xTaskGetTickCount(out a5_2472);
		}
		word32 a4_2514;
		word32 s2_2516;
		word32 s3_2517;
		word32 s4_2518;
		word32 s6_2520;
		word32 s7_2521;
		word32 s8_2522;
		word32 s10_2524;
		word32 s11_2525;
		word32 s9_2523;
		word32 s5_2519;
		word32 a5_2515;
		word32 a0_2510;
		word32 a1_2511;
		word32 a3_2513;
		word32 a2_2512;
		word32 s1_2509;
		ra_1017 = bl_printk(ra_1017, &g_t23082C50, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2509, out a0_2510, out a1_2511, out a2_2512, out a3_2513, out a4_2514, out a5_2515, out s2_2516, out s3_2517, out s4_2518, out s5_2519, out s6_2520, out s7_2521, out s8_2522, out s9_2523, out s10_2524, out s11_2525);
	}
	*(byte *) 0x4000A700 = 0x01;
	*(byte *) 0x4000A700 = 0x02;
	int32 a4_617;
	for (a4_617 = 1000; a4_617 != 0x00; a4_617 += ~0x00)
	{
		*(byte *) 0x4000A704 = 0x1F;
		*(byte *) 0x4000A704 = 0x3F;
	}
	uint32 a4_629 = 16159000;
	while (true)
	{
		uint32 a3_632 = a4_629 >> 0x10;
		if (a3_632 == 0x00)
			break;
		a4_629 = (a4_629 & 0x0FFFFFFF) + a3_632;
	}
	word32 s2_646 = (word32) (word16) (word32) *(uint16 *) 0x4000A708;
	ui32 s1_647 = ~a4_629;
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5D <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2527;
			xTaskGetTickCountFromISR(out a5_2527);
		}
		else
		{
			word32 a5_2526;
			xTaskGetTickCount(out a5_2526);
		}
		word32 s10_2541;
		word32 s11_2542;
		word32 a1_2529;
		word32 a2_2530;
		word32 a4_2532;
		word32 s4_2535;
		word32 s5_2536;
		word32 s7_2538;
		word32 s8_2539;
		word32 s9_2540;
		word32 s6_2537;
		word32 s3_2534;
		word32 a5_2533;
		word32 a3_2531;
		word32 a0_2528;
		ra_1017 = bl_printk(ra_1017, &g_t23082C84, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_647, out a0_2528, out a1_2529, out a2_2530, out a3_2531, out a4_2532, out a5_2533, out s2_646, out s3_2534, out s4_2535, out s5_2536, out s6_2537, out s7_2538, out s8_2539, out s9_2540, out s10_2541, out s11_2542);
	}
	struct Eq_274 * a0_728;
	up32 a3_707 = (word32) g_b4201FC5C;
	if (s2_646 == (word32) ((word16) s1_647))
	{
		if (a3_707 > 0x02 || (word32) g_b4201FC5D > 0x02)
			goto l23032DE4;
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2594;
			xTaskGetTickCountFromISR(out a5_2594);
		}
		else
		{
			word32 a5_2593;
			xTaskGetTickCount(out a5_2593);
		}
		a0_728 = (struct Eq_274 *) &g_t23082CB8;
	}
	else
	{
		if (a3_707 > 0x04 || (word32) g_b4201FC5D > 0x04)
			goto l230330F4;
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2686;
			xTaskGetTickCountFromISR(out a5_2686);
		}
		else
		{
			word32 a5_2685;
			xTaskGetTickCount(out a5_2685);
		}
		a0_728 = (struct Eq_274 *) &g_t23082CF0;
	}
	word32 a4_2692;
	word32 s4_2696;
	word32 s5_2697;
	word32 s7_2699;
	word32 s11_2703;
	word32 s8_2700;
	word32 s10_2702;
	word32 s9_2701;
	word32 s6_2698;
	word32 a5_2693;
	word32 s3_2695;
	word32 s2_2694;
	word32 s1_2687;
	word32 a1_2689;
	word32 a2_2690;
	word32 a3_2691;
	word32 a0_2688;
	ra_1017 = bl_printk(ra_1017, a0_728, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2687, out a0_2688, out a1_2689, out a2_2690, out a3_2691, out a4_2692, out a5_2693, out s2_2694, out s3_2695, out s4_2696, out s5_2697, out s6_2698, out s7_2699, out s8_2700, out s9_2701, out s10_2702, out s11_2703);
l230330F4:
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5D <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2596;
			xTaskGetTickCountFromISR(out a5_2596);
		}
		else
		{
			word32 a5_2595;
			xTaskGetTickCount(out a5_2595);
		}
		word32 a0_2598;
		word32 a1_2599;
		word32 s5_2607;
		word32 s6_2608;
		word32 s8_2610;
		word32 s10_2612;
		word32 s11_2613;
		word32 s9_2611;
		word32 s7_2609;
		word32 a3_2601;
		word32 s4_2606;
		word32 s3_2605;
		word32 a4_2602;
		word32 s2_2604;
		word32 a5_2603;
		word32 a2_2600;
		word32 s1_2597;
		ra_1017 = bl_printk(ra_1017, &g_t23082D50, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2597, out a0_2598, out a1_2599, out a2_2600, out a3_2601, out a4_2602, out a5_2603, out s2_2604, out s3_2605, out s4_2606, out s5_2607, out s6_2608, out s7_2609, out s8_2610, out s9_2611, out s10_2612, out s11_2613);
	}
l23032DE4:
	*(byte *) 0x4000A700 = 0x01;
	*(byte *) 0x4000A704 = 0x1F;
	*(byte *) 0x4000A704 = 0x3F;
	*(byte *) 0x4000A704 = 161;
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5D <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2544;
			xTaskGetTickCountFromISR(out a5_2544);
		}
		else
		{
			word32 a5_2543;
			xTaskGetTickCount(out a5_2543);
		}
		word32 s1_2545;
		word32 a3_2549;
		word32 a4_2550;
		word32 s8_2558;
		word32 s9_2559;
		word32 s11_2561;
		word32 s10_2560;
		word32 s2_2552;
		word32 s7_2557;
		word32 s6_2556;
		word32 s3_2553;
		word32 s5_2555;
		word32 s4_2554;
		word32 a5_2551;
		word32 a0_2546;
		word32 a2_2548;
		word32 a1_2547;
		ra_1017 = bl_printk(ra_1017, &g_t23082C50, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2545, out a0_2546, out a1_2547, out a2_2548, out a3_2549, out a4_2550, out a5_2551, out s2_2552, out s3_2553, out s4_2554, out s5_2555, out s6_2556, out s7_2557, out s8_2558, out s9_2559, out s10_2560, out s11_2561);
	}
	struct Eq_274 * a0_1016;
	Eq_2 a3_1013;
	*(byte *) 0x4000A700 = 0x01;
	*(byte *) 0x4000A700 = 0x02;
	*(byte *) 0x4000A704 = 0x1F;
	*(byte *) 0x4000A704 = 0x3F;
	*(byte *) 0x4000A704 = 161;
	word32 s2_915 = (word32) (word16) (word32) *(uint16 *) 0x4000A708;
	if ((word32) g_b4201FC5C <= 0x02)
	{
		if ((word32) g_b4201FC5D > 0x02)
		{
			if (s2_915 == 0x0C00003F)
				goto l23032EF6;
			goto l230332E4;
		}
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2563;
			xTaskGetTickCountFromISR(out a5_2563);
		}
		else
		{
			word32 a5_2562;
			xTaskGetTickCount(out a5_2562);
		}
		word32 s1_957;
		word32 s2_960;
		word32 s4_962;
		struct Eq_161731 * s5_963;
		struct Eq_161738 * s6_964;
		word32 a0_2673;
		word32 s7_2680;
		word32 s8_2681;
		word32 s10_2683;
		word32 s11_2684;
		word32 s9_2682;
		word32 a2_2675;
		word32 s3_2679;
		word32 a3_2676;
		word32 a4_2677;
		word32 a5_2678;
		word32 a1_2674;
		ra_1017 = bl_printk(ra_1017, &g_t23082C84, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_957, out a0_2673, out a1_2674, out a2_2675, out a3_2676, out a4_2677, out a5_2678, out s2_960, out s3_2679, out s4_962, out s5_963, out s6_964, out s7_2680, out s8_2681, out s9_2682, out s10_2683, out s11_2684);
		if (s2_960 == s1_957)
		{
			if ((word32) g_b4201FC5C > 0x02 || (word32) s5_963->bFFFFFC5D > 0x02)
				goto l23032EF6;
			if (s6_964->dwFFFFFE84 != 0x00)
			{
				word32 a5_2634;
				xTaskGetTickCountFromISR(out a5_2634);
			}
			else
			{
				word32 a5_2633;
				xTaskGetTickCount(out a5_2633);
			}
			a3_1013 = s4_962 + -0x04D8;
			a0_1016 = (struct Eq_274 *) &g_t23082CB8;
			goto l230331C2;
		}
	}
	else if (s2_915 == 0x0C00003F)
		goto l23032EF6;
	if ((word32) g_b4201FC5C > 0x04)
		goto l230331C6;
l230332E4:
	if ((word32) g_b4201FC5D > 0x04)
		goto l230331C6;
	if (g_t4200DE84 != 0x00)
	{
		word32 a5_2655;
		xTaskGetTickCountFromISR(out a5_2655);
	}
	else
	{
		word32 a5_2654;
		xTaskGetTickCount(out a5_2654);
	}
	a3_1013.u0 = 0x23082B28;
	a0_1016 = (struct Eq_274 *) &g_t23082CF0;
l230331C2:
	word32 s1_2656;
	word32 a0_2657;
	word32 a2_2659;
	word32 s4_2665;
	word32 s6_2667;
	word32 s7_2668;
	word32 s8_2669;
	word32 s10_2671;
	word32 s11_2672;
	word32 s9_2670;
	word32 s5_2666;
	word32 a4_2661;
	word32 a5_2662;
	word32 s3_2664;
	word32 s2_2663;
	word32 a3_2660;
	word32 a1_2658;
	ra_1017 = bl_printk(ra_1017, a0_1016, a3_1013, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2656, out a0_2657, out a1_2658, out a2_2659, out a3_2660, out a4_2661, out a5_2662, out s2_2663, out s3_2664, out s4_2665, out s5_2666, out s6_2667, out s7_2668, out s8_2669, out s9_2670, out s10_2671, out s11_2672);
l230331C6:
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5D <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2636;
			xTaskGetTickCountFromISR(out a5_2636);
		}
		else
		{
			word32 a5_2635;
			xTaskGetTickCount(out a5_2635);
		}
		word32 a5_2643;
		word32 s5_2647;
		word32 s6_2648;
		word32 s8_2650;
		word32 s9_2651;
		word32 s11_2653;
		word32 s10_2652;
		word32 s7_2649;
		word32 s2_2644;
		word32 s4_2646;
		word32 s3_2645;
		word32 s1_2637;
		word32 a0_2638;
		word32 a2_2640;
		word32 a3_2641;
		word32 a4_2642;
		word32 a1_2639;
		ra_1017 = bl_printk(ra_1017, &g_t23082D78, 0x23082B28, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, dwArg18, ra, out s1_2637, out a0_2638, out a1_2639, out a2_2640, out a3_2641, out a4_2642, out a5_2643, out s2_2644, out s3_2645, out s4_2646, out s5_2647, out s6_2648, out s7_2649, out s8_2650, out s9_2651, out s10_2652, out s11_2653);
	}
l23032EF6:
	Eq_2 a3_1147;
	word32 a2_2567;
	word32 a4_2569;
	word32 a5_2570;
	word32 t1_2571;
	word32 a1_2573;
	word32 a2_2574;
	word32 a3_2575;
	word32 a4_2582;
	word32 a5_2583;
	word32 a5_2577;
	word32 a2_2581;
	word32 t1_2578;
	word32 a0_2579;
	word32 a1_2580;
	word32 a4_2576;
	word32 a0_2572;
	word32 a3_2568;
	word32 t1_2564;
	word32 a1_2566;
	word32 a0_2565;
	Eq_2 ra_1150 = memset(memset(memset(ra_1017, fp + -116, 0x00, 0x1C, out t1_2564, out a0_2565, out a1_2566, out a2_2567, out a3_2568, out a4_2569, out a5_2570), fp + -88, 0x00, 0x1C, out t1_2571, out a0_2572, out a1_2573, out a2_2574, out a3_2575, out a4_2576, out a5_2577), fp + -60, 0x00, 0x1C, out t1_2578, out a0_2579, out a1_2580, out a2_2581, out a3_1147, out a4_2582, out a5_2583);
	Eq_2 a5_1238;
	Eq_2 a4_1237;
	Eq_2 a3_1236;
	Eq_2 a2_1235;
	bl_dma_copy(fp + -116, a3_1147, 0x000403E8, mstatus, out a2_1235, out a3_1236, out a4_1237, out a5_1238);
	while (a5_1238 != 0x00)
	{
		word32 a0_2585;
		word32 s3_2588;
		word32 s4_2589;
		word32 s8_2590;
		word32 s2_2587;
		word32 a1_2586;
		word32 s1_2584;
