pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
		s0_1257 = vTaskDelay(0x02, a2_1235, a3_1236, a4_1237, a5_1238, mstatus, 0x00, 0x4000A708, dwArgB8, dwArgF8, out s1_2584, out a0_2585, out a1_2586, out a2_1235, out a3_1236, out a4_1237, out a5_1238, out s2_2587, out s3_2588, out s4_2589, out s8_2590);
	}
	struct Eq_274 * a0_1292;
	up32 a4_1271 = (word32) *((word32) s0_1257 - 932);
	if (false)
	{
		if (a4_1271 > 0x02 || (word32) g_b4201FC5D > 0x02)
			return;
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2592;
			xTaskGetTickCountFromISR(out a5_2592);
		}
		else
		{
			word32 a5_2591;
			xTaskGetTickCount(out a5_2591);
		}
		a0_1292 = (struct Eq_274 *) &g_t23082CB8;
	}
	else
	{
		if (a4_1271 > 0x04 || (word32) g_b4201FC5D > 0x04)
			return;
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_2615;
			xTaskGetTickCountFromISR(out a5_2615);
		}
		else
		{
			word32 a5_2614;
			xTaskGetTickCount(out a5_2614);
		}
		a0_1292 = (struct Eq_274 *) &g_t23082CF0;
	}
	word32 s1_2616;
	word32 a1_2618;
	word32 a2_2619;
	word32 a3_2620;
	word32 a5_2622;
	word32 s2_2623;
	word32 s3_2624;
	word32 s10_2631;
	word32 s11_2632;
	word32 s5_2626;
	word32 s9_2630;
	word32 s6_2627;
	word32 s7_2628;
	word32 s8_2629;
	word32 s4_2625;
	word32 a4_2621;
	word32 a0_2617;
	bl_printk(ra_1150, a0_1292, 0x23082B28, 0x230329BC, 0x4000A708, dwLoc10, dwLoc0C, fp + -0x0080, ra, out s1_2616, out a0_2617, out a1_2618, out a2_2619, out a3_2620, out a4_2621, out a5_2622, out s2_2623, out s3_2624, out s4_2625, out s5_2626, out s6_2627, out s7_2628, out s8_2629, out s9_2630, out s10_2631, out s11_2632);
}

// 23033378: void _cb_cmd(Register Eq_2 ra, Register (ptr32 Eq_162295) a0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void _cb_cmd(Eq_2 ra, struct Eq_162295 * a0, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5E <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_122;
			xTaskGetTickCountFromISR(out a5_122);
		}
		else
		{
			word32 a5_121;
			xTaskGetTickCount(out a5_121);
		}
		word32 s1_123;
		word32 a0_124;
		word32 a1_125;
		word32 a2_126;
		word32 a3_127;
		word32 a4_128;
		word32 a5_129;
		word32 s2_130;
		word32 s3_131;
		word32 s4_132;
		word32 s5_133;
		word32 s6_134;
		word32 s7_135;
		word32 s8_136;
		word32 s9_137;
		word32 s10_138;
		word32 s11_139;
		bl_printk(ra, &g_t23082B34, 587738572, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_123, out a0_124, out a1_125, out a2_126, out a3_127, out a4_128, out a5_129, out s2_130, out s3_131, out s4_132, out s5_133, out s6_134, out s7_135, out s8_136, out s9_137, out s10_138, out s11_139);
	}
	a0->dw0008 = 0x00;
}

Eq_2 g_t2303337C = 
	{
		0xC703
	};
// 230333DE: void bl_dma_int_process(Register Eq_2 ra, Register (ptr32 Eq_162367) s0, Register Eq_162368 s1, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack word32 dwArg0198)
void bl_dma_int_process(Eq_2 ra, struct Eq_162367 * s0, Eq_162368 s1, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, word32 dwArg0198)
{
	int32 s7_110 = s0->ptr0004->dw000C;
	bl_irq_ctx_get(ra, 0x1F, fp + -52, dwLoc38, dwArg10, dwArg14, dwArg38, ra);
	Eq_162368 s2_103 = 0x00;
	ui32 s8_106 = 0x01;
	struct Eq_162400 * s3_104 = (struct Eq_162400 *) 0x4000C000;
	Eq_162368 s6_105 = 0x04;
	do
	{
		ui32 a5_36 = s8_106 << s2_103;
		ui32 s5_109 = a5_36 & s0;
		ui32 s4_102 = a5_36 & s7_110;
		if (s5_109 == 0x00)
		{
			if (s4_102 != 0x00)
				goto l23033424;
		}
		else
		{
			s0 = s3_104->ptr0008 | a5_36;
			s3_104->ptr0008 = s0;
			if (s4_102 != 0x00)
			{
l23033424:
				s0 = s3_104->ptr0010 | a5_36;
				s3_104->ptr0010 = s0;
			}
			Eq_162368 a5_123 = *((word32) s1 + 4);
			while (true)
			{
				a5_123 = *a5_123;
				if (s1 == a5_123)
					break;
				struct Eq_162427 * s1_101 = *((word32) a5_123 + 8);
				if (a5_123 == s2_103)
				{
					word32 s1_71 = *((word32) a5_123 + 0x0C);
					if (a5_123 != 0x00 && s5_109 != 0x00)
						a5_123();
					s1_101 = (struct Eq_162427 *) *((word32) a5_123 + 16);
					if (a5_123 != 0x00 && s4_102 != 0x00)
						a5_123();
				}
				s1 = s1_101->t0004;
			}
		}
		s2_103 = (word32) s2_103 + 1;
	} while (s2_103 != s6_105);
	0x00 = dwArg0198;
}

// 23033488: Register ui32 bl_dma_int_clear(Register word32 a0, Register ui32 a4, Register out Eq_162467 a5Out)
// Called from:
//      bl_dma_IRQHandler
ui32 bl_dma_int_clear(word32 a0, ui32 a4, union Eq_162467 & a5Out)
{
	ui32 a0_8 = 0x01 << a0;
	struct Eq_162471 * a5_12 = (struct Eq_162471 *) 0x01;
	if ((a4 & a0_8 & 0x00FF) != 0x00)
	{
		(a0_8 | 0x01)->t0008 = *(union Eq_2 *) 0x09;
		a5_12 = a0_8 | 0x01;
	}
	ui32 a5_18 = a5_12 & a0_8;
	ui32 a4_16 = a5_12->dw000C;
	if ((a5_18 & 0x00FF) != 0x00)
	{
		a4_16 = (a5_18 & 0x00FF)->dw0010;
		(a0_8 | a5_18 & 0x00FF)->dw0010 = a4_16;
	}
	a5Out = a5_18 & 0x00FF;
	return a4_16;
}

// 230334BA: void bl_dma_IRQHandler(Register Eq_2 ra, Register ui32 a4, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void bl_dma_IRQHandler(Eq_2 ra, ui32 a4, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	struct Eq_108479 * a5_14;
	Eq_2 a4_13 = bl_dma_int_clear(0x00, a4, out a5_14);
	<anonymous> * a5_17;
	if (utils_list_pop_front(a4_13, a5_14, out a5_17) != 0x00)
	{
		if (a5_17 != null)
			a5_17();
		if (g_ptr4200DEAC == null)
			return;
		DMA_LLI_Update(0x00);
		DMA_Channel_Enable();
	}
	else
	{
		if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5E <= 0x02)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_119;
				xTaskGetTickCountFromISR(out a5_119);
			}
			else
			{
				word32 a5_118;
				xTaskGetTickCount(out a5_118);
			}
			word32 a1_122;
			word32 s1_120;
			word32 a0_121;
			word32 a2_123;
			word32 a3_124;
			word32 a4_125;
			word32 a5_126;
			word32 s2_127;
			word32 s3_128;
			word32 s4_129;
			word32 s5_130;
			word32 s6_131;
			word32 s7_132;
			word32 s8_133;
			word32 s9_134;
			word32 s10_135;
			word32 s11_136;
			bl_printk(ra, &g_t23082DD8, 587738572, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_120, out a0_121, out a1_122, out a2_123, out a3_124, out a4_125, out a5_126, out s2_127, out s3_128, out s4_129, out s5_130, out s6_131, out s7_132, out s8_133, out s9_134, out s10_135, out s11_136);
		}
		while (true)
			;
	}
}

// 23033550: Register Eq_2 bl_dma_copy(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bl_cks_test
//      bl_dma_test
Eq_2 bl_dma_copy(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 a5_60;
	vTaskEnterCritical(a4, mstatus, out a5_60);
	struct Eq_109009 * a5_17 = g_ptr4200DEAC;
	if (a5_17 == null)
	{
		DMA_LLI_Update(0x00);
		a5_17 = DMA_Channel_Enable();
	}
	Eq_2 a0_33 = utils_list_push_back(a0, a5_17);
	ptr32 a5_43;
	ptr32 a4_45;
	Eq_2 a3_44 = vTaskExitCritical(a3, mstatus, out a4_45, out a5_43);
	a2Out = dwArg10;
	a3Out = a3_44;
	a4Out = a4_45;
	a5Out = a5_43;
	return a0_33;
}

// 23033590: Register Eq_2 bl_dma_irq_register(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out ptr32 s6Out)
// Called from:
//      bl_dma_init
Eq_2 bl_dma_irq_register(Eq_2 ra, Eq_2 s0, Eq_2 a0, word32 a1, Eq_2 a3, Eq_2 s3, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, ptr32 & s6Out)
{
	if (a0 <= 0x04 && a1 != 0x00)
	{
		Eq_2 a4_27 = bl_irq_ctx_get(ra, 0x1F, fp + -36, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C);
		Eq_2 a5_31 = *((word32) s0 + 4);
		while (a5_31 != s0)
		{
			struct Eq_162727 * s0_36 = *((word32) a4_27 + 8);
			if (a0 == a4_27)
			{
				if ((word32) g_b4201FC5C <= 0x03 && (word32) g_b4201FC5E <= 0x03)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_442;
						xTaskGetTickCountFromISR(out a5_442);
					}
					else
					{
						word32 a5_441;
						xTaskGetTickCount(out a5_441);
					}
					word32 a2_446;
					word32 a4_448;
					word32 a3_447;
					word32 s2_450;
					word32 a5_449;
					word32 s1_443;
					word32 a1_445;
					word32 a0_444;
					word32 s3_451;
					word32 s4_452;
					word32 s5_453;
					word32 s7_454;
					word32 s8_455;
					word32 s9_456;
					word32 s10_457;
					word32 s11_458;
					ra = bl_printk(ra, &g_t23082E98, 587738572, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_443, out a0_444, out a1_445, out a2_446, out a3_447, out a4_448, out a5_449, out s2_450, out s3_451, out s4_452, out s5_453, out s6, out s7_454, out s8_455, out s9_456, out s10_457, out s11_458);
				}
				goto l230335F2;
			}
			s0 = s0_36->t0004;
		}
		Eq_162732 a0_92;
		word32 a1_433;
		word32 a2_434;
		word32 a3_435;
		word32 a5_436;
		word32 a6_437;
		word32 s8_438;
		struct Eq_162739 * s1_100;
		word32 s2_101;
		word32 s4_103;
		word32 s3_102;
		Eq_162732 a4_109;
		pvPortMalloc(ra, a0, 0x18, a3, a4_27, a5_31, mstatus, dwArg10, dwArg14, s3, dwArg0108, dwArg0148, out s1_100, out a0_92, out a1_433, out a2_434, out a3_435, out a4_109, out a5_436, out a6_437, out s2_101, out s3_102, out s4_103, out s8_438);
		if (a0_92 == 0x00)
		{
			a4_109 = (word32) g_b4201FC5C;
			if (a4_109 <= 0x04)
			{
				a4_109 = (word32) g_b4201FC5E;
				if (a4_109 <= 0x04)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_440;
						xTaskGetTickCountFromISR(out a5_440);
					}
					else
					{
						word32 a5_439;
						xTaskGetTickCount(out a5_439);
					}
					word32 a0_459;
					word32 a1_460;
					word32 a2_461;
					word32 a3_462;
					word32 a5_463;
					word32 s5_464;
					word32 s7_465;
					word32 s8_466;
					word32 s9_467;
					word32 s10_468;
					word32 s11_469;
					ra = bl_printk(ra, &g_t23082ECC, 587738572, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_100, out a0_459, out a1_460, out a2_461, out a3_462, out a4_109, out a5_463, out s2_101, out s3_102, out s4_103, out s5_464, out s6, out s7_465, out s8_466, out s9_467, out s10_468, out s11_469);
				}
			}
		}
		s1_100->t0008 = a0_92;
		*((word32) a0_92 + 0x0C) = s2_101;
		*((word32) a0_92 + 16) = s4_103;
		*((word32) a0_92 + 20) = s3_102;
		Eq_162732 a5_169 = *((word32) a4_109 + 4);
		*a5_169 = a0_92;
		*((word32) a4_109 + 4) = a0_92;
		*((word32) a0_92 + 4) = a5_169;
		*a0_92 = a4_109;
	}
	else if ((word32) g_b4201FC5C <= 0x04 && (word32) g_b4201FC5E <= 0x04)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_416;
			xTaskGetTickCountFromISR(out a5_416);
		}
		else
		{
			word32 a5_415;
			xTaskGetTickCount(out a5_415);
		}
		word32 s1_417;
		word32 a0_418;
		word32 a1_419;
		word32 a2_420;
		word32 a3_421;
		word32 a4_422;
		word32 a5_423;
		word32 s2_424;
		word32 s3_425;
		word32 s4_426;
		word32 s5_427;
		word32 s7_428;
		word32 s8_429;
		word32 s9_430;
		word32 s10_431;
		word32 s11_432;
		ra = bl_printk(ra, &g_t23082E70, 587738572, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_417, out a0_418, out a1_419, out a2_420, out a3_421, out a4_422, out a5_423, out s2_424, out s3_425, out s4_426, out s5_427, out s6, out s7_428, out s8_429, out s9_430, out s10_431, out s11_432);
	}
l230335F2:
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s6Out = s6;
	return ra;
}

// 230336F6: Register Eq_2 bl_dma_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Register out Eq_2 s0Out, Register out ptr32 s6Out)
// Called from:
//      bfl_main
Eq_2 bl_dma_init(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg9C, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, union Eq_2 & s0Out, ptr32 & s6Out)
{
	struct Eq_274 * a0_161;
	utils_list_init(&g_ptr4200DEAC);
	word32 a0_18;
	Eq_2 a3_21;
	Eq_2 a4_22;
	Eq_2 a5_23;
	Eq_2 s1_26;
	word32 a1_318;
	word32 a2_319;
	word32 s2_321;
	word32 a6_320;
	word32 s3_322;
	word32 s4_323;
	word32 s8_324;
	Eq_2 s0_118 = pvPortMalloc(ra, s1, 0x04, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_26, out a0_18, out a1_318, out a2_319, out a3_21, out a4_22, out a5_23, out a6_320, out s2_321, out s3_322, out s4_323, out s8_324);
	if (a0_18 == 0x00)
	{
		if ((word32) g_b4201FC5C > 0x04 || (word32) g_b4201FC5E > 0x04)
			goto l23033762;
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_334;
			xTaskGetTickCountFromISR(out a5_334);
		}
		else
		{
			word32 a5_333;
			xTaskGetTickCount(out a5_333);
		}
		a0_161 = (struct Eq_274 *) &g_t23082E10;
	}
	else
	{
		Eq_2 a0_35;
		struct Eq_162941 * a5_40;
		Eq_2 s1_43;
		Eq_2 s2_44;
		word32 a1_325;
		word32 a2_326;
		word32 a3_327;
		word32 a4_328;
		word32 a6_329;
		word32 s3_330;
		word32 s4_331;
		word32 s8_332;
		s0_118 = pvPortMalloc(ra, s1_26, 0x08, a3_21, a4_22, a5_23, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_43, out a0_35, out a1_325, out a2_326, out a3_327, out a4_328, out a5_40, out a6_329, out s2_44, out s3_330, out s4_331, out s8_332);
		*a0_35 = s0_118;
		if (a0_35 != 0x00)
		{
			*((word32) a0_35 + 4) = a0_35;
			*a0_35 = a0_35;
			DMA_Enable(a5_40);
			DMA_IntMask(0x02, 0x01);
			DMA_IntMask(0x00, 0x00);
			DMA_IntMask(0x01, 0x00);
			DMA_LLI_Init(fp + ~0x13);
			Eq_2 s0_88;
			Eq_2 s3_91;
			word32 s1_335;
			word32 a3_336;
			word32 s2_337;
			word32 s4_338;
			word32 s6_339;
			ra = bl_dma_irq_register(bl_irq_register_with_ctx(ra, s1_43, 0x1F, 0x230333DE, s0_118, s2_44, dwLoc18, dwArg08, dwArg20, dwArg24, dwArg30, dwArg34, dwArg50, dwArg54, dwArg58, ra, dwArg78, dwArg7C, dwArg9C, out s0_88, out s1_335, out a3_336, out s2_337, out s3_91, out s4_338, out s6_339), s0_88, 0x00, 0x230334BA, 0x00, s3_91, mstatus, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg20, dwArg24, dwArg28, dwArg48, dwArg4C, ra, dwArgE8, dwArg0108, dwArg0128, out s0_118, out s6);
			bl_irq_enable((struct Eq_160476 *) 0x1F);
			goto l23033762;
		}
		if ((word32) g_b4201FC5C > 0x04 || (word32) g_b4201FC5E > 0x04)
		{
l23033762:
			s0Out = s0_118;
			s6Out = s6;
			return ra;
		}
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_341;
			xTaskGetTickCountFromISR(out a5_341);
		}
		else
		{
			word32 a5_340;
			xTaskGetTickCount(out a5_340);
		}
		a0_161 = (struct Eq_274 *) &g_t23082E3C;
	}
	word32 s1_342;
	word32 a0_343;
	word32 a1_344;
	word32 a2_345;
	word32 a3_346;
	word32 a4_347;
	word32 a5_348;
	word32 s2_349;
	word32 s3_350;
	word32 s4_351;
	word32 s5_352;
	word32 s7_353;
	word32 s8_354;
	word32 s9_355;
	word32 s10_356;
	word32 s11_357;
	ra = bl_printk(ra, a0_161, 587738572, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_342, out a0_343, out a1_344, out a2_345, out a3_346, out a4_347, out a5_348, out s2_349, out s3_350, out s4_351, out s5_352, out s6, out s7_353, out s8_354, out s9_355, out s10_356, out s11_357);
	goto l23033762;
}

// 2303381E: void bl_dma_test(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack word32 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Stack Eq_2 dwArg0198)
// Called from:
//      cmd_dma
void bl_dma_test(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, word32 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0188, Eq_2 dwArg0198)
{
	Eq_2 a3_20;
	Eq_2 a4_21;
	Eq_2 a5_22;
	Eq_2 s1_25;
	word32 a0_340;
	word32 a2_342;
	word32 a1_341;
	word32 a6_343;
	word32 s2_344;
	word32 s3_345;
	word32 s4_346;
	word32 s8_347;
	pvPortMalloc(ra, s1, 0x1C, a3, a4, a5, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_25, out a0_340, out a1_341, out a2_342, out a3_20, out a4_21, out a5_22, out a6_343, out s2_344, out s3_345, out s4_346, out s8_347);
	Eq_2 a3_37;
	Eq_2 a4_38;
	Eq_2 a5_39;
	Eq_2 s1_42;
	word32 s8_355;
	word32 s4_354;
	word32 s3_353;
	word32 s2_352;
	word32 a6_351;
	word32 a1_349;
	word32 a2_350;
	word32 a0_348;
	pvPortMalloc(ra, s1_25, 0x0044, a3_20, a4_21, a5_22, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_42, out a0_348, out a1_349, out a2_350, out a3_37, out a4_38, out a5_39, out a6_351, out s2_352, out s3_353, out s4_354, out s8_355);
	Eq_2 a0_51;
	word32 s1_356;
	word32 a1_357;
	word32 a2_358;
	word32 a3_359;
	word32 a4_360;
	word32 a5_361;
	word32 a6_362;
	word32 s3_363;
	word32 s4_364;
	word32 s8_365;
	Eq_2 s2_108;
	Eq_2 s0_58 = pvPortMalloc(ra, s1_42, 0x0044, a3_37, a4_38, a5_39, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_356, out a0_51, out a1_357, out a2_358, out a3_359, out a4_360, out a5_361, out a6_362, out s2_108, out s3_363, out s4_364, out s8_365);
	Eq_2 s1_105 = a0_51;
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC5E <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_386;
			xTaskGetTickCountFromISR(out a5_386);
		}
		else
		{
			word32 a5_385;
			xTaskGetTickCount(out a5_385);
		}
		word32 a0_421;
		word32 a1_422;
		word32 a2_423;
		word32 a3_424;
		word32 a4_425;
		word32 a5_426;
		word32 s3_427;
		word32 s4_428;
		word32 s5_429;
		word32 s6_430;
		word32 s7_431;
		word32 s8_432;
		word32 s9_433;
		word32 s10_434;
		word32 s11_435;
		ra = bl_printk(ra, &g_t23082EFC, 587738572, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_105, out a0_421, out a1_422, out a2_423, out a3_424, out a4_425, out a5_426, out s2_108, out s3_427, out s4_428, out s5_429, out s6_430, out s7_431, out s8_432, out s9_433, out s10_434, out s11_435);
	}
	Eq_2 a3_152;
	Eq_2 a4_153;
	word32 t1_366;
	word32 a0_367;
	word32 a1_368;
	word32 a2_369;
	word32 a3_370;
	word32 a4_371;
	word32 a5_372;
	word32 t1_373;
	word32 a0_374;
	word32 a1_375;
	word32 a2_376;
	word32 a3_377;
	word32 a4_378;
	word32 a5_379;
	word32 t1_380;
	word32 a0_381;
	word32 a1_382;
	word32 a2_383;
	word32 a5_384;
	memset(memset(memset(ra, s0_58, 0x00, 0x1C, out t1_366, out a0_367, out a1_368, out a2_369, out a3_370, out a4_371, out a5_372), s2_108, 0x01, 0x0044, out t1_373, out a0_374, out a1_375, out a2_376, out a3_377, out a4_378, out a5_379), s1_105, 0x00FF, 0x0044, out t1_380, out a0_381, out a1_382, out a2_383, out a3_152, out a4_153, out a5_384);
	*(union Eq_2 *) 2353639465 = s0_58;
	*((word32) s0_58 + 0x0C) = s2_108;
	*((word32) s1_105 + 16) = s0_58;
	*((word32) s0_58 + 20) = 0x00;
	g_t2303337C = s0_58;
	*((word32) s0_58 + 8) = s0_58;
	Eq_2 a5_176;
	Eq_2 a4_175;
	Eq_2 a3_174;
	Eq_2 a2_173;
	Eq_2 a0_171 = bl_dma_copy(s0_58, a3_152, a4_153, mstatus, out a2_173, out a3_174, out a4_175, out a5_176);
	while (a5_176 != 0x00)
	{
		word32 s1_387;
		word32 a1_388;
		word32 s2_389;
		word32 s3_390;
		word32 s4_391;
		word32 s8_392;
		vTaskDelay(0x02, a2_173, a3_174, a4_175, a5_176, mstatus, dwArg14, dwArg18, dwArg0128, dwArg0168, out s1_387, out a0_171, out a1_388, out a2_173, out a3_174, out a4_175, out a5_176, out s2_389, out s3_390, out s4_391, out s8_392);
	}
	Eq_2 a2_205;
	Eq_2 a5_208;
	Eq_2 a0_211;
	word32 s0_393;
	word32 s1_394;
	word32 a1_395;
	word32 a3_396;
	word32 a4_397;
	word32 a6_398;
	word32 s4_399;
	word32 t3_400;
	vPortFree(a0_171, a2_173, a5_176, mstatus, dwArg0148, dwArg0188, out s0_393, out s1_394, out a0_211, out a1_395, out a2_205, out a3_396, out a4_397, out a5_208, out a6_398, out s4_399, out t3_400);
	Eq_2 a5_221;
	Eq_2 s0_227;
	word32 s1_401;
	word32 a0_402;
	word32 a1_403;
	word32 a2_404;
	word32 a3_405;
	word32 a4_406;
	word32 a6_407;
	word32 s4_408;
	word32 t3_409;
	vPortFree(a0_211, a2_205, a5_208, mstatus, dwArg0148, dwArg0188, out s0_227, out s1_401, out a0_402, out a1_403, out a2_404, out a3_405, out a4_406, out a5_221, out a6_407, out s4_408, out t3_409);
	0x00 = dwArg38;
	word32 s0_410;
	word32 s1_411;
	word32 a0_412;
	word32 a1_413;
	word32 a2_414;
	word32 a3_415;
	word32 a4_416;
	word32 a5_417;
	word32 a6_418;
	word32 s4_419;
	word32 t3_420;
	vPortFree(s0_227, dwArg10, a5_221, mstatus, dwArg0158, dwArg0198, out s0_410, out s1_411, out a0_412, out a1_413, out a2_414, out a3_415, out a4_416, out a5_417, out a6_418, out s4_419, out t3_420);
}

