pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303390A: void _irq_num_check.part.0(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      bl_irq_ctx_get
//      bl_irq_register
//      bl_irq_unregister
void _irq_num_check.part.0(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	if ((word32) g_b4201FC5C > 0x04 || (word32) g_b4201FC5F > 0x04)
	{
		while (true)
			;
	}
	else
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_73;
			xTaskGetTickCountFromISR(out a5_73);
		}
		else
		{
			word32 a5_72;
			xTaskGetTickCount(out a5_72);
		}
		word32 a2_77;
		word32 a1_76;
		word32 a0_75;
		word32 s1_74;
		word32 a3_78;
		word32 a4_79;
		word32 a5_80;
		word32 s2_81;
		word32 s3_82;
		word32 s4_83;
		word32 s5_84;
		word32 s6_85;
		word32 s7_86;
		word32 s8_87;
		word32 s9_88;
		word32 s10_89;
		word32 s11_90;
		bl_printk(ra, &g_t23082F94, 0x23082F88, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_74, out a0_75, out a1_76, out a2_77, out a3_78, out a4_79, out a5_80, out s2_81, out s3_82, out s4_83, out s5_84, out s6_85, out s7_86, out s8_87, out s9_88, out s10_89, out s11_90);
		while (true)
			;
	}
}

// 23033968: Register word32 bl_irq_enable(Register (ptr32 Eq_160476) a0)
// Called from:
//      bl_uart_int_enable
//      bl_dma_init
//      bl_sec_init
//      bl_pka_test
//      bl_sec_aes_test
//      sha256_test_case0
//      bl_wifi_enable_irq
//      cmd_timer_start
word32 bl_irq_enable(struct Eq_160476 * a0)
{
	a0->b2800400 = 0x01;
	return 0x01;
}

// 2303397A: void bl_irq_disable(Register (ptr32 Eq_160568) a0)
// Called from:
//      bl_uart_int_disable
void bl_irq_disable(struct Eq_160568 * a0)
{
	a0->b2800400 = 0x00;
}

// 2303398A: void bl_irq_exception_trigger(Register Eq_2 ra, Register up32 a0, Register word32 a1, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
// Called from:
//      cmd_exception_illegal_ins
//      cmd_exception_store
//      cmd_exception_l_illegal
//      cmd_exception_load
void bl_irq_exception_trigger(Eq_2 ra, up32 a0, word32 a1, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	if (a0 <= 0x02)
	{
		if (a0 != 0x00)
			*(word32 *) 305419896 = a1;
	}
	else if (a0 == 0x03)
	{
		(fp + ~0x13)();
l230339D8:
		word32 s4_113;
		word32 s5_114;
		word32 s2_111;
		word32 s3_112;
		word32 a5_109;
		word32 a7_110;
		word32 a3_107;
		word32 a4_108;
		word32 a1_105;
		word32 a2_106;
		word32 s1_103;
		word32 a0_104;
		word32 s6_115;
		word32 s7_116;
		word32 s8_117;
		word32 s9_118;
		word32 s10_119;
		word32 s11_120;
		word32 t4_121;
		printf(ra, &g_t23082FBC, a3, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_103, out a0_104, out a1_105, out a2_106, out a3_107, out a4_108, out a5_109, out a7_110, out s2_111, out s3_112, out s4_113, out s5_114, out s6_115, out s7_116, out s8_117, out s9_118, out s10_119, out s11_120, out t4_121);
		return;
	}
	goto l230339D8;
}

// 230339DC: Register Eq_2 bl_irq_register_with_ctx(Register Eq_2 ra, Register Eq_2 s1, Register Eq_160495 a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgBC, Register out Eq_2 s0Out, Register out (ptr32 word32) s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      bl_dma_init
//      bl_irq_register
Eq_2 bl_irq_register_with_ctx(Eq_2 ra, Eq_2 s1, Eq_160495 a0, word32 a1, Eq_2 a2, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgBC, union Eq_2 & s0Out, word32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s6Out)
{
	if (a0 > 79)
		_irq_num_check.part.0(ra, dwLoc08, dwArg40, dwArg44, s1, dwArg8C);
	word32 * s1_20 = a0 << 0x02;
	word32 a5_22 = g_a420128F8[a0 * 0x04];
	word32 s4_25 = a1;
	Eq_2 s3_27 = a2;
	ptr32 s2_28 = 0x420128F8;
	if (a5_22 != 0x00)
	{
		if (a5_22 == a1)
			goto l23033ADC;
		if ((word32) g_b4201FC5C <= 0x03)
		{
			if ((word32) g_b4201FC5F > 0x03)
			{
				if (a1 == 0x00)
				{
l23033A7C:
					if ((word32) g_b4201FC5F <= 0x04)
					{
						if (g_t4200DE84 != 0x00)
						{
							word32 a5_367;
							xTaskGetTickCountFromISR(out a5_367);
						}
						else
						{
							word32 a5_379;
							xTaskGetTickCount(out a5_379);
						}
						ptr32 a3_149;
						word32 * s1_153;
						ptr32 s2_156;
						Eq_2 s3_157;
						ptr32 s4_158;
						ptr32 s6_160;
						word32 a0_368;
						word32 a1_369;
						word32 a2_370;
						word32 a4_371;
						word32 a5_372;
						word32 s5_373;
						word32 s7_374;
						word32 s8_375;
						word32 s9_376;
						word32 s10_377;
						word32 s11_378;
						Eq_2 ra_152 = bl_printk(ra, &g_t2308304C, 0x23082F88, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_153, out a0_368, out a1_369, out a2_370, out a3_149, out a4_371, out a5_372, out s2_156, out s3_157, out s4_158, out s5_373, out s6_160, out s7_374, out s8_375, out s9_376, out s10_377, out s11_378);
						s0Out.u0 = <invalid>;
						s1Out = s1_153;
						a3Out = a3_149;
						s2Out = s2_156;
						s3Out = s3_157;
						s4Out = s4_158;
						s6Out = s6_160;
						return ra_152;
					}
					goto l23033AF2;
				}
l23033ADC:
				s1_20 += s2_28;
				*s1_20 = s4_25;
				union Eq_2 * s0_92 = ((word32) a0.u1 + 80 << 2) + s2_28;
				if (s3_27 == 0x00)
					*s0_92 = (union Eq_2 *) 0x00;
				else
					*s0_92 = (union Eq_2 *) s3_27;
l23033AF2:
				s0Out.u0 = <invalid>;
				s1Out = s1_20;
				a3Out = a3;
				s2Out = s2_28;
				s3Out = s3_27;
				s4Out = dwArg04;
				s6Out = s6;
				return ra;
			}
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_355;
				xTaskGetTickCountFromISR(out a5_355);
			}
			else
			{
				word32 a5_380;
				xTaskGetTickCount(out a5_380);
			}
			word32 a0_356;
			word32 a1_357;
			word32 a2_358;
			word32 a4_359;
			word32 a5_360;
			word32 s5_361;
			word32 s7_362;
			word32 s8_363;
			word32 s9_364;
			word32 s10_365;
			word32 s11_366;
			ra = bl_printk(ra, &g_t23083014, 0x23082F88, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_20, out a0_356, out a1_357, out a2_358, out a3, out a4_359, out a5_360, out s2_28, out s3_27, out s4_25, out s5_361, out s6, out s7_362, out s8_363, out s9_364, out s10_365, out s11_366);
		}
	}
	if (s4_25 == 0x00)
	{
		if ((word32) g_b4201FC5C > 0x04)
			goto l23033AF2;
		goto l23033A7C;
	}
	goto l23033ADC;
}

// 23033B02: Register word32 bl_irq_ctx_get(Register Eq_2 ra, Register Eq_162383 a0, Register ptr32 a1, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
// Called from:
//      bl_dma_int_process
//      bl_dma_irq_register
word32 bl_irq_ctx_get(Eq_2 ra, Eq_162383 a0, ptr32 a1, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	if (a0 <= 79)
	{
		g_a420128F8[((word32) a0.u1 + 80) * 0x04] + 0x00 = a1;
		return 0x420128F8;
	}
	else
		_irq_num_check.part.0(ra, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C);
}

// 23033B28: Register Eq_2 bl_irq_register(Register Eq_2 ra, Register Eq_2 s1, Register Eq_160495 a0, Register word32 a1, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgBC, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      bl_uart_int_enable
//      bl_sec_init
//      bl_pka_test
//      bl_sec_aes_test
//      sha256_test_case0
//      bl_wifi_enable_irq
//      cmd_timer_start
Eq_2 bl_irq_register(Eq_2 ra, Eq_2 s1, Eq_160495 a0, word32 a1, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgBC, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out)
{
	ptr32 s1_14;
	ptr32 s2_15;
	ptr32 s3_16;
	ptr32 s4_17;
	ptr32 a3_23;
	ptr32 s6_29;
	word32 s0_53;
	Eq_2 ra_25 = bl_irq_register_with_ctx(ra, s1, a0, a1, 0x00, s2, dwArg08, dwArg28, dwArg40, dwArg44, dwArg50, dwArg54, dwArg70, dwArg74, dwArg78, dwArg8C, dwArg98, dwArg9C, dwArgBC, out s0_53, out s1_14, out a3_23, out s2_15, out s3_16, out s4_17, out s6_29);
	s1Out = s1_14;
	a3Out = a3_23;
	s2Out = s2_15;
	s3Out = s3_16;
	s4Out = s4_17;
	s6Out = s6_29;
	return ra_25;
}

// 23033B2E: void bl_irq_unregister(Register Eq_2 ra, Register Eq_2 s1, Register Eq_160581 a0, Register word32 a1, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C)
// Called from:
//      bl_uart_int_disable
void bl_irq_unregister(Eq_2 ra, Eq_2 s1, Eq_160581 a0, word32 a1, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg9C)
{
	if (a0 <= 79)
	{
		struct Eq_163791 * s3_18 = a0 << 0x02;
		word32 s2_23 = a1;
		if (g_a420128F8[a0 * 0x04] != a1 && ((word32) g_b4201FC5C <= 0x03 && (word32) g_b4201FC5F <= 0x03))
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_153;
				xTaskGetTickCountFromISR(out a5_153);
			}
			else
			{
				word32 a5_152;
				xTaskGetTickCount(out a5_152);
			}
			word32 s1_154;
			word32 a0_155;
			word32 a1_156;
			word32 a2_157;
			word32 a3_158;
			word32 a4_159;
			word32 a5_160;
			word32 s4_161;
			word32 s5_162;
			word32 s6_163;
			word32 s7_164;
			word32 s8_165;
			word32 s9_166;
			word32 s10_167;
			word32 s11_168;
			bl_printk(ra, &g_t2308307C, 0x23082F88, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_154, out a0_155, out a1_156, out a2_157, out a3_158, out a4_159, out a5_160, out s2_23, out s3_18, out s4_161, out s5_162, out s6_163, out s7_164, out s8_165, out s9_166, out s10_167, out s11_168);
		}
		s3_18->dw420128F8 = s2_23;
	}
	else
		_irq_num_check.part.0(ra, dwLoc08, dwArg40, dwArg44, s1, dwArg8C);
}

// 23033BD2: void interrupt_entry(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void interrupt_entry(Eq_2 ra, word32 a0, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	Eq_163871 a2_5 = (word32) (word27) a0;
	if (a2_5 > 79 || g_a420128F8[a2_5 * 0x04] == 0x00)
	{
		word32 a4_67;
		word32 a3_66;
		word32 a2_65;
		word32 a1_64;
		word32 a0_63;
		word32 s1_62;
		word32 a5_68;
		word32 a7_69;
		word32 s2_70;
		word32 s3_71;
		word32 s4_72;
		word32 s5_73;
		word32 s6_74;
		word32 s7_75;
		word32 s8_76;
		word32 s9_77;
		word32 s10_78;
		word32 s11_79;
		word32 t4_80;
		printf(ra, &g_t23083324, (word32) a2_5.u1 - 16, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_62, out a0_63, out a1_64, out a2_65, out a3_66, out a4_67, out a5_68, out a7_69, out s2_70, out s3_71, out s4_72, out s5_73, out s6_74, out s7_75, out s8_76, out s9_77, out s10_78, out s11_79, out t4_80);
		while (true)
			;
	}
	else if (a0 == 0x00)
		;
}

