pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23033C20: void exception_entry(Register Eq_2 ra, Register Eq_2 gp, Register ui32 a0, Register (ptr32 Eq_163935) a1, Register (ptr32 word32) a3, Register (ptr32 (ptr32 Eq_163935)) a5, Register Eq_2 s2, Register word32 fs0, Register word32 fs1, Register word32 fa0, Register word32 fa1, Register word32 fa2, Register word32 fa3, Register word32 fa4, Register word32 fa5, Register ptr32 mstatus, Register ptr32 mcause, Register ptr32 mtval, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg08, Stack word32 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack word32 dwArg84, Stack Eq_2 dwArg9C)
void exception_entry(Eq_2 ra, Eq_2 gp, ui32 a0, struct Eq_163935 * a1, word32 * a3, struct Eq_163935 ** a5, Eq_2 s2, word32 fs0, word32 fs1, word32 fa0, word32 fa1, word32 fa2, word32 fa3, word32 fa4, word32 fa5, ptr32 mstatus, ptr32 mcause, ptr32 mtval, word32 dwArg00, word32 dwArg04, Eq_2 dwArg08, word32 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, word32 dwArg84, Eq_2 dwArg9C)
{
	if ((a0 & 0x03FF) != 0x04)
	{
		if ((a0 & 0x03FF) != 0x06)
		{
			word32 a0_283;
			word32 a1_284;
			word32 a2_285;
			word32 a4_286;
			word32 a5_287;
			word32 s4_288;
			word32 s8_289;
			puts(0x230830B8, out a0_283, out a1_284, out a2_285, out a4_286, out a5_287, out s4_288, out s8_289);
			Eq_2 a3_46;
			word32 a0_68;
			word32 a1_71;
			word32 a2_72;
			word32 a3_73;
			word32 s1_77;
			word32 s2_80;
			word32 s1_290;
			word32 a0_291;
			word32 a1_292;
			word32 a2_293;
			word32 a4_294;
			word32 a5_295;
			word32 a7_296;
			word32 s2_297;
			word32 s3_298;
			word32 s4_299;
			word32 s5_300;
			word32 s6_301;
			word32 s7_302;
			word32 s8_303;
			word32 s9_304;
			word32 s10_305;
			word32 s11_306;
			word32 t4_307;
			word32 a4_308;
			word32 a5_309;
			word32 a7_310;
			word32 s3_311;
			word32 s4_312;
			word32 s5_313;
			word32 s6_314;
			word32 s7_315;
			word32 s8_316;
			word32 s9_317;
			word32 s10_318;
			word32 s11_319;
			word32 t4_320;
			Eq_2 ra_76 = printf(printf(ra, &g_t230830D0, 0x06, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_290, out a0_291, out a1_292, out a2_293, out a3_46, out a4_294, out a5_295, out a7_296, out s2_297, out s3_298, out s4_299, out s5_300, out s6_301, out s7_302, out s8_303, out s9_304, out s10_305, out s11_306, out t4_307), &g_t230830F8, a3_46, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_77, out a0_68, out a1_71, out a2_72, out a3_73, out a4_308, out a5_309, out a7_310, out s2_80, out s3_311, out s4_312, out s5_313, out s6_314, out s7_315, out s8_316, out s9_317, out s10_318, out s11_319, out t4_320);
			if ((word32) (word16) a0 > 0x0F)
			{
				word32 a0_321;
				word32 a1_322;
				word32 a2_323;
				word32 a4_324;
				word32 a5_325;
				word32 s4_326;
				word32 s8_327;
				puts(0x23083300, out a0_321, out a1_322, out a2_323, out a4_324, out a5_325, out s4_326, out s8_327);
				backtrace_riscv();
				while (true)
					;
			}
			else
			{
				word32 tp_126;
				word32 s10_128;
				word32 s11_129;
				word32 s3_130;
				word32 s5_131;
				word32 s6_132;
				word32 s7_133;
				word32 s9_134;
				word32 t5_225;
				word32 t6_226;
				g_t23082F48();
			}
		}
		else
			misaligned_store_trap(gp, a3, a1, a5, fs0, fs1, fa0, fa1, fa2, fa3, fa4, fa5, mstatus, mcause, mtval);
	}
	else
		misaligned_load_trap(gp, a3, a1, a5, mstatus, mcause, mtval);
}

// 23033D60: void bl_irq_init()
// Called from:
//      bfl_main
void bl_irq_init()
{
	word32 s8_59;
	word32 a5_57;
	word32 s4_58;
	word32 a2_55;
	word32 a4_56;
	word32 a0_53;
	word32 a1_54;
	puts(0x23082FE0, out a0_53, out a1_54, out a2_55, out a4_56, out a5_57, out s4_58, out s8_59);
	byte * a4_19 = (byte *) 0x02800400;
	do
	{
		*a4_19 = 0x00;
		++a4_19;
	} while (a4_19 != (byte *) 0x02800480);
	byte * a5_25 = (byte *) 0x02800000;
	do
	{
		*a5_25 = 0x00;
		++a5_25;
	} while (a5_25 != (byte *) 0x02800080);
}

// 23033D9E: Register ui32 _trng_trigger(Register (ptr32 Eq_52584) a2, Register out Eq_164169 a4Out)
// Called from:
//      bl_sec_get_random_word
//      bl_rand_stream
//      bl_sec_init
ui32 _trng_trigger(struct Eq_52584 * a2, union Eq_164169 & a4Out)
{
	Eq_164169 a4_10 = *(union Eq_164169 *) 0x40004200;
	ui32 a3_12 = a4_10 & 1;
	if ((a4_10 & 1) == 0x00)
	{
		Eq_2 a3_9 = a2->dw0000;
		*(struct Eq_52584 **) 0x4000422C = a2;
		a3_12 = (ui32) *((word32) a3_9 + 4);
		*(ui32 *) 0x40004230 = a3_12;
		*(union Eq_164169 *) 0x40004200 = a4_10 | 0x0606;
		a4_10 |= 0x0606;
	}
	a4Out = a4_10;
	return a3_12;
}

// 23033DCA: Register Eq_2 wait_trng4feed(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_164201 s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out (ptr32 Eq_164204) a4Out, Register out (ptr32 Eq_164205) a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_164209 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      bl_rand_stream
//      bl_sec_init
Eq_2 wait_trng4feed(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_164201 & s1Out, ptr32 & a2Out, ptr32 & a3Out, struct Eq_164204 & a4Out, struct Eq_164205 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_164209 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	Eq_164169 a5_11 = *(union Eq_164169 *) 0x40004200;
	ptr32 a3_10 = 0x40004000;
	while ((a5_11 & 1) != 0x00)
		a5_11 = *(union Eq_164169 *) 0x40004200;
	*(union Eq_164169 *) 0x40004200 = a5_11 & ~0x02 | 0x0200;
	word32 s0_24 = 1107373000;
	if ((word32) g_b4201FC5C <= 0x01 && (word32) g_b4201FC60 <= 0x01)
	{
		word32 * a5_30;
		if (g_t4200DE84 != 0x00)
			xTaskGetTickCountFromISR(out a5_30);
		else
			xTaskGetTickCount(out a5_30);
		s0_24 = *a5_30;
		word32 a0_187;
		word32 a1_188;
		word32 a2_189;
		word32 a4_190;
		word32 a5_191;
		word32 s8_192;
		word32 s11_193;
		ra = bl_printk(ra, &g_t23083D30, 587742492, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1, out a0_187, out a1_188, out a2_189, out a3_10, out a4_190, out a5_191, out s2, out s3, out s4, out s5, out s6, out s7, out s8_192, out s9, out s10, out s11_193);
	}
	**(word32 **) 0x40004208 = s0_24;
	(*(struct Eq_164240 **) 0x4000420C)->dw0004 = s0_24;
	(*(struct Eq_164245 **) 0x40004210)->dw0008 = s0_24;
	(*(struct Eq_164250 **) 0x40004214)->dw000C = s0_24;
	(*(struct Eq_164255 **) 0x40004218)->dw0010 = s0_24;
	(*(struct Eq_164260 **) 0x4000421C)->dw0014 = s0_24;
	struct Eq_164204 * a4_88 = *(struct Eq_164204 **) 0x40004220;
	a4_88->dw0018 = s0_24;
	struct Eq_164205 * a5_90 = *(struct Eq_164205 **) 0x40004224;
	a5_90->dw001C = s0_24;
	s1Out = s1;
	a2Out = dwArg10;
	a3Out = a3_10;
	a4Out = a4_88;
	a5Out = a5_90;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

// 23033E8C: void sec_trng_IRQHandler(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void sec_trng_IRQHandler(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	Eq_164345 a0_9;
	int32 a1_10;
	word32 a5_216;
	word32 a2_214;
	word32 a4_215;
	aos_now_ms(a3, out a0_9, out a1_10, out a2_214, out a4_215, out a5_216);
	if (a1_10 <= 0x00 && (a1_10 != 0x00 || a0_9 <= 1999))
	{
		word32 s4_222;
		word32 s8_223;
		word32 a4_220;
		word32 a5_221;
		word32 a1_218;
		word32 a2_219;
		word32 a0_217;
		puts(587742404, out a0_217, out a1_218, out a2_219, out a4_220, out a5_221, out s4_222, out s8_223);
	}
	*(union Eq_164169 *) 0x40004200 = *(union Eq_164169 *) 0x40004200 & ~0x02 | 0x0200;
	word32 s0_34 = 1107373000;
	if ((word32) g_b4201FC5C <= 0x01 && (word32) g_b4201FC60 <= 0x01)
	{
		word32 * a5_46;
		if (g_t4200DE84 != 0x00)
			xTaskGetTickCountFromISR(out a5_46);
		else
			xTaskGetTickCount(out a5_46);
		s0_34 = *a5_46;
		word32 s4_233;
		word32 s3_232;
		word32 a5_230;
		word32 s6_235;
		word32 s5_234;
		word32 s7_236;
		word32 s8_237;
		word32 s10_239;
		word32 s9_238;
		word32 s2_231;
		word32 a3_228;
		word32 a4_229;
		word32 a1_226;
		word32 a2_227;
		word32 s1_224;
		word32 a0_225;
		word32 s11_240;
		bl_printk(ra, &g_t23083CE0, 587742492, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_224, out a0_225, out a1_226, out a2_227, out a3_228, out a4_229, out a5_230, out s2_231, out s3_232, out s4_233, out s5_234, out s6_235, out s7_236, out s8_237, out s9_238, out s10_239, out s11_240);
	}
	**(word32 **) 0x40004208 = s0_34;
	(*(struct Eq_164240 **) 0x4000420C)->dw0004 = s0_34;
	(*(struct Eq_164245 **) 0x40004210)->dw0008 = s0_34;
	(*(struct Eq_164250 **) 0x40004214)->dw000C = s0_34;
	(*(struct Eq_164255 **) 0x40004218)->dw0010 = s0_34;
	(*(struct Eq_164260 **) 0x4000421C)->dw0014 = s0_34;
	(*(struct Eq_164204 **) 0x40004220)->dw0018 = s0_34;
	(*(struct Eq_164205 **) 0x40004224)->dw001C = s0_34;
}

// 23033F58: void bl_sec_pka_IRQHandler()
void bl_sec_pka_IRQHandler()
{
	word32 a0_26;
	word32 a1_27;
	word32 a2_28;
	word32 a4_29;
	word32 a5_30;
	word32 s4_31;
	word32 s8_32;
	puts(587740480, out a0_26, out a1_27, out a2_28, out a4_29, out a5_30, out s4_31, out s8_32);
	SEC_Eng_IntMask(0x03);
}

// 23033F74: Register (ptr32 Eq_52584) bl_sec_get_random_word(Register (ptr32 ptr32) s0, Register (ptr32 Eq_52584) a2, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      bl_rand
struct Eq_52584 * bl_sec_get_random_word(ptr32 * s0, struct Eq_52584 * a2, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a4_11 = *s0;
	*(s0 & 0x07) = a4_11;
	if ((s0 & 0x07) == 0x00)
		a3 = _trng_trigger(a2, out a4_11);
	(s0 & 0x07)->dw0001 = 0x4200DEB8;
	a3Out = a3;
	a4Out = a4_11;
	a5Out = 1107373000;
	return dwArg10;
}

// 23033FB2: Register Eq_2 bl_rand_stream(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register (ptr32 Eq_52584) a2, Register Eq_2 s5, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      supplicantGenerateRand
Eq_2 bl_rand_stream(Eq_2 ra, word32 a0, Eq_2 a1, struct Eq_52584 * a2, Eq_2 s5, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg7C, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s9Out, ptr32 & s10Out)
{
	word32 ** a5_112 = g_ptr4200DEB8;
	word32 s4_100 = a0;
	Eq_2 s1_126 = a1;
	word32 * s0_159 = &g_ptr4200DEB8;
	if (a5_112 != null)
	{
		word32 a4_270;
		_trng_trigger(a2, out a4_270);
		word32 s3_274;
		word32 s9_278;
		word32 s10_279;
		word32 s7_277;
		word32 s5_275;
		word32 s6_276;
		word32 s2_273;
		word32 a3_271;
		word32 a4_272;
		ra = wait_trng4feed(ra, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, out s1_126, out a2, out a3_271, out a4_272, out a5_112, out s2_273, out s3_274, out s4_100, out s5_275, out s6_276, out s7_277, out s9_278, out s10_279);
		g_ptr4200DEB8 = null;
	}
	word32 s3_102 = 0x00;
	Eq_2 s5_57 = 32;
	word32 s6_108 = 0x42013000;
	word32 s7_128 = 0x1F;
	for (; s1_126 > 0x00; s1_126 -= s2_105)
	{
		s0_159 = *a5_112;
		if (a5_112 != null)
		{
			word32 a4_289;
			_trng_trigger(a2, out a4_289);
			word32 s2_294;
			word32 s9_295;
			word32 s10_296;
			word32 a2_290;
			word32 a5_293;
			word32 a3_291;
			word32 a4_292;
			ra = wait_trng4feed(ra, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, out s1_126, out a2_290, out a3_291, out a4_292, out a5_293, out s2_294, out s3_102, out s4_100, out s5_57, out s6_108, out s7_128, out s9_295, out s10_296);
			*s0_159 = 0x00;
		}
		Eq_2 s2_105 = s1_126;
		if (s5_57 < s1_126)
			s2_105.u0 = 32;
		word32 a3_298;
		word32 a7_301;
		word32 a4_299;
		word32 a6_300;
		word32 a1_297;
		memcpy(s4_100 + s3_102, s6_108 + -1080, s2_105, out a1_297, out a2, out a3_298, out a4_299, out a5_112, out a6_300, out a7_301);
		*s0_159 = s7_128;
		s3_102 = (word32) s2_105 + s3_102;
	}
	word32 a4_280;
	_trng_trigger(a2, out a4_280);
	ptr32 a3_137;
	ptr32 a4_138;
	ptr32 s10_145;
	ptr32 s2_147;
	ptr32 s9_154;
	word32 s5_286;
	word32 s6_287;
	word32 s7_288;
	word32 a2_282;
	word32 s4_285;
	word32 a5_283;
	word32 s3_284;
	word32 s1_281;
	Eq_2 ra_143 = wait_trng4feed(ra, dwLoc18, dwArg30, dwArg34, s5, dwArg7C, out s1_281, out a2_282, out a3_137, out a4_138, out a5_283, out s2_147, out s3_284, out s4_285, out s5_286, out s6_287, out s7_288, out s9_154, out s10_145);
	*s0_159 = 0x00;
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	a3Out = a3_137;
	a4Out = a4_138;
	s2Out = s2_147;
	s9Out = s9_154;
	s10Out = s10_145;
	return ra_143;
}

