pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303404A: Register Eq_2 bl_rand(Register Eq_2 a0, Register (ptr32 Eq_52584) a2, Register out Eq_164698 a0Out, Register out Eq_164699 a1Out, Register out (ptr32 Eq_2) a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      bl_sec_test
//      dhcp_create_msg
//      igmp_delaying_member
//      igmp_joingroup_netif
//      tcp_init
//      udp_init
//      ping_api_init
//      sntp_init
//      mbedtls_platform_entropy_poll
Eq_2 bl_rand(Eq_2 a0, struct Eq_52584 * a2, union Eq_164698 & a0Out, union Eq_164699 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	ptr32 * s0_10 = (ptr32 *) 0x13;
	do
	{
		union Eq_2 * a3_18;
		ptr32 a4_14;
		ptr32 a5_15;
		a2 = bl_sec_get_random_word(s0_10, a2, out a3_18, out a4_14, out a5_15);
		s0_10 = (ptr32 *) ((char *) s0_10 - 1);
		Eq_2 s1_21 = a0;
		if (s0_10 == null)
		{
			word32 a0_78;
			word32 a2_79;
			word32 s8_80;
			s1_21 = puts(587740444, out a0_78, out a1, out a2_79, out a4_14, out a5_15, out s4, out s8_80);
			break;
		}
	} while (a0 == 0x00);
	a0Out = s1_21 >> 0x01;
	a1Out = a1;
	a3Out = a3_18;
	a4Out = a4_14;
	a5Out = a5_15;
	s4Out = s4;
	return s1_21;
}

// 2303407C: Register Eq_2 bl_sec_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 a3Out)
// Called from:
//      bfl_main
Eq_2 bl_sec_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & a3Out)
{
	struct Eq_52584 * a2_11;
	word32 a0_22;
	word32 a3_144;
	word32 a4_145;
	xQueueCreateMutexStatic(0x01, &g_t42012B78, mstatus, dwArg04, dwArg84, dwArgF8, dwArg0108, dwArg0138, dwArg0178, out a0_22, out a2_11, out a3_144, out a4_145);
	g_dw4200EEB4 = a0_22;
	word32 a4_146;
	_trng_trigger(a2_11, out a4_146);
	struct Eq_52584 * a2_37;
	word32 s1_147;
	word32 a3_148;
	word32 a4_149;
	word32 a5_150;
	word32 s2_151;
	word32 s3_152;
	word32 s4_153;
	word32 s5_154;
	word32 s6_155;
	word32 s7_156;
	word32 s9_157;
	word32 s10_158;
	Eq_2 ra_44 = wait_trng4feed(ra, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_147, out a2_37, out a3_148, out a4_149, out a5_150, out s2_151, out s3_152, out s4_153, out s5_154, out s6_155, out s7_156, out s9_157, out s10_158);
	word32 a4_159;
	_trng_trigger(a2_37, out a4_159);
	Eq_2 s1_70;
	Eq_2 s2_73;
	ptr32 a3_90;
	word32 a2_160;
	word32 a3_161;
	word32 a4_162;
	word32 a5_163;
	word32 s3_164;
	word32 s4_165;
	word32 s5_166;
	word32 s6_167;
	word32 s7_168;
	word32 s9_169;
	word32 s10_170;
	word32 s1_171;
	word32 s2_172;
	word32 s3_173;
	word32 s4_174;
	word32 s6_175;
	Eq_2 ra_95 = bl_irq_register(wait_trng4feed(ra_44, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_70, out a2_160, out a3_161, out a4_162, out a5_163, out s2_73, out s3_164, out s4_165, out s5_166, out s6_167, out s7_168, out s9_169, out s10_170), s1_70, 0x1C, 0x23033E8C, s2_73, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC, out s1_171, out a3_90, out s2_172, out s3_173, out s4_174, out s6_175);
	bl_irq_enable((struct Eq_160476 *) 0x1C);
	a3Out = a3_90;
	return ra_95;
}

// 230340C2: Register Eq_2 bl_sec_test(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      cmd_trng
//      bfl_main
Eq_2 bl_sec_test(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 a0_13;
	struct Eq_52584 * a2_15;
	word32 s1_145;
	word32 a1_146;
	word32 a3_147;
	word32 a4_148;
	word32 a5_149;
	word32 s2_150;
	word32 s3_151;
	word32 s4_152;
	word32 s5_153;
	word32 s6_154;
	word32 s7_155;
	word32 s8_156;
	word32 s9_157;
	word32 s10_158;
	word32 s11_159;
	Eq_2 ra_19 = bl_printk(ra, &g_t23083554, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_145, out a0_13, out a1_146, out a2_15, out a3_147, out a4_148, out a5_149, out s2_150, out s3_151, out s4_152, out s5_153, out s6_154, out s7_155, out s8_156, out s9_157, out s10_158, out s11_159);
	Eq_2 a3_35;
	word32 a0_160;
	word32 a1_161;
	word32 a4_162;
	word32 a5_163;
	word32 s4_164;
	bl_rand(a0_13, a2_15, out a0_160, out a1_161, out a3_35, out a4_162, out a5_163, out s4_164);
	Eq_2 a0_49;
	struct Eq_52584 * a2_51;
	word32 s1_165;
	word32 a1_166;
	word32 a3_167;
	word32 a4_168;
	word32 a5_169;
	word32 s2_170;
	word32 s3_171;
	word32 s4_172;
	word32 s5_173;
	word32 s6_174;
	word32 s7_175;
	word32 s8_176;
	word32 s9_177;
	word32 s10_178;
	word32 s11_179;
	Eq_2 ra_55 = bl_printk(ra_19, &g_t23083594, a3_35, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_165, out a0_49, out a1_166, out a2_51, out a3_167, out a4_168, out a5_169, out s2_170, out s3_171, out s4_172, out s5_173, out s6_174, out s7_175, out s8_176, out s9_177, out s10_178, out s11_179);
	Eq_2 a3_71;
	word32 a0_180;
	word32 a1_181;
	word32 a4_182;
	word32 a5_183;
	word32 s4_184;
	bl_rand(a0_49, a2_51, out a0_180, out a1_181, out a3_71, out a4_182, out a5_183, out s4_184);
	Eq_2 a3_87;
	ptr32 a5_106;
	ptr32 a3_111;
	ptr32 a4_112;
	ptr32 s1_115;
	word32 s1_185;
	word32 a0_186;
	word32 a1_187;
	word32 a2_188;
	word32 a4_189;
	word32 a5_190;
	word32 s2_191;
	word32 s3_192;
	word32 s4_193;
	word32 s5_194;
	word32 s6_195;
	word32 s7_196;
	word32 s8_197;
	word32 s9_198;
	word32 s10_199;
	word32 s11_200;
	word32 a0_201;
	word32 a1_202;
	word32 a2_203;
	word32 s2_204;
	word32 s3_205;
	word32 s4_206;
	word32 s5_207;
	word32 s6_208;
	word32 s7_209;
	word32 s8_210;
	word32 s9_211;
	word32 s10_212;
	word32 s11_213;
	Eq_2 ra_114 = bl_printk(bl_printk(ra_55, &g_t23083594, a3_71, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_185, out a0_186, out a1_187, out a2_188, out a3_87, out a4_189, out a5_190, out s2_191, out s3_192, out s4_193, out s5_194, out s6_195, out s7_196, out s8_197, out s9_198, out s10_199, out s11_200), &g_t2307E7D4, a3_87, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_115, out a0_201, out a1_202, out a2_203, out a3_111, out a4_112, out a5_106, out s2_204, out s3_205, out s4_206, out s5_207, out s6_208, out s7_209, out s8_210, out s9_211, out s10_212, out s11_213);
	s1Out = s1_115;
	a3Out = a3_111;
	a4Out = a4_112;
	a5Out = a5_106;
	return ra_114;
}

// 2303410A: Register Eq_2 _dump_rsa_data(Register Eq_2 ra, Register int32 a1, Register Eq_2 a3, Register Eq_2 s6, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0128, Register out ptr32 s4Out, Register out Eq_165031 s6Out)
// Called from:
//      _pka_test_case_xgcd
//      _pka_test_case2
Eq_2 _dump_rsa_data(Eq_2 ra, int32 a1, Eq_2 a3, Eq_2 s6, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0128, ptr32 & s4Out, union Eq_165031 & s6Out)
{
	int32 s3_123 = a1;
	int32 s0_134;
	Eq_2 s1_105 = 0x23083000;
	word32 s5_125 = 0x23083000;
	Eq_165031 s6_126 = 0x0F;
	for (s0_134 = 0x00; s0_134 < s3_123; ++s0_134)
	{
		Eq_165031 a5_33 = s0_134 & 0x0F;
		if (a5_33 != 0x00)
		{
			if (a5_33 != s6_126)
				goto l2303415A;
			word32 s7_86;
			word32 s1_270;
			word32 a0_271;
			word32 a1_272;
			word32 a2_273;
			word32 a4_274;
			word32 a5_275;
			word32 s2_276;
			word32 s4_277;
			word32 s8_278;
			word32 s9_279;
			word32 s10_280;
			word32 s11_281;
			ra = bl_printk(ra, (word32) s1_105 + 892, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_270, out a0_271, out a1_272, out a2_273, out a3, out a4_274, out a5_275, out s2_276, out s3_123, out s4_277, out s5_125, out s6_126, out s7_86, out s8_278, out s9_279, out s10_280, out s11_281);
			word32 a0_282;
			word32 a1_283;
			word32 a2_284;
			word32 a4_285;
			word32 a5_286;
			word32 s4_287;
			word32 s8_288;
			s1_105 = puts(s7_86 + 2044, out a0_282, out a1_283, out a2_284, out a4_285, out a5_286, out s4_287, out s8_288);
		}
		else
		{
			word32 s7_265;
			word32 s6_264;
			word32 s5_263;
			word32 s4_262;
			word32 s3_261;
			word32 s2_260;
			word32 a2_257;
			word32 a4_258;
			word32 a5_259;
			word32 a0_255;
			word32 a1_256;
			word32 s8_266;
			word32 s9_267;
			word32 s10_268;
			word32 s11_269;
			ra = bl_printk(ra, s5_125 + 884, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_105, out a0_255, out a1_256, out a2_257, out a3, out a4_258, out a5_259, out s2_260, out s3_261, out s4_262, out s5_263, out s6_264, out s7_265, out s8_266, out s9_267, out s10_268, out s11_269);
l2303415A:
			word32 a0_289;
			word32 a1_290;
			word32 a2_291;
			word32 a4_292;
			word32 a5_293;
			word32 s2_294;
			word32 s4_295;
			word32 s7_296;
			word32 s8_297;
			word32 s9_298;
			word32 s10_299;
			word32 s11_300;
			ra = bl_printk(ra, (word32) s1_105 + 892, a3, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_105, out a0_289, out a1_290, out a2_291, out a3, out a4_292, out a5_293, out s2_294, out s3_123, out s4_295, out s5_125, out s6_126, out s7_296, out s8_297, out s9_298, out s10_299, out s11_300);
		}
	}
	0x00 = (uint16) dwArg0128;
	s4Out = dwArg78;
	s6Out = s6_126;
	return ra;
}

// 2303418C: Register word32 _pka_test_case_xgcd(Register Eq_2 ra, Register Eq_2 s6, Stack Eq_2 dwArg08, Register out ptr32 s6Out)
// Called from:
//      bl_pka_test
word32 _pka_test_case_xgcd(Eq_2 ra, Eq_2 s6, Eq_2 dwArg08, ptr32 & s6Out)
{
	Sec_Eng_PKA_Reset();
	Sec_Eng_PKA_BigEndian_Enable();
	Sec_Eng_PKA_Write_Data(0x08, 0x01, g_a230839C4, 64, 0x00);
	Sec_Eng_PKA_CREG(0x08, 0x02, 0x00, 0x00);
	Sec_Eng_PKA_CREG(0x08, 0x03, 0x00, 0x01);
	Sec_Eng_PKA_Write_Data(0x08, 0x00, g_a23083AC4, 64, 0x00);
	Sec_Eng_PKA_LMUL2N(0x0A, 0x01, 0x08, 0x00, 0x00FFF800, 0x00);
	Sec_Eng_PKA_LDIV(0x08, 0x00, 0x0A, 0x01, 0x08, 0x01, 0x00);
	word32 s0_117 = Sec_Eng_PKA_MREM(0x08, 0x04, 0x0A, 0x01, 0x08, 0x01, 0x00);
	Sec_Eng_PKA_CREG(0x0A, 0x01, 0x00, 0x01);
	Sec_Eng_PKA_Move_Data(0x08, 0x02, 0x08, 0x01, 0x00);
	Sec_Eng_PKA_Move_Data(0x08, 0x01, 0x08, 0x04, 0x01);
	Sec_Eng_PKA_Write_Data(0x08, 0x04, g_a2308341C, 64, 0x00);
	Sec_Eng_PKA_Write_Data(0x08, 0x05, s0_117 + -0x053C, 64, 0x00);
	Sec_Eng_PKA_Write_Data(0x08, 0x07, Sec_Eng_PKA_Write_Data(0x08, 0x06, s0_117 + -0x053C, 64, 0x00) + 0x041C, 64, 0x00);
	Sec_Eng_PKA_LMUL(0x08, 0x08, 0x08, 0x00, 0x08, 0x05, 0x00);
	Sec_Eng_PKA_LSUB(0x08, 0x08, 0x08, 0x04, 0x08, 0x08, 0x00);
	Sec_Eng_PKA_LMUL(0x08, 0x09, 0x08, 0x00, 0x08, 0x07, 0x00);
	Sec_Eng_PKA_LSUB(0x08, 0x09, 0x08, 0x06, 0x08, 0x09, 0x00);
	Sec_Eng_PKA_Move_Data(0x08, 0x04, 0x08, 0x05, 0x00);
	Sec_Eng_PKA_Move_Data(0x08, 0x05, 0x08, 0x08, 0x00);
	Sec_Eng_PKA_Move_Data(0x08, 0x06, 0x08, 0x07, 0x00);
	Sec_Eng_PKA_Move_Data(0x08, 0x07, 0x08, 0x09, 0x01);
	while (true)
	{
		Sec_Eng_PKA_LDIV(0x08, 0x00, 0x08, 0x02, 0x08, 0x01, 0x00);
		Sec_Eng_PKA_MREM(0x08, 0x03, 0x08, 0x02, 0x08, 0x01, 0x00);
		Sec_Eng_PKA_LMUL(0x08, 0x08, 0x08, 0x00, 0x08, 0x05, 0x00);
		Sec_Eng_PKA_LSUB(0x08, 0x08, 0x08, 0x04, 0x08, 0x08, 0x00);
		Sec_Eng_PKA_LMUL(0x08, 0x09, 0x08, 0x00, 0x08, 0x07, 0x00);
		word32 s0_465 = Sec_Eng_PKA_LSUB(0x08, 0x09, 0x08, 0x06, 0x08, 0x09, 0x00);
		Sec_Eng_PKA_Move_Data(0x08, 0x02, 0x08, 0x01, 0x00);
		Sec_Eng_PKA_Move_Data(0x08, 0x04, 0x08, 0x05, 0x00);
		Sec_Eng_PKA_Move_Data(0x08, 0x05, 0x08, 0x08, 0x00);
		Sec_Eng_PKA_Move_Data(0x08, 0x06, 0x08, 0x07, 0x00);
		Sec_Eng_PKA_Move_Data(0x08, 0x07, 0x08, 0x09, 0x01);
		Sec_Eng_PKA_Move_Data(0x08, 0x01, 0x08, 0x03, 0x01);
		Sec_Eng_PKA_Write_Data(0x08, 0x0A, s0_465 + -0x053C, 64, 0x00);
		Sec_Eng_PKA_LCMP(fp + -0x0111, 0x08, 0x01, 0x08, 0x0A);
	}
	word32 s4_609;
	ptr32 s6_611;
	_dump_rsa_data(ra, 0x0100, Sec_Eng_PKA_Read_Data(0x08, 0x06, fp + -272, 64), s6, dwLocE0, dwLocDC, dwLocB8, dwLoc94, dwArg08, out s4_609, out s6_611);
	s6Out = s6_611;
	return s4_609;
}

// 23034428: void _pka_test_case2(Register Eq_2 ra, Register Eq_2 s4, Register Eq_2 s6)
// Called from:
//      bl_pka_test
void _pka_test_case2(Eq_2 ra, Eq_2 s4, Eq_2 s6)
{
	Sec_Eng_PKA_Reset();
	Sec_Eng_PKA_BigEndian_Enable();
	Sec_Eng_PKA_Write_Data(0x08, 0x00, g_a230838C4, 64, 0x00);
	Sec_Eng_PKA_Write_Data(0x08, 0x01, g_a23083BC4, 64, 0x00);
	Sec_Eng_PKA_Write_Data(0x08, 0x02, g_a230837C4, 64, 0x00);
	Sec_Eng_PKA_Write_Data(0x08, 0x03, g_a2308DE7C, 0x01, 0x00);
	Sec_Eng_PKA_CREG(0x08, 0x04, 0x00, 0x00);
	Sec_Eng_PKA_CREG(0x08, 0x05, 0x00, 0x01);
	Sec_Eng_PKA_LMUL2N(0x0A, 0x02, 0x08, 0x02, 0x00FFF800, 0x00);
	Sec_Eng_PKA_MREM(0x08, 0x02, 0x0A, 0x02, 0x08, 0x00, 0x00);
	Sec_Eng_PKA_CREG(0x0A, 0x02, 0x00, 0x01);
	Sec_Eng_PKA_MEXP(0x08, 0x04, 0x08, 0x02, 0x08, 0x08, 0x00, 0x01, dwLoc0138);
	Sec_Eng_PKA_Move_Data(0x08, 0x02, 0x08, 0x04, 0x01);
	Sec_Eng_PKA_Write_Data(0x08, 0x01, g_a230836C4, 64, 0x00);
	Sec_Eng_PKA_CREG(0x08, 0x04, 0x00, 0x00);
	Sec_Eng_PKA_CREG(0x08, 0x05, 0x00, 0x01);
	Sec_Eng_PKA_LMUL(0x0A, 0x02, 0x08, 0x02, 0x08, 0x01, 0x00);
	Sec_Eng_PKA_MREM(0x08, 0x02, 0x0A, 0x02, 0x08, 0x00, 0x00);
	Sec_Eng_PKA_CREG(0x0A, 0x02, 0x00, 0x01);
	word32 s6_709;
	word32 s4_708;
	Eq_2 ra_301 = _dump_rsa_data(ra, 0x0100, Sec_Eng_PKA_Read_Data(0x08, 0x02, fp + -304, 64), s6, dwLoc0100, dwLocFC, dwLocD8, dwLocB4, s4, out s4_708, out s6_709);
	byte * s0_321 = fp + -304;
	byte * s1_322 = &g_b230835C4;
	word32 a4_323 = 0x00;
	int32 s2_324 = 0x00;
	struct Eq_165724 * s5_325 = &g_t42020000;
	struct Eq_165726 * s6_326 = &g_t42020000;
	struct Eq_165728 * s7_327 = &g_t4200E000;
	word32 s8_328 = 0x23084000;
	while (true)
	{
		up32 a5_334 = (word32) s5_325->bFFFFFC5C;
		if (s2_324 == 0x0100)
			break;
		if ((word32) *s0_321 != (word32) (*s1_322))
		{
			a4_323 = 0x01;
			if (a5_334 <= 0x02 && (word32) s6_326->bFFFFFC60 <= 0x02)
			{
				if (s7_327->dwFFFFFE84 != 0x00)
				{
					word32 a5_713;
					xTaskGetTickCountFromISR(out a5_713);
				}
				else
				{
					word32 a5_712;
					xTaskGetTickCount(out a5_712);
				}
				(word32) *s0_321 == (word32) (*s1_322);
				word32 a0_714;
				word32 a1_715;
				word32 s9_722;
				word32 a4_718;
				word32 s10_723;
				word32 a5_719;
				word32 a3_717;
				word32 a2_716;
				word32 s3_720;
				word32 s4_721;
				word32 s11_724;
				ra_301 = bl_printk(ra_301, &g_t23083388, s8_328 + -740, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_322, out a0_714, out a1_715, out a2_716, out a3_717, out a4_718, out a5_719, out s2_324, out s3_720, out s4_721, out s5_325, out s6_326, out s7_327, out s8_328, out s9_722, out s10_723, out s11_724);
				a4_323 = 0x01;
			}
		}
		++s2_324;
		++s0_321;
		++s1_322;
	}
	struct Eq_274 * a0_434;
	if (a4_323 != 0x00)
	{
		if (a5_334 > 0x04 || (word32) g_b4201FC60 > 0x04)
			return;
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_711;
			xTaskGetTickCountFromISR(out a5_711);
		}
		else
		{
			word32 a5_710;
			xTaskGetTickCount(out a5_710);
		}
		a0_434 = (struct Eq_274 *) &g_t230833B4;
	}
	else
	{
		if (a5_334 > 0x02 || (word32) g_b4201FC60 > 0x02)
			return;
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_726;
			xTaskGetTickCountFromISR(out a5_726);
		}
		else
		{
			word32 a5_725;
			xTaskGetTickCount(out a5_725);
		}
		a0_434 = (struct Eq_274 *) &g_t230833E8;
	}
	word32 s9_741;
	word32 s10_742;
	word32 s11_743;
	word32 a5_733;
	word32 s5_737;
	word32 s6_738;
	word32 s7_739;
	word32 s8_740;
	word32 s2_734;
	word32 s4_736;
	word32 s3_735;
	word32 a1_729;
	word32 a2_730;
	word32 a3_731;
	word32 a4_732;
	word32 a0_728;
	word32 s1_727;
	bl_printk(ra_301, a0_434, 587742492, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_727, out a0_728, out a1_729, out a2_730, out a3_731, out a4_732, out a5_733, out s2_734, out s3_735, out s4_736, out s5_737, out s6_738, out s7_739, out s8_740, out s9_741, out s10_742, out s11_743);
}

