pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 230346FC: void bl_pka_test(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC)
// Called from:
//      cmd_pka
void bl_pka_test(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC)
{
	Eq_2 s4_26;
	Eq_2 s6_28;
	word32 s1_111;
	word32 a3_112;
	word32 s2_113;
	word32 s3_114;
	Eq_2 ra_19 = bl_irq_register(ra, s1, 0x1B, 0x23033F58, s2, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC, out s1_111, out a3_112, out s2_113, out s3_114, out s4_26, out s6_28);
	bl_irq_enable((struct Eq_160476 *) 0x1B);
	_pka_test_case2(ra_19, s4_26, s6_28);
	Eq_2 s6_68;
	_pka_test_case2(ra_19, _pka_test_case_xgcd(ra_19, s6_28, dwLoc08, out s6_68), s6_68);
}

// 23034728: void int_timer_cb(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0188)
void int_timer_cb(Eq_2 ra, Eq_2 s0, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArg0188)
{
	TIMER_ClearIntStatus(0x00, a4);
	Eq_2 a3_16;
	Eq_2 s2_22;
	word32 a0_26;
	word32 s4_79;
	word32 s3_78;
	word32 a4_77;
	word32 s1_76;
	xTaskIncrementTick(s0, a4, mstatus, dwArg0188, out s1_76, out a0_26, out a3_16, out a4_77, out s2_22, out s3_78, out s4_79);
	if (a0_26 == 0x00)
		return;
	word32 a5_82;
	word32 a4_81;
	word32 a0_80;
	vTaskSwitchContext(ra, a3_16, s2_22, mstatus, dwArg30, dwArg34, dwArg58, dwArg7C, out a0_80, out a4_81, out a5_82);
}

// 23034748: Register Eq_2 bl_timer_now_us(Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 code) a5Out)
// Called from:
//      cmd_stack_wifi
//      event_cb_wifi_event
//      bfl_main
//      iperf_server_udp_recv_fn
//      bloop_run
Eq_2 bl_timer_now_us(ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, <anonymous> & a5Out)
{
	do
	{
		Eq_2 a1_9 = *(union Eq_2 *) 0x0200BFFC;
		Eq_2 a0_10 = *(union Eq_2 *) 0x0200BFF8;
	} while (a1_9 != *((union Eq_2 *) 0x0200BFFC));
	ptr32 a1_15;
	ptr32 a4_16;
	<anonymous> * a5_17;
	ptr32 a3_21;
	Eq_2 a0_14 = __udivdi3(a0_10, a1_9, 0x0A, 0x00, out a1_15, out a3_21, out a4_16, out a5_17);
	a1Out = a1_15;
	a2Out = dwArg10;
	a3Out = a3_21;
	a4Out = a4_16;
	a5Out = a5_17;
	return a0_14;
}

// 2303476E: void bl_timer_tick_enable(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C)
// Called from:
//      cmd_timer_start
void bl_timer_tick_enable(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C)
{
	Eq_2 a4_10;
	word32 a1_106;
	word32 a2_107;
	word32 a3_108;
	word32 a5_109;
	word32 a6_110;
	word32 a7_111;
	memcpy(fp + -40, 587742564, 0x18, out a1_106, out a2_107, out a3_108, out a4_10, out a5_109, out a6_110, out a7_111);
	TIMER_IntMask(a1, a2);
	TIMER_Disable(a0);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg56 = <invalid>;
	TIMER_Init(a0, a2, stackArg56);
	TIMER_ClearIntStatus(0x00, a4_10);
	TIMER_ClearIntStatus(0x01, a4_10);
	TIMER_ClearIntStatus(0x02, a4_10);
	TIMER_IntMask(a1, a2);
	TIMER_IntMask(a1, a2);
	TIMER_IntMask(a1, a2);
	TIMER_Enable(a0);
	bl_irq_enable((struct Eq_160476 *) 53);
	word32 s1_116;
	word32 a3_117;
	word32 s2_118;
	word32 s3_119;
	word32 s4_120;
	word32 s6_121;
	bl_irq_register(ra, s1, 53, 587417384, s2, dwLoc28, dwLoc08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg40, dwArg44, dwArg48, dwArg5C, dwArg68, dwArg6C, dwArg8C, out s1_116, out a3_117, out s2_118, out s3_119, out s4_120, out s6_121);
}

// 23034804: void cmd_gpio_get(Register Eq_2 ra, Register word32 s0, Register Eq_2 a0, Register up32 a2, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void cmd_gpio_get(Eq_2 ra, word32 s0, Eq_2 a0, up32 a2, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	byte bLoc11_173 = SLICE(s0, byte, 24);
	if (a2 != 0x02)
	{
		if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC61 <= 0x02)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_279;
				xTaskGetTickCountFromISR(out a5_279);
			}
			else
			{
				word32 a5_278;
				xTaskGetTickCount(out a5_278);
			}
			word32 s1_289;
			word32 a0_290;
			word32 a1_291;
			word32 a2_292;
			word32 a3_293;
			word32 a4_294;
			word32 a5_295;
			word32 s2_296;
			word32 s3_297;
			word32 s4_298;
			word32 s5_299;
			word32 s6_300;
			word32 s7_301;
			word32 s8_302;
			word32 s9_303;
			word32 s10_304;
			word32 s11_305;
			bl_printk(ra, &g_t23083E4C, 587742780, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_289, out a0_290, out a1_291, out a2_292, out a3_293, out a4_294, out a5_295, out s2_296, out s3_297, out s4_298, out s5_299, out s6_300, out s7_301, out s8_302, out s9_303, out s10_304, out s11_305);
		}
	}
	else
	{
		word32 a4_276;
		word32 a5_277;
		word32 a3_275;
		word32 a1_273;
		word32 a2_274;
		Eq_2 a0_19 = atoi(a0, out a1_273, out a2_274, out a3_275, out a4_276, out a5_277);
		if (a0_19 < 0x00)
		{
			word32 s8_286;
			word32 s4_285;
			word32 a5_284;
			word32 a2_282;
			word32 a4_283;
			word32 a1_281;
			word32 a0_280;
			puts(587742852, out a0_280, out a1_281, out a2_282, out a4_283, out a5_284, out s4_285, out s8_286);
		}
		else
		{
			word32 a0_37 = bl_gpio_input_get(a0_19 & 0x00FF, fp + ~0x10);
			if (a2 >= (word32) g_b4201FC5C && a2 >= (word32) g_b4201FC61)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_288;
					xTaskGetTickCountFromISR(out a5_288);
				}
				else
				{
					word32 a5_287;
					xTaskGetTickCount(out a5_287);
				}
				word32 s1_306;
				word32 a0_307;
				word32 a1_308;
				word32 a2_309;
				word32 a3_310;
				word32 a4_311;
				word32 a5_312;
				word32 s2_313;
				word32 s3_314;
				word32 s4_315;
				word32 s5_316;
				word32 s6_317;
				word32 s7_318;
				word32 s8_319;
				word32 s9_320;
				word32 s10_321;
				word32 s11_322;
				bl_printk(ra, &g_t23083E94, 587742780, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_306, out a0_307, out a1_308, out a2_309, out a3_310, out a4_311, out a5_312, out s2_313, out s3_314, out s4_315, out s5_316, out s6_317, out s7_318, out s8_319, out s9_320, out s10_321, out s11_322);
			}
		}
	}
}

// 23034914: void cmd_gpio_set(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register word32 a2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC)
void cmd_gpio_set(Eq_2 ra, Eq_2 s1, Eq_2 a0, word32 a2, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC)
{
	if (a2 != 0x03)
	{
		if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC61 <= 0x02)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_453;
				xTaskGetTickCountFromISR(out a5_453);
			}
			else
			{
				word32 a5_452;
				xTaskGetTickCount(out a5_452);
			}
			0x00 = dwArg38;
			word32 s11_470;
			word32 s10_469;
			word32 s9_468;
			word32 s7_466;
			word32 s8_467;
			word32 s4_463;
			word32 s5_464;
			word32 s6_465;
			word32 s3_462;
			word32 a5_460;
			word32 s2_461;
			word32 a2_457;
			word32 a3_458;
			word32 a4_459;
			word32 a1_456;
			word32 a0_455;
			word32 s1_454;
			bl_printk(ra, &g_t23083EC0, 587742780, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_454, out a0_455, out a1_456, out a2_457, out a3_458, out a4_459, out a5_460, out s2_461, out s3_462, out s4_463, out s5_464, out s6_465, out s7_466, out s8_467, out s9_468, out s10_469, out s11_470);
			return;
		}
	}
	else
	{
		word32 a4_446;
		word32 a5_447;
		word32 a1_443;
		word32 a2_444;
		word32 a3_445;
		Eq_2 a0_19 = atoi(a0, out a1_443, out a2_444, out a3_445, out a4_446, out a5_447);
		word32 a2_449;
		word32 a4_450;
		word32 a5_451;
		word32 a1_448;
		word32 * a3_118;
		Eq_2 a0_36 = atoi(a0_19, out a1_448, out a2_449, out a3_118, out a4_450, out a5_451);
		Eq_2 s1_114 = a0_36;
		up32 a4_52 = (word32) g_b4201FC5C;
		if (a0_19 >= 0x00 && a0_36 >= 0x00)
		{
			if (a4_52 <= 0x02 && (word32) g_b4201FC61 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_491;
					xTaskGetTickCountFromISR(out a5_491);
				}
				else
				{
					word32 a5_490;
					xTaskGetTickCount(out a5_490);
				}
				word32 a0_492;
				word32 a1_493;
				word32 a2_494;
				word32 a4_495;
				word32 a5_496;
				word32 s2_497;
				word32 s3_498;
				word32 s4_499;
				word32 s5_500;
				word32 s6_501;
				word32 s7_502;
				word32 s8_503;
				word32 s9_504;
				word32 s10_505;
				word32 s11_506;
				bl_printk(ra, &g_t23083F28, 587742780, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_114, out a0_492, out a1_493, out a2_494, out a3_118, out a4_495, out a5_496, out s2_497, out s3_498, out s4_499, out s5_500, out s6_501, out s7_502, out s8_503, out s9_504, out s10_505, out s11_506);
			}
			0x00 = dwArg38;
			word32 a1_115 = (word32) (s1_114 != 0x00);
			bl_gpio_output_set(a0_19 & 0x00FF, a1_115, a3_118);
			return;
		}
		if (a4_52 <= 0x04 && (word32) g_b4201FC61 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_472;
				xTaskGetTickCountFromISR(out a5_472);
			}
			else
			{
				word32 a5_471;
				xTaskGetTickCount(out a5_471);
			}
			0x00 = dwArg38;
			word32 s9_487;
			word32 s8_486;
			word32 s6_484;
			word32 s7_485;
			word32 s5_483;
			word32 s4_482;
			word32 s2_480;
			word32 s10_488;
			word32 s11_489;
			word32 s3_481;
			word32 a4_478;
			word32 a5_479;
			word32 a2_476;
			word32 a3_477;
			word32 a0_474;
			word32 a1_475;
			word32 s1_473;
			bl_printk(ra, &g_t23083F04, 587742780, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_473, out a0_474, out a1_475, out a2_476, out a3_477, out a4_478, out a5_479, out s2_480, out s3_481, out s4_482, out s5_483, out s6_484, out s7_485, out s8_486, out s9_487, out s10_488, out s11_489);
			return;
		}
	}
	0x00 = dwArg38;
}

// 23034A70: void cmd_gpio_func(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register (ptr32 Eq_166519) a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack word32 dwArg0100, Stack word32 dwArg0128)
void cmd_gpio_func(Eq_2 ra, Eq_2 a0, word32 a2, struct Eq_166519 * a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgBC, word32 dwArg0100, word32 dwArg0128)
{
	if (a2 != 0x05)
	{
		if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC61 <= 0x02)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_591;
				xTaskGetTickCountFromISR(out a5_591);
			}
			else
			{
				word32 a5_590;
				xTaskGetTickCount(out a5_590);
			}
			0x00 = dwArg0128;
			word32 s7_604;
			word32 s8_605;
			word32 s6_603;
			word32 s3_600;
			word32 a4_597;
			word32 s5_602;
			word32 a3_596;
			word32 a2_595;
			word32 s4_601;
			word32 s2_599;
			word32 a5_598;
			word32 s9_606;
			word32 s10_607;
			word32 s11_608;
			word32 a1_594;
			word32 s1_592;
			word32 a0_593;
			bl_printk(ra, &g_t23083D9C, 587742780, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_592, out a0_593, out a1_594, out a2_595, out a3_596, out a4_597, out a5_598, out s2_599, out s3_600, out s4_601, out s5_602, out s6_603, out s7_604, out s8_605, out s9_606, out s10_607, out s11_608);
			return;
		}
	}
	else
	{
		word32 a1_570;
		word32 a2_571;
		word32 a3_572;
		word32 a4_573;
		word32 a5_574;
		Eq_2 a0_23 = atoi(a0, out a1_570, out a2_571, out a3_572, out a4_573, out a5_574);
		word32 a4_578;
		word32 a5_579;
		word32 a3_577;
		word32 a1_575;
		word32 a2_576;
		Eq_2 a0_40 = atoi(a3->t0008, out a1_575, out a2_576, out a3_577, out a4_578, out a5_579);
		word32 a4_583;
		word32 a5_584;
		word32 a1_580;
		word32 a2_581;
		word32 a3_582;
		Eq_2 a0_57 = atoi(a3->t000C, out a1_580, out a2_581, out a3_582, out a4_583, out a5_584);
		Eq_2 s3_158 = a0_40;
		Eq_2 s1_154 = a0_57;
		word32 a3_587;
		word32 a4_588;
		word32 a5_589;
		word32 a2_586;
		word32 a1_585;
		Eq_2 a0_74 = atoi(a3->t0010, out a1_585, out a2_586, out a3_587, out a4_588, out a5_589);
		if (a0_23 >= 0x00 && (a0_40 >= 0x00 && (a0_57 >= 0x00 && a0_74 >= 0x00)))
		{
			if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC61 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_629;
					xTaskGetTickCountFromISR(out a5_629);
				}
				else
				{
					word32 a5_628;
					xTaskGetTickCount(out a5_628);
				}
				word32 a0_630;
				word32 a1_631;
				word32 a2_632;
				word32 a3_633;
				word32 a4_634;
				word32 a5_635;
				word32 s2_636;
				word32 s4_637;
				word32 s5_638;
				word32 s6_639;
				word32 s7_640;
				word32 s8_641;
				word32 s9_642;
				word32 s10_643;
				word32 s11_644;
				bl_printk(ra, &g_t23083DE8, 587742780, dwLoc28, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_154, out a0_630, out a1_631, out a2_632, out a3_633, out a4_634, out a5_635, out s2_636, out s3_158, out s4_637, out s5_638, out s6_639, out s7_640, out s8_641, out s9_642, out s10_643, out s11_644);
			}
			word32 a1_170 = (word32) (s1_154 != 0x00);
			if (s3_158 == 0x00)
			{
				0x00 = dwArg0128;
				bl_gpio_enable_output(a1_170, dwArg0100);
				return;
			}
			else
			{
				0x00 = dwArg0128;
				bl_gpio_enable_input(a1_170, dwArg0100);
				return;
			}
		}
		if ((word32) g_b4201FC5C <= 0x04 && (word32) g_b4201FC61 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_610;
				xTaskGetTickCountFromISR(out a5_610);
			}
			else
			{
				word32 a5_609;
				xTaskGetTickCount(out a5_609);
			}
			0x00 = dwArg0128;
			word32 s1_611;
			word32 a1_613;
			word32 a0_612;
			word32 a4_616;
			word32 a2_614;
			word32 s2_618;
			word32 a3_615;
			word32 a5_617;
			word32 s3_619;
			word32 s4_620;
			word32 s5_621;
			word32 s7_623;
			word32 s6_622;
			word32 s8_624;
			word32 s9_625;
			word32 s10_626;
			word32 s11_627;
			bl_printk(ra, &g_t23083F04, 587742780, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_611, out a0_612, out a1_613, out a2_614, out a3_615, out a4_616, out a5_617, out s2_618, out s3_619, out s4_620, out s5_621, out s6_622, out s7_623, out s8_624, out s9_625, out s10_626, out s11_627);
			return;
		}
	}
	0x00 = dwArg0128;
}

