pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23034C4C: void bl_gpio_cli_init()
// Called from:
//      aos_loop_proc
void bl_gpio_cli_init()
{
}

// 23034C50: Register Eq_2 bl_efuse_read_mac(Register Eq_2 ra, Register (ptr32 Eq_166813) s0, Register Eq_2 s1, Register ptr32 a0, Register Eq_2 s2, Register word32 s3, Register word32 s4, Register out (ptr32 Eq_166819) s0Out, Register out ptr32 s1Out, Register out Eq_166821 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      hal_board_cfg
Eq_2 bl_efuse_read_mac(Eq_2 ra, struct Eq_166813 * s0, Eq_2 s1, ptr32 a0, Eq_2 s2, word32 s3, word32 s4, struct Eq_166819 & s0Out, ptr32 & s1Out, union Eq_166821 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	struct Eq_166819 * s0_19;
	ptr32 s1_20;
	Eq_166821 s2_21;
	ptr32 s3_22;
	ptr32 s4_23;
	Eq_2 ra_18 = EF_Ctrl_Read_MAC_Address(ra, s0, s1, a0, s2, s3, s4, out s0_19, out s1_20, out s2_21, out s3_22, out s4_23);
	s0Out = s0_19;
	s1Out = s1_20;
	s2Out = s2_21;
	s3Out = s3_22;
	s4Out = s4_23;
	return ra_18;
}

// 23034C60: Register Eq_2 bl_efuse_read_mac_factory(Register Eq_2 ra, Register (ptr32 Eq_166813) s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a3, Register (ptr32 word32) a4, Register Eq_2 s2, Register word32 s3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Register out (ptr32 Eq_166870) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_166874 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      hal_board_cfg
Eq_2 bl_efuse_read_mac_factory(Eq_2 ra, struct Eq_166813 * s0, Eq_2 s1, Eq_2 a0, Eq_2 a3, word32 * a4, Eq_2 s2, word32 s3, word32 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArg9C, struct Eq_166870 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_166874 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	word32 a0_16;
	ptr32 a3_19;
	struct Eq_166870 * s0_25;
	ptr32 s1_26;
	ptr32 s10_27;
	ptr32 s11_28;
	Eq_166874 s2_29;
	ptr32 s3_30;
	ptr32 s4_31;
	ptr32 s5_32;
	ptr32 s6_33;
	ptr32 s7_34;
	ptr32 mstatus_40;
	Eq_2 ra_24 = mfg_media_read_macaddr(ra, s0, s1, a0, 0x01, a3, a4, s2, s3, s4, mstatus, dwLoc08, dwArg08, dwArg28, dwArg40, dwArg44, dwArg50, dwArg54, dwArg68, dwArg78, dwArg8C, dwArg9C, out s0_25, out s1_26, out a0_16, out a3_19, out s2_29, out s3_30, out s4_31, out s5_32, out s6_33, out s7_34, out s10_27, out s11_28, out mstatus_40);
	s0Out = s0_25;
	s1Out = s1_26;
	a0Out = 0x00 - (word32) (a0_16 != 0x00);
	a3Out = a3_19;
	s2Out = s2_29;
	s3Out = s3_30;
	s4Out = s4_31;
	s5Out = s5_32;
	s6Out = s6_33;
	s7Out = s7_34;
	s10Out = s10_27;
	s11Out = s11_28;
	mstatusOut = mstatus_40;
	return ra_24;
}

// 23034C78: Register Eq_2 bl_efuse_read_capcode(Register Eq_2 ra, Register (ptr32 Eq_166956) s0, Register Eq_2 s1, Register (ptr32 byte) a0, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_277262)) a4, Register int32 s2, Register (ptr32 Eq_166962) s3, Register ptr32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Register out (ptr32 Eq_166970) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s10Out, Register out ptr32 s11Out, Register out ptr32 mstatusOut)
// Called from:
//      hal_board_cfg
Eq_2 bl_efuse_read_capcode(Eq_2 ra, struct Eq_166956 * s0, Eq_2 s1, byte * a0, Eq_2 a3, struct Eq_277262 ** a4, int32 s2, struct Eq_166962 * s3, ptr32 s4, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, struct Eq_166970 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s10Out, ptr32 & s11Out, ptr32 & mstatusOut)
{
	word32 a0_16;
	ptr32 a3_19;
	struct Eq_166970 * s0_25;
	ptr32 s1_26;
	ptr32 s10_27;
	ptr32 s11_28;
	ptr32 s2_29;
	ptr32 s3_30;
	ptr32 s4_31;
	ptr32 s5_32;
	ptr32 s6_33;
	ptr32 s7_34;
	ptr32 s8_35;
	ptr32 mstatus_40;
	Eq_2 ra_24 = mfg_media_read_xtal_capcode(ra, s0, s1, a0, 0x01, a3, a4, s2, s3, s4, mstatus, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg68, dwArg8C, out s0_25, out s1_26, out a0_16, out a3_19, out s2_29, out s3_30, out s4_31, out s5_32, out s6_33, out s7_34, out s8_35, out s10_27, out s11_28, out mstatus_40);
	s0Out = s0_25;
	s1Out = s1_26;
	a0Out = 0x00 - (word32) (a0_16 != 0x00);
	a3Out = a3_19;
	s2Out = s2_29;
	s3Out = s3_30;
	s4Out = s4_31;
	s5Out = s5_32;
	s6Out = s6_33;
	s7Out = s7_34;
	s8Out = s8_35;
	s10Out = s10_27;
	s11Out = s11_28;
	mstatusOut = mstatus_40;
	return ra_24;
}

// 23034C90: Register Eq_2 bl_efuse_read_pwroft(Register Eq_2 ra, Register (ptr32 Eq_167055) s0, Register Eq_2 s1, Register ptr32 a0, Register Eq_2 a3, Register (ptr32 (ptr32 Eq_277262)) a4, Register (ptr32 byte) s2, Register Eq_2 s3, Register word32 s4, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_167070) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      hal_board_cfg
Eq_2 bl_efuse_read_pwroft(Eq_2 ra, struct Eq_167055 * s0, Eq_2 s1, ptr32 a0, Eq_2 a3, struct Eq_277262 ** a4, byte * s2, Eq_2 s3, word32 s4, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArg0118, struct Eq_167070 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	word32 a0_16;
	ptr32 a3_19;
	struct Eq_167070 * s0_25;
	ptr32 s1_26;
	ptr32 s2_29;
	ptr32 s4_31;
	ptr32 s5_32;
	ptr32 s6_33;
	ptr32 s7_34;
	ptr32 s8_35;
	ptr32 s9_36;
	ptr32 mstatus_42;
	Eq_2 ra_24 = mfg_media_read_poweroffset(ra, s0, s1, a0, 0x01, a3, a4, s2, s3, s4, mstatus, dwLoc08, dwArg28, dwArg40, dwArg44, dwArg68, dwArg8C, dwArg0118, out s0_25, out s1_26, out a0_16, out a3_19, out s2_29, out s4_31, out s5_32, out s6_33, out s7_34, out s8_35, out s9_36, out mstatus_42);
	s0Out = s0_25;
	s1Out = s1_26;
	a0Out = 0x00 - (word32) (a0_16 != 0x00);
	a3Out = a3_19;
	s2Out = s2_29;
	s4Out = s4_31;
	s5Out = s5_32;
	s6Out = s6_33;
	s7Out = s7_34;
	s8Out = s8_35;
	s9Out = s9_36;
	mstatusOut = mstatus_42;
	return ra_24;
}

// 23034CA8: Register Eq_2 Aes_Compare_Data(Register Eq_2 ra, Register word32 a0, Register word32 a1, Register int32 a2, Register Eq_2 s2, Register Eq_2 s5, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg010C, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_2 a3Out, Register out ptr32 s2Out, Register out Eq_2 s5Out)
// Called from:
//      Sec_Eng_AES_Link_Case_CBC_128
//      Sec_Eng_AES_Link_Case_CTR_128
//      Sec_Eng_AES_Link_Case_ECB_128
Eq_2 Aes_Compare_Data(Eq_2 ra, word32 a0, word32 a1, int32 a2, Eq_2 s2, Eq_2 s5, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg6C, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArg010C, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_2 & a3Out, ptr32 & s2Out, union Eq_2 & s5Out)
{
	word32 s7_118 = a0;
	word32 s8_119 = a1;
	int32 s1_110 = a2;
	word32 a4_123 = 0x00;
	int32 s0_125 = 0x00;
	struct Eq_167175 * s6_117 = &g_t42020000;
	struct Eq_167177 * s9_120 = &g_t42020000;
	struct Eq_167179 * s10_111 = &g_t4200E000;
	word32 s11_112 = 0x23084000;
	ptr32 s2_113 = 0x2307B100;
	s5_116 = s5;
	while (true)
	{
		Eq_2 s5_116;
		up32 a5_48 = (word32) s6_117->bFFFFFC5C;
		if (s0_125 == s1_110)
			break;
		s5_116 = s8_119 + s0_125;
		byte * s4_54 = s7_118 + s0_125;
		if ((word32) *s5_116 != (word32) (*s4_54))
		{
			a4_123 = 0x01;
			if (a5_48 <= 0x02 && (word32) s9_120->bFFFFFC62 <= 0x02)
			{
				if (s10_111->dwFFFFFE84 != 0x00)
				{
					word32 a5_516;
					xTaskGetTickCountFromISR(out a5_516);
				}
				else
				{
					word32 a5_515;
					xTaskGetTickCount(out a5_515);
				}
				(word32) *s5_116 == (word32) (*s4_54);
				word32 s4_524;
				word32 a4_521;
				word32 s3_523;
				word32 a5_522;
				word32 a1_518;
				word32 a3_520;
				word32 a2_519;
				word32 a0_517;
				ra = bl_printk(ra, &g_t23083388, s11_112 + -0x0C, dwLoc48, dwLoc28, dwArg20, dwArg24, s5, dwArg6C, out s1_110, out a0_517, out a1_518, out a2_519, out a3_520, out a4_521, out a5_522, out s2_113, out s3_523, out s4_524, out s5_116, out s6_117, out s7_118, out s8_119, out s9_120, out s10_111, out s11_112);
				a4_123 = 0x01;
			}
		}
		++s0_125;
	}
	struct Eq_274 * a0_147;
	if (a4_123 != 0x00)
	{
		if (a5_48 <= 0x04 && (word32) g_b4201FC62 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_501;
				xTaskGetTickCountFromISR(out a5_501);
			}
			else
			{
				word32 a5_500;
				xTaskGetTickCount(out a5_500);
			}
			a0_147 = (struct Eq_274 *) &g_t230833B4;
			goto l23034D38;
		}
	}
	else if (a5_48 <= 0x02 && (word32) g_b4201FC62 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_526;
			xTaskGetTickCountFromISR(out a5_526);
		}
		else
		{
			word32 a5_525;
			xTaskGetTickCount(out a5_525);
		}
		a0_147 = (struct Eq_274 *) &g_t230833E8;
l23034D38:
		0x00 = (uint16) dwArg010C;
		Eq_2 a3_208;
		ptr32 s1_212;
		ptr32 s2_215;
		Eq_2 s5_218;
		word32 s9_512;
		word32 s11_514;
		word32 s10_513;
		word32 s6_509;
		word32 s8_511;
		word32 s7_510;
		word32 s3_507;
		word32 s4_508;
		word32 a0_502;
		word32 a1_503;
		word32 a2_504;
		word32 a4_505;
		word32 a5_506;
		Eq_2 ra_211 = bl_printk(dwLoc08, a0_147, s2, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_212, out a0_502, out a1_503, out a2_504, out a3_208, out a4_505, out a5_506, out s2_215, out s3_507, out s4_508, out s5_218, out s6_509, out s7_510, out s8_511, out s9_512, out s10_513, out s11_514);
		s0Out.u0 = <invalid>;
		s1Out = s1_212;
		a3Out = a3_208;
		s2Out = s2_215;
		s5Out = s5_218;
		return ra_211;
	}
	0x00 = (uint16) dwArg010C;
	s0Out.u0 = <invalid>;
	s1Out = dwLoc4C;
	a3Out = s2;
	s2Out = s2_113;
	s5Out = s5_116;
	return dwLoc08;
}

