pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23034E30: Register Eq_2 _dump_iv_status(Register Eq_2 ra, Register Eq_2 s1, Register ptr32 a0, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      Sec_Eng_AES_Link_Case_CBC_128
//      Sec_Eng_AES_Link_Case_CTR_128
Eq_2 _dump_iv_status(Eq_2 ra, Eq_2 s1, ptr32 a0, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	word32 s2_15 = 0x23084000;
	ra_22 = ra;
	do
	{
		Eq_2 ra_22;
		word32 s1_34;
		word32 a2_115;
		word32 a1_114;
		word32 a0_113;
		word32 s10_125;
		word32 s9_124;
		word32 s8_123;
		word32 s7_122;
		word32 s6_121;
		word32 s5_120;
		word32 s4_119;
		word32 s3_118;
		word32 a5_117;
		word32 a4_116;
		word32 s11_126;
		ra_22 = bl_printk(ra_22, s2_15 + 400, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_34, out a0_113, out a1_114, out a2_115, out a3, out a4_116, out a5_117, out s2_15, out s3_118, out s4_119, out s5_120, out s6_121, out s7_122, out s8_123, out s9_124, out s10_125, out s11_126);
	} while (s1_34 != a0 + 28);
	0x00 = dwArg38;
	ptr32 s2_66;
	ptr32 s3_67;
	ptr32 s5_69;
	word32 s1_127;
	word32 a0_128;
	word32 a1_129;
	word32 a2_130;
	word32 a3_131;
	word32 a4_132;
	word32 a5_133;
	word32 s4_134;
	word32 s6_135;
	word32 s7_136;
	word32 s8_137;
	word32 s9_138;
	word32 s10_139;
	word32 s11_140;
	Eq_2 ra_62 = bl_printk(ra_22, &g_t230727FC, a3, dwArg08, dwArg28, s1, ra, dwArg98, dwArgBC, out s1_127, out a0_128, out a1_129, out a2_130, out a3_131, out a4_132, out a5_133, out s2_66, out s3_67, out s4_134, out s5_69, out s6_135, out s7_136, out s8_137, out s9_138, out s10_139, out s11_140);
	s2Out = s2_66;
	s3Out = s3_67;
	s5Out = s5_69;
	return ra_62;
}

// 23034E6E: void bl_sec_aes_IRQHandler(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void bl_sec_aes_IRQHandler(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	word32 s1_45;
	word32 a0_46;
	word32 a1_47;
	word32 a2_48;
	word32 a3_49;
	word32 a4_50;
	word32 a5_51;
	word32 s2_52;
	word32 s3_53;
	word32 s4_54;
	word32 s5_55;
	word32 s6_56;
	word32 s7_57;
	word32 s8_58;
	word32 s9_59;
	word32 s10_60;
	word32 s11_61;
	bl_printk(ra, &g_t23084298, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_45, out a0_46, out a1_47, out a2_48, out a3_49, out a4_50, out a5_51, out s2_52, out s3_53, out s4_54, out s5_55, out s6_56, out s7_57, out s8_58, out s9_59, out s10_60, out s11_61);
	*(int32 *) 0x40004100 |= 0x0200;
}

// 23034E94: Register Eq_2 Sec_Eng_AES_Link_Case_CBC_128(Register Eq_2 ra, Register word32 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg8C, Register out ptr32 a3Out)
// Called from:
//      bl_sec_aes_test
Eq_2 Sec_Eng_AES_Link_Case_CBC_128(Eq_2 ra, word32 s2, Eq_2 dwArg08, Eq_2 dwArg2C, Eq_2 dwArg8C, ptr32 & a3Out)
{
	word32 a3_724;
	word32 t1_720;
	word32 a1_722;
	word32 a0_721;
	word32 a4_725;
	word32 a5_726;
	word32 a2_723;
	Eq_2 ra_103 = memset(ra, fp + -92, 0x00, 60, out t1_720, out a0_721, out a1_722, out a2_723, out a3_724, out a4_725, out a5_726);
	Eq_2 a3_100 = Sec_Eng_AES_Enable_Link();
	word32 a4_730;
	word32 s4_732;
	word32 s8_733;
	word32 a5_731;
	word32 a2_729;
	word32 a0_727;
	word32 a1_728;
	Eq_2 s1_104 = puts(0x23084004, out a0_727, out a1_728, out a2_729, out a4_730, out a5_731, out s4_732, out s8_733);
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC62 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_739;
			xTaskGetTickCountFromISR(out a5_739);
		}
		else
		{
			word32 a5_738;
			xTaskGetTickCount(out a5_738);
		}
		word32 s11_758;
		word32 s3_750;
		word32 s5_752;
		word32 s7_754;
		word32 s9_756;
		word32 s10_757;
		word32 s8_755;
		word32 s6_753;
		word32 s4_751;
		word32 a0_744;
		word32 a2_746;
		word32 a5_748;
		word32 s2_749;
		word32 a4_747;
		word32 a1_745;
		ra_103 = bl_printk(ra_103, &g_t23084020, 0x23083FF4, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, 0x07060504, ra, out s1_104, out a0_744, out a1_745, out a2_746, out a3_100, out a4_747, out a5_748, out s2_749, out s3_750, out s4_751, out s5_752, out s6_753, out s7_754, out s8_755, out s9_756, out s10_757, out s11_758);
	}
	Eq_2 s5_137;
	struct Eq_167560 * s0_172;
	word32 s2_734;
	word32 s2_736;
	word32 s5_737;
	word32 s3_735;
	Eq_2 s1_173;
	Eq_2 a3_166;
	Eq_2 ra_171 = Aes_Compare_Data(_dump_iv_status(ra_103, s1_104, fp + -92, a3_100, dwLoc78, 0x03020100, dwLoc58, s2, dwLoc20, dwLoc1C, dwArg08, 0x07060504, dwArg2C, ra, out s2_734, out s3_735, out s5_137), 0x23084198, Sec_Eng_AES_Link_Work(fp + -92, &g_t23084258, 32, fp + -0x007C), 32, 0x23084000, s5_137, dwLoc78, 370507307, 2283141035, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, 0x07060504, ra, dwArg8C, out s0_172, out s1_173, out a3_166, out s2_736, out s5_737);
	if ((word32) s0_172->bFFFFFC5C <= 0x02 && (word32) g_b4201FC62 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_743;
			xTaskGetTickCountFromISR(out a5_743);
		}
		else
		{
			word32 a5_742;
			xTaskGetTickCount(out a5_742);
		}
		word32 s10_772;
		word32 s11_773;
		word32 s9_771;
		word32 s8_770;
		word32 s7_769;
		word32 s6_768;
		word32 s4_766;
		word32 s5_767;
		word32 s2_764;
		word32 s3_765;
		word32 a4_762;
		word32 a5_763;
		word32 a1_760;
		word32 a2_761;
		word32 a0_759;
		ra_171 = bl_printk(ra_171, &g_t23084054, 0x23083FF4, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, 0x07060504, ra, out s1_173, out a0_759, out a1_760, out a2_761, out a3_166, out a4_762, out a5_763, out s2_764, out s3_765, out s4_766, out s5_767, out s6_768, out s7_769, out s8_770, out s9_771, out s10_772, out s11_773);
	}
	Eq_2 s2_250;
	word32 s3_251;
	Eq_2 s5_253;
	struct Eq_167638 * s0_288;
	word32 s2_740;
	word32 s5_741;
	Eq_2 s1_289;
	Eq_2 a3_282;
	Eq_2 ra_287 = Aes_Compare_Data(_dump_iv_status(ra_171, s1_173, fp + -92, a3_166, dwLoc78, 0x03020100, dwLoc58, s2, dwLoc20, dwLoc1C, dwArg08, 0x07060504, dwArg2C, ra, out s2_250, out s3_251, out s5_253), (word32) s2_250 + 440, Sec_Eng_AES_Link_Work(fp + -92, s3_251 + 632, 0x10, fp + -0x007C), 0x10, s2_250, s5_253, dwLoc78, 370507307, 2283141035, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, 0x07060504, ra, dwArg8C, out s0_288, out s1_289, out a3_282, out s2_740, out s5_741);
	if ((word32) s0_288->bFFFFFC5C <= 0x02 && (word32) g_b4201FC62 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_778;
			xTaskGetTickCountFromISR(out a5_778);
		}
		else
		{
			word32 a5_777;
			xTaskGetTickCount(out a5_777);
		}
		word32 s11_798;
		word32 s9_796;
		word32 s10_797;
		word32 s7_794;
		word32 s8_795;
		word32 s5_792;
		word32 s6_793;
		word32 s3_790;
		word32 s4_791;
		word32 s2_789;
		word32 a5_788;
		word32 a2_786;
		word32 a4_787;
		word32 a0_784;
		word32 a1_785;
		ra_287 = bl_printk(ra_287, &g_t23084088, 0x23083FF4, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, 0x07060504, ra, out s1_289, out a0_784, out a1_785, out a2_786, out a3_282, out a4_787, out a5_788, out s2_789, out s3_790, out s4_791, out s5_792, out s6_793, out s7_794, out s8_795, out s9_796, out s10_797, out s11_798);
	}
	Eq_2 s2_366;
	Eq_2 s5_369;
	struct Eq_167774 * s0_406;
	word32 s5_776;
	word32 s2_775;
	word32 s3_774;
	Eq_2 s1_407;
	Eq_2 a3_400;
	Eq_2 ra_405 = Aes_Compare_Data(_dump_iv_status(ra_287, s1_289, fp + -92, a3_282, dwLoc78, 0x03020100, dwLoc58, s2, dwLoc20, dwLoc1C, dwArg08, 0x07060504, dwArg2C, ra, out s2_366, out s3_774, out s5_369), 587743688, Sec_Eng_AES_Link_Work(fp + -92, &g_t23084288, 0x10, fp + -0x007C), 0x10, s2_366, s5_369, dwLoc78, 370507307, 2283141035, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, 0x07060504, ra, dwArg8C, out s0_406, out s1_407, out a3_400, out s2_775, out s5_776);
	if ((word32) s0_406->bFFFFFC5C <= 0x02 && (word32) g_b4201FC62 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_783;
			xTaskGetTickCountFromISR(out a5_783);
		}
		else
		{
			word32 a5_782;
			xTaskGetTickCount(out a5_782);
		}
		word32 s11_813;
		word32 s10_812;
		word32 s9_811;
		word32 s8_810;
		word32 s6_808;
		word32 s7_809;
		word32 s5_807;
		word32 s4_806;
		word32 s3_805;
		word32 s2_804;
		word32 a4_802;
		word32 a5_803;
		word32 a1_800;
		word32 a2_801;
		word32 a0_799;
		ra_405 = bl_printk(ra_405, &g_t23084054, 0x23083FF4, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, 0x07060504, ra, out s1_407, out a0_799, out a1_800, out a2_801, out a3_400, out a4_802, out a5_803, out s2_804, out s3_805, out s4_806, out s5_807, out s6_808, out s7_809, out s8_810, out s9_811, out s10_812, out s11_813);
	}
	word32 s3_780;
	word32 s5_781;
	word32 s2_779;
	Eq_2 ra_480 = _dump_iv_status(ra_405, s1_407, fp + -92, a3_400, dwLoc78, 0x03020100, dwLoc58, s2, dwLoc20, dwLoc1C, dwArg08, 0x07060504, dwArg2C, ra, out s2_779, out s3_780, out s5_781);
	Sec_Eng_AES_Disable_Link();
	a3Out = dwArgF8;
	return ra_480;
}

// 230350FC: Register Eq_2 Sec_Eng_AES_Link_Case_CTR_128(Register Eq_2 ra, Register word32 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg8C, Register out (ptr32 Eq_167946) s0Out, Register out ptr32 a3Out)
// Called from:
//      bl_sec_aes_test
Eq_2 Sec_Eng_AES_Link_Case_CTR_128(Eq_2 ra, word32 s2, Eq_2 dwArg08, Eq_2 dwArg2C, Eq_2 dwArg8C, struct Eq_167946 & s0Out, ptr32 & a3Out)
{
	word32 a2_724;
	word32 a0_722;
	word32 a5_727;
	word32 t1_721;
	word32 a3_725;
	word32 a4_726;
	word32 a1_723;
	Eq_2 ra_103 = memset(ra, fp + -92, 0x00, 60, out t1_721, out a0_722, out a1_723, out a2_724, out a3_725, out a4_726, out a5_727);
	Eq_2 a3_100 = Sec_Eng_AES_Enable_Link();
	word32 s8_734;
	word32 a2_730;
	word32 a5_732;
	word32 s4_733;
	word32 a4_731;
	word32 a1_729;
	word32 a0_728;
	Eq_2 s1_104 = puts(0x230840BC, out a0_728, out a1_729, out a2_730, out a4_731, out a5_732, out s4_733, out s8_734);
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FC62 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_740;
			xTaskGetTickCountFromISR(out a5_740);
		}
		else
		{
			word32 a5_739;
			xTaskGetTickCount(out a5_739);
		}
		word32 s10_758;
		word32 s11_759;
		word32 s2_750;
		word32 s4_752;
		word32 s6_754;
		word32 s8_756;
		word32 s9_757;
		word32 s7_755;
		word32 s5_753;
		word32 s3_751;
		word32 a1_746;
		word32 a4_748;
		word32 a5_749;
		word32 a2_747;
		word32 a0_745;
		ra_103 = bl_printk(ra_103, &g_t230840D8, 0x23083FF4, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, ~0x08090A0B, ra, out s1_104, out a0_745, out a1_746, out a2_747, out a3_100, out a4_748, out a5_749, out s2_750, out s3_751, out s4_752, out s5_753, out s6_754, out s7_755, out s8_756, out s9_757, out s10_758, out s11_759);
	}
	Eq_2 s5_137;
	struct Eq_167997 * s0_172;
	word32 s3_736;
	word32 s5_738;
	word32 s2_737;
	word32 s2_735;
	Eq_2 s1_173;
	Eq_2 a3_166;
	Eq_2 ra_171 = Aes_Compare_Data(_dump_iv_status(ra_103, s1_104, fp + -92, a3_100, dwLoc78, ~0x0C0D0E0F, dwLoc58, s2, dwLoc20, dwLoc1C, dwArg08, ~0x08090A0B, dwArg2C, ra, out s2_735, out s3_736, out s5_137), 587743704, Sec_Eng_AES_Link_Work(fp + -92, &g_t23084258, 32, fp + -0x007C), 32, 0x23084000, s5_137, dwLoc78, 370507307, 2283141035, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, ~0x08090A0B, ra, dwArg8C, out s0_172, out s1_173, out a3_166, out s2_737, out s5_738);
	if ((word32) s0_172->bFFFFFC5C <= 0x02 && (word32) g_b4201FC62 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_744;
			xTaskGetTickCountFromISR(out a5_744);
		}
		else
		{
			word32 a5_743;
			xTaskGetTickCount(out a5_743);
		}
		word32 s11_774;
		word32 s9_772;
		word32 s10_773;
		word32 s8_771;
		word32 s7_770;
		word32 s6_769;
		word32 s5_768;
		word32 s3_766;
		word32 s4_767;
		word32 a5_764;
		word32 s2_765;
		word32 a2_762;
		word32 a4_763;
		word32 a0_760;
		word32 a1_761;
		ra_171 = bl_printk(ra_171, &g_t2308410C, 0x23083FF4, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, ~0x08090A0B, ra, out s1_173, out a0_760, out a1_761, out a2_762, out a3_166, out a4_763, out a5_764, out s2_765, out s3_766, out s4_767, out s5_768, out s6_769, out s7_770, out s8_771, out s9_772, out s10_773, out s11_774);
	}
	Eq_2 s2_250;
	word32 s3_251;
	Eq_2 s5_253;
	struct Eq_168068 * s0_288;
	word32 s5_742;
	word32 s2_741;
	Eq_2 s1_289;
	Eq_2 a3_282;
	Eq_2 ra_287 = Aes_Compare_Data(_dump_iv_status(ra_171, s1_173, fp + -92, a3_166, dwLoc78, ~0x0C0D0E0F, dwLoc58, s2, dwLoc20, dwLoc1C, dwArg08, ~0x08090A0B, dwArg2C, ra, out s2_250, out s3_251, out s5_253), (word32) s2_250 + 504, Sec_Eng_AES_Link_Work(fp + -92, s3_251 + 632, 0x10, fp + -0x007C), 0x10, s2_250, s5_253, dwLoc78, 370507307, 2283141035, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, ~0x08090A0B, ra, dwArg8C, out s0_288, out s1_289, out a3_282, out s2_741, out s5_742);
	if ((word32) s0_288->bFFFFFC5C <= 0x02 && (word32) g_b4201FC62 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_779;
			xTaskGetTickCountFromISR(out a5_779);
		}
		else
		{
			word32 a5_778;
			xTaskGetTickCount(out a5_778);
		}
		word32 s10_798;
		word32 s11_799;
		word32 s8_796;
		word32 s9_797;
		word32 s6_794;
		word32 s7_795;
		word32 s4_792;
		word32 s5_793;
		word32 s2_790;
		word32 s3_791;
		word32 a5_789;
		word32 a4_788;
		word32 a1_786;
		word32 a2_787;
		word32 a0_785;
		ra_287 = bl_printk(ra_287, &g_t2308410C, 0x23083FF4, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, ~0x08090A0B, ra, out s1_289, out a0_785, out a1_786, out a2_787, out a3_282, out a4_788, out a5_789, out s2_790, out s3_791, out s4_792, out s5_793, out s6_794, out s7_795, out s8_796, out s9_797, out s10_798, out s11_799);
	}
	Eq_2 s2_366;
	Eq_2 s5_369;
	word32 s5_777;
	word32 s2_776;
	word32 s3_775;
	Eq_2 s1_407;
	Eq_2 a3_400;
	struct Eq_167946 * s0_406;
	Eq_2 ra_405 = Aes_Compare_Data(_dump_iv_status(ra_287, s1_289, fp + -92, a3_282, dwLoc78, ~0x0C0D0E0F, dwLoc58, s2, dwLoc20, dwLoc1C, dwArg08, ~0x08090A0B, dwArg2C, ra, out s2_366, out s3_775, out s5_369), 0x23084208, Sec_Eng_AES_Link_Work(fp + -92, &g_t23084288, 0x10, fp + -0x007C), 0x10, s2_366, s5_369, dwLoc78, 370507307, 2283141035, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, ~0x08090A0B, ra, dwArg8C, out s0_406, out s1_407, out a3_400, out s2_776, out s5_777);
	if ((word32) s0_406->bFFFFFC5C <= 0x02 && (word32) g_b4201FC62 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_784;
			xTaskGetTickCountFromISR(out a5_784);
		}
		else
		{
			word32 a5_783;
			xTaskGetTickCount(out a5_783);
		}
		s0_406 = dwArg0174;
		word32 s11_814;
		word32 s10_813;
		word32 s9_812;
		word32 s8_811;
		word32 s7_810;
		word32 s5_808;
		word32 s6_809;
		word32 s4_807;
		word32 s3_806;
		word32 s2_805;
		word32 a5_804;
		word32 a2_802;
		word32 a4_803;
		word32 a0_800;
		word32 a1_801;
		ra_405 = bl_printk(ra_405, &g_t23084140, 0x23083FF4, dwLoc78, dwLoc58, dwLoc10, dwLoc0C, ~0x08090A0B, ra, out s1_407, out a0_800, out a1_801, out a2_802, out a3_400, out a4_803, out a5_804, out s2_805, out s3_806, out s4_807, out s5_808, out s6_809, out s7_810, out s8_811, out s9_812, out s10_813, out s11_814);
	}
	word32 s5_782;
	word32 s2_780;
	word32 s3_781;
	Eq_2 ra_480 = _dump_iv_status(ra_405, s1_407, fp + -92, a3_400, dwLoc78, ~0x0C0D0E0F, dwLoc58, s2, dwLoc20, dwLoc1C, dwArg08, ~0x08090A0B, dwArg2C, ra, out s2_780, out s3_781, out s5_782);
	Sec_Eng_AES_Disable_Link();
	s0Out = s0_406;
	a3Out = dwArgF8;
	return ra_480;
}

