pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23035362: Register Eq_2 Sec_Eng_AES_Link_Case_ECB_128(Register Eq_2 ra, Register Eq_2 s5, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg9C, Register out ptr32 a3Out)
// Called from:
//      bl_sec_aes_test
Eq_2 Sec_Eng_AES_Link_Case_ECB_128(Eq_2 ra, Eq_2 s5, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg4C, Eq_2 dwArg9C, ptr32 & a3Out)
{
	word32 t1_229;
	word32 a0_230;
	word32 a1_231;
	word32 a2_232;
	word32 a3_233;
	word32 a4_234;
	word32 a5_235;
	Eq_2 ra_23 = memset(ra, fp + -76, 0x00, 60, out t1_229, out a0_230, out a1_231, out a2_232, out a3_233, out a4_234, out a5_235);
	word32 a0_236;
	word32 a1_237;
	word32 a2_238;
	word32 a4_239;
	word32 a5_240;
	word32 s4_241;
	word32 s8_242;
	puts(0x23084174, out a0_236, out a1_237, out a2_238, out a4_239, out a5_240, out s4_241, out s8_242);
	Sec_Eng_AES_Enable_Link();
	word32 s1_99;
	Eq_2 s2_102;
	Eq_2 s5_105;
	word32 s1_139;
	Eq_2 s2_142;
	Eq_2 s5_145;
	word32 s0_243;
	word32 a3_244;
	word32 s0_245;
	word32 a3_246;
	word32 s0_247;
	word32 s1_248;
	word32 a3_249;
	word32 s2_250;
	word32 s5_251;
	Aes_Compare_Data(Aes_Compare_Data(Aes_Compare_Data(ra_23, 587743768, Sec_Eng_AES_Link_Work(fp + -76, &g_t23084258, 32, fp + -0x006C), 32, 0x23084258, s5, dwLoc68, 370507307, 2283141035, dwLoc48, dwLoc04, dwArg00, dwArg04, ~0x08090A0B, dwArg4C, dwArg9C, out s0_243, out s1_99, out a3_244, out s2_102, out s5_105), s1_99 + 32, Sec_Eng_AES_Link_Work(fp + -76, (word32) s2_102 + 32, 0x10, fp + -0x006C), 0x10, s2_102, s5_105, dwLoc68, 370507307, 2283141035, dwLoc48, dwLoc04, dwArg00, dwArg04, ~0x08090A0B, dwArg4C, dwArg9C, out s0_245, out s1_139, out a3_246, out s2_142, out s5_145), s1_139 + 48, Sec_Eng_AES_Link_Work(fp + -76, (word32) s2_142 + 48, 0x10, fp + -0x006C), 0x10, s2_142, s5_145, dwLoc68, 370507307, 2283141035, dwLoc48, dwLoc04, dwArg00, dwArg04, ~0x08090A0B, dwArg4C, dwArg9C, out s0_247, out s1_248, out a3_249, out s2_250, out s5_251);
	Sec_Eng_AES_Disable_Link();
	a3Out = dwArgC0;
	return dwArgE8;
}

// 2303545C: void bl_sec_aes_test(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC)
// Called from:
//      cmd_aes
void bl_sec_aes_test(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC)
{
	Eq_2 a3_16;
	word32 s1_239;
	word32 s2_240;
	word32 s3_241;
	word32 s4_242;
	word32 s6_243;
	Eq_2 ra_21 = bl_irq_register(ra, s1, 0x1D, 0x23034E6E, s2, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC, out s1_239, out a3_16, out s2_240, out s3_241, out s4_242, out s6_243);
	bl_irq_enable((struct Eq_160476 *) 0x1D);
	word32 s2_54;
	Eq_2 a3_68;
	word32 s2_105;
	Eq_2 a3_119;
	word32 s0_125;
	Eq_2 s5_158;
	Eq_2 a3_169;
	word32 s1_244;
	word32 a0_245;
	word32 a1_246;
	word32 a2_247;
	word32 a3_248;
	word32 a4_249;
	word32 a5_250;
	word32 s3_251;
	word32 s4_252;
	word32 s5_253;
	word32 s6_254;
	word32 s7_255;
	word32 s8_256;
	word32 s9_257;
	word32 s10_258;
	word32 s11_259;
	word32 s1_260;
	word32 a0_261;
	word32 a1_262;
	word32 a2_263;
	word32 a3_264;
	word32 a4_265;
	word32 a5_266;
	word32 s3_267;
	word32 s4_268;
	word32 s5_269;
	word32 s6_270;
	word32 s7_271;
	word32 s8_272;
	word32 s9_273;
	word32 s10_274;
	word32 s11_275;
	word32 s1_276;
	word32 a0_277;
	word32 a1_278;
	word32 a2_279;
	word32 a3_280;
	word32 a4_281;
	word32 a5_282;
	word32 s2_283;
	word32 s3_284;
	word32 s4_285;
	word32 s6_286;
	word32 s7_287;
	word32 s8_288;
	word32 s9_289;
	word32 s10_290;
	word32 s11_291;
	word32 s1_292;
	word32 a0_293;
	word32 a1_294;
	word32 a2_295;
	word32 a3_296;
	word32 a4_297;
	word32 a5_298;
	word32 s2_299;
	word32 s3_300;
	word32 s4_301;
	word32 s5_302;
	word32 s6_303;
	word32 s7_304;
	word32 s8_305;
	word32 s9_306;
	word32 s10_307;
	word32 s11_308;
	bl_printk(Sec_Eng_AES_Link_Case_ECB_128(bl_printk(Sec_Eng_AES_Link_Case_CTR_128(bl_printk(Sec_Eng_AES_Link_Case_CBC_128(bl_printk(ra_21, &g_t230842AC, a3_16, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_244, out a0_245, out a1_246, out a2_247, out a3_248, out a4_249, out a5_250, out s2_54, out s3_251, out s4_252, out s5_253, out s6_254, out s7_255, out s8_256, out s9_257, out s10_258, out s11_259), s2_54, dwLoc08, dwArg1C, dwArg7C, out a3_68), &g_t23084304, a3_68, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_260, out a0_261, out a1_262, out a2_263, out a3_264, out a4_265, out a5_266, out s2_105, out s3_267, out s4_268, out s5_269, out s6_270, out s7_271, out s8_272, out s9_273, out s10_274, out s11_275), s2_105, dwLoc08, dwArg1C, dwArg7C, out s0_125, out a3_119), s0_125 + 772, a3_119, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_276, out a0_277, out a1_278, out a2_279, out a3_280, out a4_281, out a5_282, out s2_283, out s3_284, out s4_285, out s5_158, out s6_286, out s7_287, out s8_288, out s9_289, out s10_290, out s11_291), s5_158, dwLoc10, s0, dwArg3C, dwArg8C, out a3_169), &g_t2307E7BC, a3_169, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_292, out a0_293, out a1_294, out a2_295, out a3_296, out a4_297, out a5_298, out s2_299, out s3_300, out s4_301, out s5_302, out s6_303, out s7_304, out s8_305, out s9_306, out s10_307, out s11_308);
}

// 230354BE: void bl_sec_sha_IRQHandler()
void bl_sec_sha_IRQHandler()
{
	word32 * a5_10;
	word32 a0_25;
	word32 a1_26;
	word32 a2_27;
	word32 a4_28;
	word32 s4_29;
	word32 s8_30;
	puts(0x23084370, out a0_25, out a1_26, out a2_27, out a4_28, out a5_10, out s4_29, out s8_30);
	*(a5_10 | 0x0200) = *a5_10;
}

// 230354E0: Register Eq_2 bl_sha_mutex_take(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      Bl_F_fast.constprop.0
Eq_2 bl_sha_mutex_take(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgAC, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word32 a0_14;
	word32 a1_143;
	word32 a2_144;
	word32 a3_145;
	word32 a4_146;
	word32 a5_147;
	ptr32 s1_114;
	ptr32 s2_119;
	ptr32 s3_120;
	ptr32 s4_121;
	xQueueSemaphoreTake(g_t4200DEB4, ~0x00, a2, a3, a4, 0x4200E000, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_114, out a0_14, out a1_143, out a2_144, out a3_145, out a4_146, out a5_147, out s2_119, out s3_120, out s4_121);
	if (a0_14 != 0x01 && ((word32) g_b4201FC5C <= 0x04 && (word32) g_b4201FC63 <= 0x04))
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_149;
			xTaskGetTickCountFromISR(out a5_149);
		}
		else
		{
			word32 a5_148;
			xTaskGetTickCount(out a5_148);
		}
		word32 a0_150;
		word32 a1_151;
		word32 a2_152;
		word32 a3_153;
		word32 a4_154;
		word32 a5_155;
		word32 s6_156;
		word32 s7_157;
		word32 s8_158;
		word32 s9_159;
		word32 s10_160;
		word32 s11_161;
		ra = bl_printk(ra, &g_t23084418, 0x23084408, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_114, out a0_150, out a1_151, out a2_152, out a3_153, out a4_154, out a5_155, out s2_119, out s3_120, out s4_121, out s5, out s6_156, out s7_157, out s8_158, out s9_159, out s10_160, out s11_161);
	}
	s1Out = s1_114;
	s2Out = s2_119;
	s3Out = s3_120;
	s4Out = s4_121;
	s5Out = s5;
	return ra;
}

// 23035556: Register Eq_2 bl_sha_mutex_give(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      Bl_F_fast.constprop.0
Eq_2 bl_sha_mutex_give(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArgAC, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out)
{
	word32 a0_14;
	word32 a5_156;
	word32 s5_159;
	word32 s4_158;
	word32 a7_157;
	word32 a3_154;
	word32 a4_155;
	word32 a1_152;
	word32 a2_153;
	word32 s0_151;
	word32 s6_160;
	word32 s8_161;
	ptr32 s1_122;
	ptr32 s2_127;
	ptr32 s3_128;
	xQueueGenericSend(g_t4200DEB4, 0x00, 0x00, a4, 0x4200E000, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s0_151, out s1_122, out a0_14, out a1_152, out a2_153, out a3_154, out a4_155, out a5_156, out a7_157, out s2_127, out s3_128, out s4_158, out s5_159, out s6_160, out s8_161);
	if (a0_14 != 0x01 && ((word32) g_b4201FC5C <= 0x04 && (word32) g_b4201FC63 <= 0x04))
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_163;
			xTaskGetTickCountFromISR(out a5_163);
		}
		else
		{
			word32 a5_162;
			xTaskGetTickCount(out a5_162);
		}
		word32 a0_164;
		word32 a1_165;
		word32 a2_166;
		word32 a3_167;
		word32 a4_168;
		word32 a5_169;
		word32 s4_170;
		word32 s5_171;
		word32 s6_172;
		word32 s7_173;
		word32 s8_174;
		word32 s9_175;
		word32 s10_176;
		word32 s11_177;
		ra = bl_printk(ra, &g_t230843DC, 0x23084408, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_122, out a0_164, out a1_165, out a2_166, out a3_167, out a4_168, out a5_169, out s2_127, out s3_128, out s4_170, out s5_171, out s6_172, out s7_173, out s8_174, out s9_175, out s10_176, out s11_177);
	}
	s1Out = s1_122;
	s2Out = s2_127;
	s3Out = s3_128;
	return ra;
}

// 230355D0: void bl_sha_init(Register Eq_2 ra, Register Eq_2 a0, Register ui32 a1, Register (ptr32 word32) a5, Stack word32 dwArg94)
// Called from:
//      utils_hmac_sha1_fast
void bl_sha_init(Eq_2 ra, Eq_2 a0, ui32 a1, word32 * a5, word32 dwArg94)
{
	word32 * a5_18 = Sec_Eng_SHA256_Init(ra, a0, a1, a5, ra, dwArg94);
	Sec_Eng_SHA_Start(a5_18);
}

// 230355EE: Register word32 bl_sha_update(Register (ptr32 Eq_168956) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s5, Stack word32 dwArg98, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      utils_hmac_sha1_fast
word32 bl_sha_update(struct Eq_168956 * a0, Eq_2 a1, Eq_2 a2, Eq_2 s5, word32 dwArg98, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	ptr32 a1_14;
	ptr32 a4_17;
	word32 s0_21;
	ptr32 s2_23;
	ptr32 s3_24;
	ptr32 s4_25;
	ptr32 s5_26;
	word32 s1_43;
	word32 a0_44;
	word32 s6_45;
	Sec_Eng_SHA256_Update(a0, a1, a2, s5, dwArg98, out s0_21, out s1_43, out a0_44, out a1_14, out a4_17, out s2_23, out s3_24, out s4_25, out s5_26, out s6_45);
	a1Out = a1_14;
	a2Out = dwArg10;
	a4Out = a4_17;
	s2Out = s2_23;
	s3Out = s3_24;
	s4Out = s4_25;
	s5Out = s5_26;
	return s0_21;
}

