pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23035602: Register word32 bl_sha_finish(Register Eq_2 a1, Register (ptr32 ui32) a4, Register Eq_2 s5, Stack word32 dwArg78, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      utils_hmac_sha1_fast
word32 bl_sha_finish(Eq_2 a1, ui32 * a4, Eq_2 s5, word32 dwArg78, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 s0_19;
	ptr32 s1_20;
	ptr32 s2_21;
	ptr32 s4_23;
	ptr32 s5_24;
	ptr32 s6_25;
	word32 ra_18 = Sec_Eng_SHA256_Finish(a1, a4, s5, dwArg78, out s0_19, out s1_20, out s2_21, out s4_23, out s5_24, out s6_25);
	s0Out = s0_19;
	s1Out = s1_20;
	s2Out = s2_21;
	s4Out = s4_23;
	s5Out = s5_24;
	s6Out = s6_25;
	return ra_18;
}

// 23035614: void sha256_test_case0(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Stack word32 dwArg18, Stack word32 dwArg48)
// Called from:
//      bl_sec_sha_test
void sha256_test_case0(Eq_2 ra, Eq_2 s1, Eq_2 s2, word32 dwArg18, word32 dwArg48)
{
	struct Eq_169049 * s3_52;
	word32 a3_311;
	word32 a2_310;
	word32 a5_313;
	word32 s2_316;
	word32 a3_315;
	word32 s1_314;
	word32 a1_309;
	word32 s4_317;
	word32 s6_318;
	word32 a4_312;
	word32 t1_307;
	word32 a0_308;
	Eq_2 ra_46 = bl_irq_register(memset(ra, fp + -220, 0x00, 188, out t1_307, out a0_308, out a1_309, out a2_310, out a3_311, out a4_312, out a5_313), s1, 0x1E, 0x230354BE, s2, dwLocD8, dwLocB8, dwLocA0, dwLoc9C, dwLoc90, dwLoc8C, dwLoc70, dwLoc6C, dwLoc68, 0x50020000, dwLoc48, dwLoc44, dwLoc24, out s1_314, out a3_315, out s2_316, out s3_52, out s4_317, out s6_318);
	Sec_Eng_SHA_Enable_Link(bl_irq_enable((struct Eq_160476 *) 0x1E));
	struct Eq_275368 ** a4_96;
	word32 s2_322;
	word32 s3_323;
	word32 s0_319;
	word32 s1_320;
	word32 a1_321;
	Sec_Eng_SHA256_Link_Update(fp + -220, null, &g_t230844BC, (struct Eq_169049 *) 64, Sec_Eng_SHA256_Link_Init(ra_46, fp + -220, fp + -200, dwLoc5C, dwLoc3C), s3_52, dwArg48, out s0_319, out s1_320, out a1_321, out a4_96, out s2_322, out s3_323);
	word32 * a5_114;
	Eq_2 ra_116 = Sec_Eng_SHA256_Link_Finish(fp + -220, null, fp + -0x00C0, a4_96, dwArg18, dwArg48, out a5_114);
	Sec_Eng_SHA_Disable_Link(a5_114);
	struct Eq_169176 * s0_128 = fp + -220;
	word32 a5_129 = 0x00;
	int32 s1_130 = 0x00;
	ptr32 s2_131 = 587744412;
	word32 s5_133 = 0x23084000;
	int32 s3_134 = 32;
	do
	{
		Eq_2 a3_139 = (word32) (s2_131 + s1_130);
		if (a3_139 != (word32) s0_128[28])
		{
			word32 s10_334;
			word32 s11_335;
			word32 s7_331;
			word32 s8_332;
			word32 s9_333;
			word32 a5_328;
			word32 s4_329;
			word32 s6_330;
			word32 a1_325;
			word32 a2_326;
			word32 a4_327;
			word32 a0_324;
			ra_116 = bl_printk(ra_116, s5_133 + 0x0444, a3_139, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, dwLoc48, dwLoc24, out s1_130, out a0_324, out a1_325, out a2_326, out a3_139, out a4_327, out a5_328, out s2_131, out s3_134, out s4_329, out s5_133, out s6_330, out s7_331, out s8_332, out s9_333, out s10_334, out s11_335);
			a5_129 = 0x01;
		}
		++s1_130;
		++s0_128;
	} while (s1_130 != s3_134);
	struct Eq_274 * a0_182;
	if (a5_129 != 0x00)
		a0_182 = (struct Eq_274 *) &g_t2308445C;
	else
		a0_182 = (struct Eq_274 *) &g_t2308447C;
	word32 s3_344;
	word32 s4_345;
	word32 a5_342;
	word32 s2_343;
	word32 a3_340;
	word32 a4_341;
	word32 a1_338;
	word32 a2_339;
	word32 s1_336;
	word32 a0_337;
	word32 s5_346;
	word32 s6_347;
	word32 s7_348;
	word32 s8_349;
	word32 s9_350;
	word32 s10_351;
	word32 s11_352;
	bl_printk(ra_116, a0_182, a3_139, dwLocD8, dwLocB8, dwLoc70, dwLoc6C, dwLoc48, dwLoc24, out s1_336, out a0_337, out a1_338, out a2_339, out a3_340, out a4_341, out a5_342, out s2_343, out s3_344, out s4_345, out s5_346, out s6_347, out s7_348, out s8_349, out s9_350, out s10_351, out s11_352);
}

// 230356FA: void bl_sec_sha_test(Register Eq_2 ra, Register Eq_2 s2, Stack word32 dwArg08, Stack word32 dwArg38)
// Called from:
//      cmd_sha
void bl_sec_sha_test(Eq_2 ra, Eq_2 s2, word32 dwArg08, word32 dwArg38)
{
	word32 a0_78;
	word32 a1_79;
	word32 a2_80;
	word32 a4_81;
	word32 a5_82;
	word32 s4_83;
	word32 s8_84;
	puts(0x230842AC, out a0_78, out a1_79, out a2_80, out a4_81, out a5_82, out s4_83, out s8_84);
	word32 a0_85;
	word32 a1_86;
	word32 a2_87;
	word32 a4_88;
	word32 a5_89;
	word32 s4_90;
	word32 s8_91;
	sha256_test_case0(ra, puts(0x23084384, out a0_85, out a1_86, out a2_87, out a4_88, out a5_89, out s4_90, out s8_91), s2, dwArg08, dwArg38);
	word32 a0_92;
	word32 a1_93;
	word32 a2_94;
	word32 a4_95;
	word32 a5_96;
	word32 s4_97;
	word32 s8_98;
	puts(587720636, out a0_92, out a1_93, out a2_94, out a4_95, out a5_96, out s4_97, out s8_98);
}

// 2303572E: void bl_wifi_clock_enable(Register (ptr32 Eq_2) a4)
// Called from:
//      bl606a0_wifi_init
void bl_wifi_clock_enable(union Eq_2 * a4)
{
	Eq_2 a5_6 = *a4;
	if (a4 == null)
		*(union Eq_2 *) 0x01 = a5_6;
}

// 23035742: Register Eq_2 bl_wifi_enable_irq(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Stack Eq_2 dwArg18, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgAC, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s3Out)
// Called from:
//      bl_main_rtthread_start
Eq_2 bl_wifi_enable_irq(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 dwArg18, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgAC, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s3Out)
{
	Eq_2 s1_21;
	Eq_2 s2_24;
	ptr32 a3_41;
	ptr32 s3_52;
	word32 a3_102;
	word32 s3_103;
	word32 s4_104;
	word32 s6_105;
	word32 s1_106;
	word32 s2_107;
	word32 s4_108;
	word32 s6_109;
	Eq_2 ra_46 = bl_irq_register(bl_irq_register(ra, s1, 70, 587304788, s2, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC, out s1_21, out a3_102, out s2_24, out s3_103, out s4_104, out s6_105), s1_21, 79, 587304868, s2_24, dwLoc08, dwArg18, dwArg30, dwArg34, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg7C, dwArg88, dwArg8C, dwArgAC, out s1_106, out a3_41, out s2_107, out s3_52, out s4_108, out s6_109);
	bl_irq_enable((struct Eq_160476 *) 70);
	bl_irq_enable((struct Eq_160476 *) 79);
	ptr32 a5_72;
	ptr32 a4_75;
	word32 a0_110;
	word32 a1_111;
	word32 a2_112;
	word32 s4_113;
	word32 s8_114;
	puts(587744528, out a0_110, out a1_111, out a2_112, out a4_75, out a5_72, out s4_113, out s8_114);
	a3Out = a3_41;
	a4Out = a4_75;
	a5Out = a5_72;
	s3Out = s3_52;
	return ra_46;
}

// 2303578A: void bl_wifi_sta_mac_addr_set(Register Eq_2 a0)
// Called from:
//      hal_board_cfg
void bl_wifi_sta_mac_addr_set(Eq_2 a0)
{
	word32 a1_29;
	word32 a2_30;
	word32 a3_31;
	word32 a4_32;
	word32 a5_33;
	word32 a6_34;
	word32 a7_35;
	memcpy(1107426404, a0, 0x06, out a1_29, out a2_30, out a3_31, out a4_32, out a5_33, out a6_34, out a7_35);
}

// 230357A6: void bl_wifi_ap_mac_addr_set(Register Eq_2 a0)
// Called from:
//      hal_board_cfg
void bl_wifi_ap_mac_addr_set(Eq_2 a0)
{
	word32 a1_29;
	word32 a2_30;
	word32 a3_31;
	word32 a4_32;
	word32 a5_33;
	word32 a6_34;
	word32 a7_35;
	memcpy(1107426416, a0, 0x06, out a1_29, out a2_30, out a3_31, out a4_32, out a5_33, out a6_34, out a7_35);
}

// 230357C2: void bl_wifi_mac_addr_get(Register Eq_2 a0)
// Called from:
//      cmd_wifi_ap_start
//      wifi_mgmr_sta_enable
//      wifi_mgmr_ap_enable
//      bl606a0_wifi_init
void bl_wifi_mac_addr_get(Eq_2 a0)
{
	word32 a1_28;
	word32 a2_29;
	word32 a3_30;
	word32 a4_31;
	word32 a5_32;
	word32 a6_33;
	word32 a7_34;
	memcpy(a0, 1107426404, 0x06, out a1_28, out a2_29, out a3_30, out a4_31, out a5_32, out a6_33, out a7_34);
}

// 230357DC: Register word32 bl_wifi_country_code_set(Register ui32 a0)
// Called from:
//      hal_board_cfg
word32 bl_wifi_country_code_set(ui32 a0)
{
	g_b42020C7C = (byte) a0;
	return 0x42020000;
}

// 230357E8: Register Eq_2 bl_wifi_ap_info_set(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 s2Out)
// Called from:
//      hal_board_cfg
Eq_2 bl_wifi_ap_info_set(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & s2Out)
{
	word32 t1_99;
	word32 a0_100;
	word32 a1_101;
	word32 a2_102;
	word32 a3_103;
	word32 a4_104;
	word32 a5_105;
	Eq_2 ra_34 = memset(ra, 1107426429, 0x00, 99, out t1_99, out a0_100, out a1_101, out a2_102, out a3_103, out a4_104, out a5_105);
	Eq_2 a3_45;
	word32 a1_106;
	word32 a2_107;
	word32 a4_108;
	word32 a5_109;
	word32 a6_110;
	word32 a7_111;
	memcpy(1107426429, a0, a1, out a1_106, out a2_107, out a3_45, out a4_108, out a5_109, out a6_110, out a7_111);
	word32 a4_58;
	word32 a1_112;
	word32 a2_113;
	word32 a3_114;
	word32 a5_115;
	word32 a6_116;
	word32 a7_117;
	memcpy(1107426462, a2, a3_45, out a1_112, out a2_113, out a3_114, out a4_58, out a5_115, out a6_116, out a7_117);
	g_b4201FCDF = (byte) a4_58;
	g_b4201FCE0 = 0x01;
	0x00 = (uint16) dwArg0128;
	s1Out = a2;
	s2Out = a0;
	return ra_34;
}

// 23035852: Register Eq_2 bl_wifi_sta_info_set(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out Eq_2 s2Out)
// Called from:
//      hal_board_cfg
Eq_2 bl_wifi_sta_info_set(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 dwArg0128, union Eq_2 & s1Out, union Eq_2 & s2Out)
{
	word32 t1_96;
	word32 a0_97;
	word32 a1_98;
	word32 a2_99;
	word32 a3_100;
	word32 a4_101;
	word32 a5_102;
	Eq_2 ra_34 = memset(ra, 0x4201FCE1, 0x00, 99, out t1_96, out a0_97, out a1_98, out a2_99, out a3_100, out a4_101, out a5_102);
	Eq_2 a3_45;
	word32 a1_103;
	word32 a2_104;
	word32 a4_105;
	word32 a5_106;
	word32 a6_107;
	word32 a7_108;
	memcpy(0x4201FCE1, a0, a1, out a1_103, out a2_104, out a3_45, out a4_105, out a5_106, out a6_107, out a7_108);
	word32 a4_58;
	word32 a1_109;
	word32 a2_110;
	word32 a3_111;
	word32 a5_112;
	word32 a6_113;
	word32 a7_114;
	memcpy(0x4201FD02, a2, a3_45, out a1_109, out a2_110, out a3_111, out a4_58, out a5_112, out a6_113, out a7_114);
	g_b42020D44 = (byte) a4_58;
	0x00 = (uint16) dwArg0128;
	s1Out = a2;
	s2Out = a0;
	return ra_34;
}

// 230358B2: Register Eq_2 bl_wifi_sta_info_get(Register Eq_2 a0, Register out ptr32 a3Out)
// Called from:
//      check_dts_config
Eq_2 bl_wifi_sta_info_get(Eq_2 a0, ptr32 & a3Out)
{
	if ((word32) g_b4201FD44 != 0x01)
	{
		a3Out = a3;
		return ~0x00;
	}
	else
	{
		ptr32 a3_20;
		word32 a1_60;
		word32 a2_61;
		word32 a4_62;
		word32 a5_63;
		word32 a6_64;
		word32 a7_65;
		memcpy(a0, 0x4201FCE1, 99, out a1_60, out a2_61, out a3_20, out a4_62, out a5_63, out a6_64, out a7_65);
		a3Out = a3_20;
		return 0x00;
	}
}

