pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 230358E0: void cmd_timer_start(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C)
void cmd_timer_start(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg8C)
{
	bl_timer_tick_enable(ra, s1, s2, dwArg10, dwArg14, dwArg20, dwArg24, dwArg40, dwArg44, dwArg48, dwArg5C, dwArg68, dwArg6C, dwArg8C);
}

// 230358E4: void cmd_wdt_disable()
void cmd_wdt_disable()
{
	bl_wdt_disable();
}

// 230358E8: void cmd_wdt_feed()
void cmd_wdt_feed()
{
	bl_wdt_feed();
}

// 230358EC: void cmd_wdt_init(Register Eq_2 ra, Register Eq_2 a0, Register word32 a2, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgBC)
void cmd_wdt_init(Eq_2 ra, Eq_2 a0, word32 a2, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgBC)
{
	if (a2 == 0x02)
	{
		word32 a5_232;
		word32 a4_231;
		word32 a3_230;
		word32 a2_229;
		word32 a1_228;
		Eq_2 a0_23 = atoi(a0, out a1_228, out a2_229, out a3_230, out a4_231, out a5_232);
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_253;
			xTaskGetTickCountFromISR(out a5_253);
		}
		else
		{
			word32 a5_252;
			xTaskGetTickCount(out a5_252);
		}
		word32 s1_254;
		word32 a0_255;
		word32 a1_256;
		word32 a2_257;
		word32 a3_258;
		word32 a4_259;
		word32 a5_260;
		word32 s2_261;
		word32 s3_262;
		word32 s4_263;
		word32 s5_264;
		word32 s6_265;
		word32 s7_266;
		word32 s8_267;
		word32 s9_268;
		word32 s10_269;
		word32 s11_270;
		bl_printk(ra, &g_t23084558, 587744548, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_254, out a0_255, out a1_256, out a2_257, out a3_258, out a4_259, out a5_260, out s2_261, out s3_262, out s4_263, out s5_264, out s6_265, out s7_266, out s8_267, out s9_268, out s10_269, out s11_270);
		if (a0_23 <= 0x00)
			return;
		bl_wdt_init(a0_23);
	}
	else
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_234;
			xTaskGetTickCountFromISR(out a5_234);
		}
		else
		{
			word32 a5_233;
			xTaskGetTickCount(out a5_233);
		}
		word32 s1_235;
		word32 a0_236;
		word32 a1_237;
		word32 a2_238;
		word32 a3_239;
		word32 a4_240;
		word32 a5_241;
		word32 s2_242;
		word32 s3_243;
		word32 s4_244;
		word32 s5_245;
		word32 s6_246;
		word32 s7_247;
		word32 s8_248;
		word32 s9_249;
		word32 s10_250;
		word32 s11_251;
		bl_printk(ra, &g_t23084534, 587744548, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_235, out a0_236, out a1_237, out a2_238, out a3_239, out a4_240, out a5_241, out s2_242, out s3_243, out s4_244, out s5_245, out s6_246, out s7_247, out s8_248, out s9_249, out s10_250, out s11_251);
	}
}

// 2303599C: void bl_wdt_cli_init()
// Called from:
//      aos_loop_proc
void bl_wdt_cli_init()
{
}

// 230359A0: Register Eq_2 fdt32_to_cpu(Register Eq_2 a0)
// Called from:
//      vfs_uart_init
Eq_2 fdt32_to_cpu(Eq_2 a0)
{
	return (a0 >> 16 & 0x00FF) << 8 | ((a0 << 0x18 | a0 >> 0x18) | (a0 >> 0x08 & 0x00FF) << 16);
}

// 230359C2: Register Eq_2 dev_uart_init(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s4Out, Register out ptr32 s9Out)
// Called from:
//      vfs_uart_init
Eq_2 dev_uart_init(Eq_2 ra, Eq_2 a0, word32 a1, word32 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s4Out, ptr32 & s9Out)
{
	ptr32 a5_247;
	Eq_2 s1_109;
	struct Eq_274 * a0_278;
	if (a0 <= 0x02 && a1 != 0x00)
	{
		Eq_2 a5_30;
		s1_109 = a0;
		if (a0 != 0x00)
		{
			if (a0 != 0x01)
			{
				a5_247 = 0x04;
				if ((word32) g_b4201FC5C > 0x04 || (word32) g_b4201FD46 > 0x04)
					goto l23035AC0;
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_758;
					xTaskGetTickCountFromISR(out a5_758);
				}
				else
				{
					word32 a5_757;
					xTaskGetTickCount(out a5_757);
				}
				a0_278 = (struct Eq_274 *) &g_t2308462C;
l23035ABC:
				word32 a0_720;
				word32 s7_729;
				word32 s3_725;
				word32 a1_721;
				word32 s4_726;
				word32 s8_730;
				word32 a4_724;
				word32 s5_727;
				word32 s6_728;
				word32 s10_731;
				word32 a3_723;
				word32 s11_732;
				word32 a2_722;
				ra = bl_printk(ra, a0_278, 587744768, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_109, out a0_720, out a1_721, out a2_722, out a3_723, out a4_724, out a5_247, out s2, out s3_725, out s4_726, out s5_727, out s6_728, out s7_729, out s8_730, out s9, out s10_731, out s11_732);
				goto l23035AC0;
			}
			a5_30 = g_t4200DEC4;
		}
		else
			a5_30 = g_t4200DEC0;
		if (a5_30 != 0x00)
		{
			a5_247 = 0x04;
			if ((word32) g_b4201FC5C <= 0x04 && (word32) g_b4201FD46 <= 0x04)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_743;
					xTaskGetTickCountFromISR(out a5_743);
				}
				else
				{
					word32 a5_742;
					xTaskGetTickCount(out a5_742);
				}
				goto l23035A0A;
			}
			goto l23035AC0;
		}
		Eq_2 a0_67;
		word32 a1_733;
		word32 s4_740;
		word32 a2_734;
		word32 a3_735;
		word32 a5_737;
		word32 a4_736;
		word32 s3_739;
		word32 s8_741;
		word32 a6_738;
		*a0_67 = pvPortMalloc(ra, a0, 60, a3, a4, a5_30, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_109, out a0_67, out a1_733, out a2_734, out a3_735, out a4_736, out a5_737, out a6_738, out s2, out s3_739, out s4_740, out s8_741);
		if (a0_67 == 0x00)
		{
			a5_247 = 0x04;
			if ((word32) g_b4201FC5C <= 0x04 && (word32) g_b4201FD46 <= 0x04)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_756;
					xTaskGetTickCountFromISR(out a5_756);
				}
				else
				{
					word32 a5_755;
					xTaskGetTickCount(out a5_755);
				}
				goto l23035B28;
			}
		}
		else
		{
			Eq_2 a3_88;
			Eq_2 a4_89;
			Eq_2 a5_90;
			word32 t1_744;
			word32 a1_746;
			word32 a0_745;
			word32 a2_747;
			ra = memset(ra, a0_67, 0x00, 60, out t1_744, out a0_745, out a1_746, out a2_747, out a3_88, out a4_89, out a5_90);
			((word32) a5_90 + 52)->u1 = 0x02;
			struct Eq_169996 ** s0_98 = *a5_90;
			((word32) a5_90 + 56)->u0 = 0x00;
			struct Eq_169996 * s6_100 = *s0_98;
			Eq_2 a0_101;
			word32 s4_112;
			word32 a3_750;
			word32 a1_748;
			word32 a2_749;
			word32 a6_753;
			word32 a4_751;
			word32 a5_752;
			word32 s8_754;
			Eq_2 s3_111;
			pvPortMalloc(ra, s1_109, 0x04, a3_88, a4_89, a5_90, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_109, out a0_101, out a1_748, out a2_749, out a3_750, out a4_751, out a5_752, out a6_753, out s2, out s3_111, out s4_112, out s8_754);
			s6_100->t0038 = a0_101;
			if (a0_101 != 0x00)
			{
				Eq_2 a5_141;
				Eq_2 a4_144;
				word32 a4_125;
				struct Eq_170074 * a5_126;
				word32 t1_759;
				word32 a1_761;
				word32 a0_760;
				word32 a2_762;
				Eq_2 a3_124;
				Eq_2 ra_127 = memset(ra, a0_101, 0x00, 0x04, out t1_759, out a0_760, out a1_761, out a2_762, out a3_124, out a4_125, out a5_126);
				a5_126->dw0018 = a2;
				a5_126->dw001C = s4_112;
				if (a5_126 == null)
				{
					a4_144 = (word32) g_b4201FC5C;
					a5_141.u0 = 0x04;
					if (a4_144 <= 0x04)
					{
						a4_144 = (word32) g_b4201FD46;
						if (a4_144 <= 0x04)
						{
							if (g_t4200DE84 != 0x00)
							{
								word32 a5_766;
								xTaskGetTickCountFromISR(out a5_766);
							}
							else
							{
								word32 a5_765;
								xTaskGetTickCount(out a5_765);
							}
							word32 s4_772;
							word32 s10_777;
							word32 s11_778;
							word32 s8_776;
							word32 s5_773;
							word32 s7_775;
							word32 s6_774;
							word32 a0_768;
							word32 a2_770;
							word32 s2_771;
							word32 a1_769;
							word32 s1_767;
							ra_127 = bl_printk(ra_127, &g_t23084648, 587744768, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_767, out a0_768, out a1_769, out a2_770, out a3_124, out a4_144, out a5_141, out s2_771, out s3_111, out s4_772, out s5_773, out s6_774, out s7_775, out s8_776, out s9, out s10_777, out s11_778);
						}
					}
				}
				else
				{
					a5_126->b0000 = (byte) s1_109;
					a5_126->b0034 = (byte) s2;
					*(word32 *) 0x1C000204 = a4_125;
					*(byte *) 0x1C000208 = 0x03;
					*(byte *) 0x1C000209 = 0x00;
					*(byte *) 0x1C00020A = 0x00;
					*(byte *) 0x1C00020B = 0x00;
					*(byte *) 0x1C00020C = (byte) s2;
					a5_141.u0 = 0x1C000200;
					a4_144.u0 = 0x03;
				}
				0x00 = (uint16) dwArgA8;
				ptr32 a0_221;
				ptr32 a5_226;
				Eq_2 s0_228;
				Eq_2 s1_229;
				Eq_2 s2_230;
				ptr32 s4_232;
				word32 s6_779;
				Eq_2 ra_244 = aos_register_driver(ra_127, s3_111, dwArg48, a3_124, a4_144, a5_141, mstatus, dwArg74, dwArgB4, dwArgE8, dwArg0128, dwArg0168, out s0_228, out s1_229, out a0_221, out a5_226, out s2_230, out s4_232, out s6_779);
				s0Out = s0_228;
				s1Out = s1_229;
				a0Out = a0_221;
				a5Out = a5_226;
				s2Out = s2_230;
				s4Out = s4_232;
				s9Out = s9;
				return ra_244;
			}
			a5_247 = 0x04;
			if ((word32) g_b4201FC5C <= 0x04 && (word32) g_b4201FD46 <= 0x04)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_764;
					xTaskGetTickCountFromISR(out a5_764);
				}
				else
				{
					word32 a5_763;
					xTaskGetTickCount(out a5_763);
				}
l23035B28:
				a0_278 = (struct Eq_274 *) &g_t23084648;
				goto l23035ABC;
			}
		}
	}
	else
	{
		a5_247 = 0x04;
		s1_109 = s1;
		if ((word32) g_b4201FC5C > 0x04)
			goto l23035AC0;
		s1_109 = s1;
		if ((word32) g_b4201FD46 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_719;
				xTaskGetTickCountFromISR(out a5_719);
			}
			else
			{
				word32 a5_718;
				xTaskGetTickCount(out a5_718);
			}
l23035A0A:
			a0_278 = (struct Eq_274 *) &g_t2308460C;
			goto l23035ABC;
		}
	}
l23035AC0:
	0x00 = (uint16) dwArgA8;
	s0Out = s1;
	s1Out = s1_109;
	a0Out = ~0x00;
	a5Out = a5_247;
	s2Out = s2;
	s4Out = dwArg04;
	s9Out = s9;
	return ra;
}

// 23035C6A: void hal_uart_send_trigger(Register Eq_2 a4)
// Called from:
//      vfs_uart_write
void hal_uart_send_trigger(Eq_2 a4)
{
	bl_uart_int_tx_enable(a4);
}

// 23035C7E: void hal_uart_send_trigger_off(Register Eq_2 a4)
// Called from:
//      __uart_tx_irq
void hal_uart_send_trigger_off(Eq_2 a4)
{
	bl_uart_int_tx_disable(a4);
}

// 23035C92: void hal_uart_init(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s2, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg8C)
// Called from:
//      vfs_uart_open
void hal_uart_init(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a4, Eq_2 s2, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg5C, Eq_2 dwArg8C)
{
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 a0_12 = *((word32) a0 + 56);
	Eq_2 stackArg0 = <invalid>;
	Eq_2 stackArg4 = <invalid>;
	Eq_2 stackArg132 = <invalid>;
	Eq_2 stackArg248 = <invalid>;
	Eq_2 stackArg312 = <invalid>;
	Eq_2 stackArg376 = <invalid>;
	word32 a0_162;
	word32 a3_163;
	word32 a4_164;
	aos_mutex_new(ra, a0, a3, a4, a5, mstatus, stackArg0, stackArg4, stackArg132, stackArg248, stackArg312, stackArg376, out a0_162, out a3_163, out a4_164);
	byte bLoc11_74 = SLICE(s0, byte, 24);
	if (a0_12 == 0x00)
	{
		bl_uart_getdefconfig(fp + ~0x10);
		word32 a5_17 = (word32) bLoc11_74;
		if (a5_17 == 0x00)
			((word32) a0 + 9)->u1 = 0x00;
		else
		{
			a4.u0 = 0x01;
			if (a5_17 != 0x01)
				a5_17 = 0x02;
			((word32) a0 + 9)->u1 = (byte) a5_17;
		}
		bl_uart_int_enable(ra, a0_12, (word32) *a0, a4, s2, dwLoc08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg40, dwArg44, dwArg48, dwArg5C, s1, ra, dwArg8C);
	}
}

// 23035CE2: Register (ptr32 Eq_140435) hal_uart_recv_II(Register (ptr32 byte) a0, Register ptr32 a1, Register (ptr32 Eq_140435) a2, Register (ptr32 Eq_140435) a3, Stack (ptr32 Eq_140435) dwArg84, Register out ptr32 a0Out, Register out (ptr32 Eq_140435) a2Out, Register out ptr32 a4Out, Register out (ptr32 byte) a5Out, Register out ptr32 s4Out, Register out (ptr32 Eq_140435) s8Out)
// Called from:
//      cli_getchar
//      __uart_rx_irq
struct Eq_140435 * hal_uart_recv_II(byte * a0, ptr32 a1, struct Eq_140435 * a2, struct Eq_140435 * a3, struct Eq_140435 * dwArg84, ptr32 & a0Out, struct Eq_140435 & a2Out, ptr32 & a4Out, byte & a5Out, ptr32 & s4Out, struct Eq_140435 & s8Out)
{
	struct Eq_140435 * s0_12 = null;
	while (s0_12 != a2)
	{
		dwLoc1C = a2;
		int32 a0_24 = bl_uart_data_recv(s0_12, (word32) *a0, out a4, out a5);
		s0_12 = a3;
		a2 = dwArg84;
		if (a0_24 < 0x00)
			break;
		a5 = (byte *) (a3 + a1 / 141);
		*a5 = (byte) a0_24;
		s0_12 = (struct Eq_140435 *) ((char *) &a3->ptr0000 + 1);
	}
	s0_12->ptr0000 = a3;
	a0Out = 0x00;
	a2Out = a2;
	a4Out = a4;
	a5Out = a5;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s0_12;
}

// 23035D24: void hal_uart_send(Register (ptr32 byte) a0, Register Eq_2 a1, Register word32 a2, Stack word32 dwArg38)
// Called from:
//      __uart_tx_irq
void hal_uart_send(byte * a0, Eq_2 a1, word32 a2, word32 dwArg38)
{
	Eq_2 s0_15 = a1;
	Eq_2 s1_17 = (word32) a1 + a2;
	while (s0_15 != s1_17)
	{
		word32 a0_61;
		word32 a4_62;
		word32 a5_63;
		word32 s4_64;
		word32 s8_65;
		s0_15 = bl_uart_data_send(s1_17, (word32) *a0, (word32) *s0_15, out a0_61, out a4_62, out a5_63, out s4_64, out s8_65);
	}
	0x00 = dwArg38;
}

// 23035D58: void hal_uart_finalize(Register Eq_2 ra, Register (ptr32 Eq_170399) s0, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 s2, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg7C)
// Called from:
//      vfs_uart_close
void hal_uart_finalize(Eq_2 ra, struct Eq_170399 * s0, Eq_2 s1, Eq_2 a4, Eq_2 s2, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg7C)
{
	bl_uart_int_disable(ra, s1, (word32) *s0->ptr0038, a4, s2, dwArg20, dwArg24, dwArg30, dwArg34, dwArg58, dwArg6C, dwArg7C);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg344 = <invalid>;
	Eq_2 stackArg408 = <invalid>;
	word32 a0_57;
	word32 a2_58;
	word32 a4_59;
	word32 a5_60;
	aos_mutex_free(a0, a3, a4, mstatus, stackArg344, stackArg408, out a0_57, out a2_58, out a4_59, out a5_60);
}

