pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23035D78: Register word32 hal_uart_notify_register(Register Eq_2 a0, Register word32 a1, Register (ptr32 Eq_160614) a2)
// Called from:
//      vfs_uart_open
word32 hal_uart_notify_register(Eq_2 a0, word32 a1, struct Eq_160614 * a2)
{
	if (a1 != 0x00)
	{
		if (a1 != 0x01)
			return a1;
		bl_uart_int_rx_notify_register((word32) *a0, a2, a0);
		return a1;
	}
	else
	{
		bl_uart_int_tx_notify_register((word32) *a0, a2, a0);
		return a1;
	}
}

// 23035DAA: Register Eq_2 vfs_uart_init(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0134, Register out Eq_2 s2Out, Register out Eq_2 s6Out, Register out (ptr32 Eq_2) s9Out, Register out ptr32 s10Out)
// Called from:
//      aos_loop_proc
Eq_2 vfs_uart_init(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArg0118, Eq_2 dwArg0134, union Eq_2 & s2Out, union Eq_2 & s6Out, union Eq_2 & s9Out, ptr32 & s10Out)
{
	byte bLoc68_2953 = (byte) s2;
	if ((int32) g_b4200DEC8 == 0x01)
	{
l23035F0E:
		ptr32 s10_1539 = *((word32) dwArg0118 + 0x0C);
		Eq_2 s6_1540 = *((word32) dwArg0118 + 44);
		s2Out = *((word32) dwArg0118 + 76);
		s6Out = s6_1540;
		s9Out = s9;
		s10Out = s10_1539;
		return ra;
	}
	word32 a6_3251;
	word32 a5_3250;
	word32 a1_3246;
	word32 a4_3249;
	word32 a2_3247;
	word32 a3_3248;
	word32 a7_3252;
	memcpy(fp + -112, 587744720, 48, out a1_3246, out a2_3247, out a3_3248, out a4_3249, out a5_3250, out a6_3251, out a7_3252);
	Eq_2 s4_119 = a0;
	struct Eq_170509 * a5_1522 = fp + -0x0078;
	Eq_2 s2_1525 = 0x00;
l23035E14:
	word32 a5_1217;
	struct Eq_274 * a0_1383;
	Eq_2 a3_1380;
	Eq_2 s6_76 = a5_1522->b0000;
	int32 a0_81;
	struct Eq_170541 * s1_91;
	word32 a5_3282;
	word32 s5_3284;
	word32 s6_3285;
	word32 s3_3283;
	word32 s0_1457;
	Eq_2 s2_117;
	ra = fdt_subnode_offset(ra, 0x42020000, s4_119, s6_76, s2_1525, s6_76, dwLocB8, dwLoc88, dwArg28, out s0_1457, out s1_91, out a0_81, out a5_3282, out s2_117, out s3_3283, out s4_119, out s5_3284, out s6_3285);
	if (a0_81 <= 0x00)
	{
		a5_1217 = 0x02;
		if ((word32) s1_91->bFFFFFC5C > 0x02 || (word32) g_b4201FD46 > 0x02)
			goto l23035EFE;
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_3258;
			xTaskGetTickCountFromISR(out a5_3258);
		}
		else
		{
			word32 a5_3257;
			xTaskGetTickCount(out a5_3257);
		}
l23035E5A:
		a3_1380 = s0_1457 + 0x0600;
		a0_1383 = (struct Eq_274 *) &g_t230846A8;
		goto l23035ECE;
	}
	word32 a0_106;
	word32 s0_115;
	struct Eq_170516 * s1_116;
	word32 s3_3253;
	word32 s5_3254;
	word32 s6_3255;
	word32 s8_3256;
	ra = fdt_stringlist_count(ra, s4_119, 587744976, s2_117, dwLocB8, 0x23084688, dwLoc08, dwArg28, out s0_115, out s1_116, out a0_106, out s2_117, out s3_3253, out s4_119, out s5_3254, out s6_3255, out s8_3256);
	if (a0_106 != 0x01)
	{
		a5_1217 = 0x02;
		if ((word32) s1_116->bFFFFFC5C <= 0x02 && (word32) g_b4201FD46 <= 0x02)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_3281;
				xTaskGetTickCountFromISR(out a5_3281);
			}
			else
			{
				word32 a5_3280;
				xTaskGetTickCount(out a5_3280);
			}
			a3_1380 = s0_115 + 0x0600;
			a0_1383 = (struct Eq_274 *) &g_t230846D8;
			goto l23035ECE;
		}
		goto l23035EFE;
	}
	Eq_2 a0_133;
	word32 a4_137;
	word32 s0_142;
	struct Eq_170616 * s1_143;
	word32 s8_3279;
	word32 s6_3278;
	word32 a1_3272;
	word32 s3_3276;
	word32 a2_3273;
	word32 a3_3274;
	word32 a5_3275;
	word32 s5_3277;
	ra = fdt_stringlist_get(ra, s4_119, 587744976, dwLocAC, dwLoc18, s1, dwArg68, out s0_142, out s1_143, out a0_133, out a1_3272, out a2_3273, out a3_3274, out a4_137, out a5_3275, out s2_117, out s3_3276, out s4_119, out s5_3277, out s6_3278, out s8_3279);
	if (a4_137 != 0x04)
	{
l23035EF4:
		a5_1217 = 0x02;
		if ((word32) s1_143->bFFFFFC5C > 0x02 || (word32) g_b4201FD46 > 0x02)
			goto l23035EFE;
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_3305;
			xTaskGetTickCountFromISR(out a5_3305);
		}
		else
		{
			word32 a5_3304;
			xTaskGetTickCount(out a5_3304);
		}
		a3_1380 = s0_142 + 0x0600;
		a0_1383 = (struct Eq_274 *) &g_t2308471C;
l23035ECE:
		word32 a4_3264;
		word32 s7_3268;
		word32 s1_3259;
		word32 a1_3261;
		word32 a0_3260;
		word32 a2_3262;
		word32 a3_3263;
		word32 s3_3265;
		word32 s5_3266;
		word32 s6_3267;
		word32 s8_3269;
		word32 s10_3270;
		word32 s11_3271;
		ra = bl_printk(ra, a0_1383, a3_1380, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, dwLoc28, dwLoc04, out s1_3259, out a0_3260, out a1_3261, out a2_3262, out a3_3263, out a4_3264, out a5_1217, out s2_117, out s3_3265, out s4_119, out s5_3266, out s6_3267, out s7_3268, out s8_3269, out s9, out s10_3270, out s11_3271);
		goto l23035EFE;
	}
	word32 a2_3287;
	word32 a3_3288;
	word32 a5_3290;
	word32 a4_3289;
	word32 a1_3286;
	if (memcmp(587745044, a0_133, 0x04, out a1_3286, out a2_3287, out a3_3288, out a4_3289, out a5_3290) != 0x00)
		goto l23035EF4;
	word32 a0_170;
	word32 s0_179;
	struct Eq_170728 * s1_180;
	word32 s6_185;
	word32 s8_186;
	word32 s5_3292;
	word32 s3_3291;
	ra = fdt_stringlist_count(ra, s4_119, 0x23084748, s2_117, dwLocB8, 0x23084688, dwLoc08, dwArg28, out s0_179, out s1_180, out a0_170, out s2_117, out s3_3291, out s4_119, out s5_3292, out s6_185, out s8_186);
	if (a0_170 != s6_185)
	{
		a5_1217 = 0x02;
		if ((word32) s1_180->bFFFFFC5C <= 0x02 && (word32) g_b4201FD46 <= 0x02)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_3303;
				xTaskGetTickCountFromISR(out a5_3303);
			}
			else
			{
				word32 a5_3302;
				xTaskGetTickCount(out a5_3302);
			}
			a3_1380 = s0_179 + 0x0600;
			a0_1383 = (struct Eq_274 *) &g_t23084750;
			goto l23035ECE;
		}
		goto l23035EFE;
	}
	Eq_2 a0_196;
	Eq_170748 a4_200;
	word32 s0_205;
	struct Eq_170750 * s1_206;
	word32 s3_3298;
	word32 a5_3296;
	word32 s2_3297;
	word32 s5_3299;
	word32 s8_3301;
	word32 s6_3300;
	word32 a3_3295;
	word32 a2_3294;
	word32 a1_3293;
	Eq_2 s4_209;
	Eq_2 ra_204 = fdt_stringlist_get(ra, s4_119, s8_186 + 0x0748, dwLocAC, dwLoc18, s1, dwArg68, out s0_205, out s1_206, out a0_196, out a1_3293, out a2_3294, out a3_3295, out a4_200, out a5_3296, out s2_3297, out s3_3298, out s4_209, out s5_3299, out s6_3300, out s8_3301);
	dwLoc28 = a0_196;
	if (a4_200 > 32 && ((word32) s1_206->bFFFFFC5C <= 0x02 && (word32) g_b4201FD46 <= 0x02))
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_3315;
			xTaskGetTickCountFromISR(out a5_3315);
		}
		else
		{
			word32 a5_3314;
			xTaskGetTickCount(out a5_3314);
		}
		word32 a5_3322;
		word32 s11_3330;
		word32 s10_3329;
		word32 s7_3327;
		word32 s8_3328;
		word32 s2_3323;
		word32 s6_3326;
		word32 s5_3325;
		word32 s3_3324;
		word32 a2_3319;
		word32 a4_3321;
		word32 a3_3320;
		word32 s1_3316;
		word32 a1_3318;
		word32 a0_3317;
		ra_204 = bl_printk(ra_204, &g_t2308478C, s0_205 + 0x0600, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_3316, out a0_3317, out a1_3318, out a2_3319, out a3_3320, out a4_3321, out a5_3322, out s2_3323, out s3_3324, out s4_209, out s5_3325, out s6_3326, out s7_3327, out s8_3328, out s9, out s10_3329, out s11_3330);
	}
	struct Eq_274 * a0_1306;
	Eq_2 a3_1303;
	union Eq_2 * a0_276;
	word32 s0_285;
	struct Eq_170822 * s1_286;
	word32 s8_3313;
	word32 s6_3312;
	word32 s5_3311;
	word32 a5_3309;
	word32 s3_3310;
	word32 a4_3308;
	word32 a3_3307;
	word32 a1_3306;
	ra = fdt_getprop(ra_204, s4_209, 587745212, dwLocB8, dwLoc98, dwLoc7C, s1, dwArg48, out s0_285, out s1_286, out a0_276, out a1_3306, out a3_3307, out a4_3308, out a5_3309, out s2_117, out s3_3310, out s4_119, out s5_3311, out s6_3312, out s8_3313);
	if (a0_276 == null)
	{
		a5_1217 = 0x02;
		if ((word32) s1_286->bFFFFFC5C > 0x02 || (word32) g_b4201FD46 > 0x02)
			goto l23035EFE;
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_3340;
			xTaskGetTickCountFromISR(out a5_3340);
		}
		else
		{
			word32 a5_3339;
			xTaskGetTickCount(out a5_3339);
		}
		a3_1303 = s0_285 + 0x0600;
		a0_1306 = (struct Eq_274 *) &g_t230847C8;
		goto l23036086;
	}
	Eq_2 s7_297 = *a0_276;
	union Eq_2 * a0_302;
	word32 s0_311;
	Eq_2 s1_312;
	word32 a1_3331;
	word32 a3_3332;
	word32 s6_3337;
	word32 s8_3338;
	word32 a5_3334;
	word32 s5_3336;
	word32 s3_3335;
	word32 a4_3333;
	ra = fdt_getprop(ra, s4_119, 587745272, dwLocB8, dwLoc98, dwLoc7C, s1, dwArg48, out s0_311, out s1_312, out a0_302, out a1_3331, out a3_3332, out a4_3333, out a5_3334, out s2_117, out s3_3335, out s4_119, out s5_3336, out s6_3337, out s8_3338);
	if (a0_302 == null)
	{
		a5_1217 = 0x02;
		if ((word32) *((word32) s1_312 - 932) > 0x02 || (word32) g_b4201FD46 > 0x02)
			goto l23035EFE;
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_3345;
			xTaskGetTickCountFromISR(out a5_3345);
		}
		else
		{
			word32 a5_3344;
			xTaskGetTickCount(out a5_3344);
		}
		a3_1303 = s0_311 + 0x0600;
		a0_1306 = (struct Eq_274 *) &g_t230847FC;
l23036086:
		word32 a2_3349;
		word32 a3_3350;
		word32 s11_3358;
		word32 s7_3355;
		word32 s10_3357;
		word32 s8_3356;
		word32 s3_3352;
		word32 s6_3354;
		word32 s5_3353;
		word32 a4_3351;
		word32 a1_3348;
		word32 a0_3347;
		word32 s1_3346;
		ra = bl_printk(ra, a0_1306, a3_1303, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_3346, out a0_3347, out a1_3348, out a2_3349, out a3_3350, out a4_3351, out a5_1217, out s2_117, out s3_3352, out s4_119, out s5_3353, out s6_3354, out s7_3355, out s8_3356, out s9, out s10_3357, out s11_3358);
		goto l23035EFE;
	}
	Eq_2 s9_1041;
	union Eq_2 * a0_327;
	word32 a5_3341;
	word32 s5_3343;
	word32 s3_3342;
	Eq_2 s1_1562;
	Eq_2 s6_1563;
	ra = fdt_subnode_offset(ra, s1_312, s4_119, 0x23084824, s2_117, *a0_302, dwLocB8, dwLoc88, dwArg28, out s0_1457, out s1_1562, out a0_327, out a5_3341, out s2_117, out s3_3342, out s4_119, out s5_3343, out s6_1563);
	s9 = a0_327;
	if (a0_327 <= null)
	{
		if ((word32) *((word32) s1_1562 - 932) <= 0x02 && (word32) g_b4201FD46 <= 0x02)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_3368;
				xTaskGetTickCountFromISR(out a5_3368);
			}
			else
			{
				word32 a5_3367;
				xTaskGetTickCount(out a5_3367);
			}
			word32 a2_3380;
			word32 a5_3383;
			word32 s5_3385;
			word32 s9_3387;
			word32 s11_3389;
			word32 s10_3388;
			word32 s8_3386;
			word32 s3_3384;
			word32 a4_3382;
			word32 a3_3381;
			word32 a1_3379;
			word32 a0_3378;
			ra = bl_printk(ra, &g_t23084830, s0_1457 + 0x0600, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_1562, out a0_3378, out a1_3379, out a2_3380, out a3_3381, out a4_3382, out a5_3383, out s2_117, out s3_3384, out s4_119, out s5_3385, out s6_1563, out s7_297, out s8_3386, out s9_3387, out s10_3388, out s11_3389);
		}
		s9_1041.u0 = 0x0200;
	}
	else
	{
		union Eq_2 * a0_353;
		struct Eq_171057 * s1_363;
		word32 s8_3366;
		word32 s6_3365;
		word32 s3_3363;
		word32 s5_3364;
		word32 a1_3359;
		word32 a5_3362;
		word32 a4_3361;
		word32 a3_3360;
		ra = fdt_getprop(ra, s4_119, 0x23084870, dwLocB8, dwLoc98, dwLoc7C, s1, dwArg48, out s0_1457, out s1_363, out a0_353, out a1_3359, out a3_3360, out a4_3361, out a5_3362, out s2_117, out s3_3363, out s4_119, out s5_3364, out s6_3365, out s8_3366);
		if (a0_353 == null)
		{
			a5_1217 = 0x02;
			if ((word32) s1_363->bFFFFFC5C <= 0x02 && (word32) g_b4201FD46 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_3377;
					xTaskGetTickCountFromISR(out a5_3377);
				}
				else
				{
					word32 a5_3376;
					xTaskGetTickCount(out a5_3376);
				}
				goto l23035E5A;
			}
			goto l23035EFE;
		}
		Eq_2 s10_374 = *a0_353;
		union Eq_2 * a0_379;
		word32 a3_3370;
		word32 a5_3372;
		word32 s3_3373;
		word32 s8_3375;
		word32 a1_3369;
		word32 s5_3374;
		word32 a4_3371;
		ra = fdt_getprop(ra, s4_119, 587745400, dwLocB8, dwLoc98, dwLoc7C, s1, dwArg48, out s0_1457, out s1_1562, out a0_379, out a1_3369, out a3_3370, out a4_3371, out a5_3372, out s2_117, out s3_3373, out s4_119, out s5_3374, out s6_1563, out s8_3375);
		s9 = a0_379;
		if (a0_379 == null)
		{
			a5_1217 = 0x02;
			if ((word32) *((word32) s1_1562 - 932) <= 0x02 && (word32) g_b4201FD46 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_3391;
					xTaskGetTickCountFromISR(out a5_3391);
				}
				else
				{
					word32 a5_3390;
					xTaskGetTickCount(out a5_3390);
				}
				goto l23035E5A;
			}
			goto l23035EFE;
		}
		fdt32_to_cpu(s10_374);
		s9_1041 = fdt32_to_cpu(*a0_379);
	}
	if ((word32) *((word32) s1_1562 - 932) <= 0x02 && (word32) g_b4201FD46 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_3393;
			xTaskGetTickCountFromISR(out a5_3393);
		}
		else
		{
			word32 a5_3392;
			xTaskGetTickCount(out a5_3392);
		}
		word32 s3_3400;
		word32 s10_3403;
		word32 s8_3402;
		word32 s5_3401;
		word32 s11_3404;
		word32 a5_3399;
		word32 a4_3398;
		word32 a2_3396;
		word32 a3_3397;
		word32 a1_3395;
		word32 a0_3394;
		ra = bl_printk(ra, &g_t23084880, s0_1457 + 0x0600, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_1562, out a0_3394, out a1_3395, out a2_3396, out a3_3397, out a4_3398, out a5_3399, out s2_117, out s3_3400, out s4_119, out s5_3401, out s6_1563, out s7_297, out s8_3402, out s9_1041, out s10_3403, out s11_3404);
	}
	fdt32_to_cpu(s7_297);
	Eq_2 a0_567 = fdt32_to_cpu(s6_1563);
	dwLocAC = a0_567;
	struct Eq_171245 * s7_571 = fp + -112;
	struct Eq_171248 * s11_1564 = &g_t42020000;
	struct Eq_171250 * s10_1565 = &g_t4200E000;
	do
	{
		byte bLoc98_1813 = (byte) dwLoc98;
		int32 a0_586;
		word32 s0_595;
		word32 a5_3410;
		word32 s5_3412;
		word32 s3_3411;
		ra = fdt_subnode_offset(ra, s1_1562, s4_119, 587745472, s2_117, s6_1563, dwLocB8, dwLoc88, dwArg28, out s0_595, out s1_1562, out a0_586, out a5_3410, out s2_117, out s3_3411, out s4_119, out s5_3412, out s6_1563);
		if (a0_586 <= 0x00)
		{
			if ((word32) *((word32) s1_1562 - 932) <= 0x02 && (word32) s11_1564->bFFFFFD46 <= 0x02)
			{
				if (s10_1565->dwFFFFFE84 != 0x00)
				{
					word32 a5_3409;
					xTaskGetTickCountFromISR(out a5_3409);
				}
				else
				{
					word32 a5_3408;
					xTaskGetTickCount(out a5_3408);
				}
				word32 a0_3413;
				word32 a3_3416;
				word32 a5_3418;
				word32 s5_3420;
				word32 s8_3421;
				word32 s3_3419;
				word32 a4_3417;
				word32 a2_3415;
				word32 a1_3414;
				ra = bl_printk(ra, &g_t230848C8, s0_595 + 0x0600, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_1562, out a0_3413, out a1_3414, out a2_3415, out a3_3416, out a4_3417, out a5_3418, out s2_117, out s3_3419, out s4_119, out s5_3420, out s6_1563, out s7_571, out s8_3421, out s9_1041, out s10_1565, out s11_1564);
			}
			goto l230362B6;
		}
		word32 a0_612;
		word32 s0_621;
		word32 s3_3405;
		word32 s5_3406;
		word32 s8_3407;
		ra = fdt_stringlist_count(ra, s4_119, s7_571->dw0000, s2_117, dwLocB8, 0x23084688, dwLoc08, dwArg28, out s0_621, out s1_1562, out a0_612, out s2_117, out s3_3405, out s4_119, out s5_3406, out s6_1563, out s8_3407);
		if (a0_612 != 0x01)
		{
			if ((word32) *((word32) s1_1562 - 932) <= 0x02 && (word32) s11_1564->bFFFFFD46 <= 0x02)
			{
				if (s10_1565->dwFFFFFE84 != 0x00)
				{
					word32 a5_3487;
					xTaskGetTickCountFromISR(out a5_3487);
				}
				else
				{
					word32 a5_3486;
					xTaskGetTickCount(out a5_3486);
				}
				word32 s5_3502;
				word32 s8_3503;
				word32 a1_3496;
				word32 a0_3495;
				word32 a2_3497;
				word32 a4_3499;
				word32 a5_3500;
				word32 s3_3501;
				word32 a3_3498;
				ra = bl_printk(ra, &g_t230848F4, s0_621 + 0x0600, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_1562, out a0_3495, out a1_3496, out a2_3497, out a3_3498, out a4_3499, out a5_3500, out s2_117, out s3_3501, out s4_119, out s5_3502, out s6_1563, out s7_571, out s8_3503, out s9_1041, out s10_1565, out s11_1564);
			}
			goto l230362B6;
		}
		Eq_2 a1_640;
		word32 a4_643;
		word32 s0_648;
		word32 a2_3480;
		word32 a0_3479;
		word32 a3_3481;
		word32 s3_3483;
		word32 s5_3484;
		word32 s8_3485;
		word32 a5_3482;
		ra = fdt_stringlist_get(ra, s4_119, s6_1563, a0_567, dwLoc18, s1, dwArg68, out s0_648, out s1_1562, out a0_3479, out a1_640, out a2_3480, out a3_3481, out a4_643, out a5_3482, out s2_117, out s3_3483, out s4_119, out s5_3484, out s6_1563, out s8_3485);
		if (a4_643 != 0x04)
		{
l23036342:
			if ((word32) *((word32) s1_1562 - 932) <= 0x02 && (word32) s11_1564->bFFFFFD46 <= 0x02)
			{
				if (s10_1565->dwFFFFFE84 != 0x00)
				{
					word32 a5_3494;
					xTaskGetTickCountFromISR(out a5_3494);
				}
				else
				{
					word32 a5_3493;
					xTaskGetTickCount(out a5_3493);
				}
				word32 s5_3511;
				word32 a1_3505;
				word32 a0_3504;
				word32 s8_3512;
				word32 a2_3506;
				word32 a4_3508;
				word32 a5_3509;
				word32 s3_3510;
				word32 a3_3507;
				ra = bl_printk(ra, &g_t23084928, s0_648 + 0x0600, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_1562, out a0_3504, out a1_3505, out a2_3506, out a3_3507, out a4_3508, out a5_3509, out s2_117, out s3_3510, out s4_119, out s5_3511, out s6_1563, out s7_571, out s8_3512, out s9_1041, out s10_1565, out s11_1564);
			}
			goto l230362B6;
		}
		word32 a1_3488;
		word32 a2_3489;
		word32 a4_3491;
		word32 a5_3492;
		word32 a3_3490;
		if (memcmp(587745044, a1_640, 0x04, out a1_3488, out a2_3489, out a3_3490, out a4_3491, out a5_3492) != 0x00)
			goto l23036342;
		int32 a0_676;
		word32 s0_685;
		struct Eq_171841 * s1_686;
		Eq_2 s4_689;
		word32 a5_3513;
		word32 s2_3514;
		word32 s5_3516;
		word32 s6_3517;
		word32 s3_3515;
		Eq_2 ra_684 = fdt_subnode_offset(ra, s1_1562, s4_119, 587745636, s2_117, s6_1563, dwLocB8, dwLoc88, dwArg28, out s0_685, out s1_686, out a0_676, out a5_3513, out s2_3514, out s3_3515, out s4_689, out s5_3516, out s6_3517);
		if (a0_676 <= 0x00)
		{
			if ((word32) s1_686->bFFFFFC5C > 0x02 || (word32) g_b4201FD46 > 0x02)
				goto l230363C4;
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_3526;
				xTaskGetTickCountFromISR(out a5_3526);
			}
			else
			{
				word32 a5_3525;
				xTaskGetTickCount(out a5_3525);
			}
			word32 s2_3535;
			word32 s11_3543;
			word32 a0_3529;
			word32 s4_3537;
			word32 s3_3536;
			word32 s5_3538;
			word32 s7_3540;
			word32 s8_3541;
			word32 s10_3542;
			word32 s6_3539;
			word32 a1_3530;
			word32 a3_3532;
			word32 a4_3533;
			word32 a5_3534;
			word32 a2_3531;
			bl_printk(ra_684, &g_t23084968, s0_685 + 0x0600, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_1562, out a0_3529, out a1_3530, out a2_3531, out a3_3532, out a4_3533, out a5_3534, out s2_3535, out s3_3536, out s4_3537, out s5_3538, out s6_3539, out s7_3540, out s8_3541, out s9_1041, out s10_3542, out s11_3543);
			break;
		}
		union Eq_2 * a0_702;
		word32 s0_711;
		word32 a3_3519;
		word32 a5_3521;
		word32 a4_3520;
		word32 s3_3522;
		word32 s8_3524;
		word32 s5_3523;
		word32 a1_3518;
		ra = fdt_getprop(ra_684, s4_689, s7_571->dw0004, dwLocB8, dwLoc98, dwLoc7C, s1, dwArg48, out s0_711, out s1_1562, out a0_702, out a1_3518, out a3_3519, out a4_3520, out a5_3521, out s2_117, out s3_3522, out s4_119, out s5_3523, out s6_1563, out s8_3524);
		if (a0_702 == null)
		{
			if ((word32) *((word32) s1_1562 - 932) <= 0x02 && (word32) s11_1564->bFFFFFD46 <= 0x02)
			{
				if (s10_1565->dwFFFFFE84 != 0x00)
				{
					word32 a5_3528;
					xTaskGetTickCountFromISR(out a5_3528);
				}
				else
				{
					word32 a5_3527;
					xTaskGetTickCount(out a5_3527);
				}
				word32 a2_3546;
				word32 a5_3549;
				word32 s5_3551;
				word32 s8_3552;
				word32 s3_3550;
				word32 a4_3548;
				word32 a3_3547;
				word32 a1_3545;
				word32 a0_3544;
				ra = bl_printk(ra, &g_t230846A8, s0_711 + 0x0600, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_1562, out a0_3544, out a1_3545, out a2_3546, out a3_3547, out a4_3548, out a5_3549, out s2_117, out s3_3550, out s4_119, out s5_3551, out s6_1563, out s7_571, out s8_3552, out s9_1041, out s10_1565, out s11_1564);
			}
		}
		else
			s7_571->b0008 = (byte) fdt32_to_cpu(*a0_702);
l230362B6:
		++s7_571;
	} while (fp + -64 != s7_571);
	if ((word32) *((word32) s1_1562 - 932) <= 0x02 && (word32) g_b4201FD46 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_3423;
			xTaskGetTickCountFromISR(out a5_3423);
		}
		else
		{
			word32 a5_3422;
			xTaskGetTickCount(out a5_3422);
		}
		Eq_2 a5_1000 = (word32) bLoc44;
		word32 s3_3434;
		word32 s7_3438;
		word32 s10_3440;
		word32 s5_3436;
		word32 s11_3441;
		word32 s4_3435;
		word32 s8_3439;
		word32 s6_3437;
		word32 s2_3433;
		word32 a5_3432;
		word32 a3_3430;
		word32 a4_3431;
		word32 a2_3429;
		word32 a1_3428;
		word32 a0_3427;
		word32 s1_3426;
		bl_printk(dwArg0134, &g_t23084990, dwArg0134, a5_1000, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_3426, out a0_3427, out a1_3428, out a2_3429, out a3_3430, out a4_3431, out a5_3432, out s2_3433, out s3_3434, out s4_3435, out s5_3436, out s6_3437, out s7_3438, out s8_3439, out s9_1041, out s10_3440, out s11_3441);
		dwLocB8 = a5_1000;
	}
l230363C4:
	Eq_2 s5_1046 = (word32) bLoc98_1813;
	word32 a5_1050;
	bl_uart_flush(s5_1046, out a5_1050);
	struct Eq_171419 * s1_1069;
	word32 s8_1073;
	Eq_2 s2_1070;
	word32 a1_1060;
	Eq_2 ra_1067 = bl_uart_init(s5_1046, (word32) bLoc68_2953, (word32) bLoc5C, a5_1050, out s1_1069, out a1_1060, out s2_1070, out s8_1073);
	Eq_2 a4_1081 = (word32) s1_1069->bFFFFFC5C;
	if (a4_1081 <= 0x02)
	{
		a4_1081 = (word32) g_b4201FD46;
		if (a4_1081 <= 0x02)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_3456;
				xTaskGetTickCountFromISR(out a5_3456);
			}
			else
			{
				word32 a5_3455;
				xTaskGetTickCount(out a5_3455);
			}
			struct Eq_171645 * s1_1115;
			struct Eq_171598 * s10_1116;
			struct Eq_171591 * s7_1123;
			word32 s11_3478;
			word32 a0_3470;
			word32 a3_3472;
			word32 a2_3471;
			word32 a4_3473;
			word32 s3_3475;
			word32 s4_3476;
			word32 s6_3477;
			word32 a5_3474;
			ra_1067 = bl_printk(ra_1067, &g_t230849E4, (word32) dwArg0134 + 0x0600, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_1115, out a0_3470, out a1_1060, out a2_3471, out a3_3472, out a4_3473, out a5_3474, out s2_1070, out s3_3475, out s4_3476, out s5_1046, out s6_3477, out s7_1123, out s8_1073, out s9_1041, out s10_1116, out s11_3478);
			a4_1081 = (word32) s1_1115->bFFFFFC5C;
			if (a4_1081 <= 0x02)
			{
				a4_1081 = (word32) s7_1123->bFFFFFD46;
				if (a4_1081 <= 0x02)
				{
					if (s10_1116->dwFFFFFE84 != 0x00)
					{
						word32 a5_3458;
						xTaskGetTickCountFromISR(out a5_3458);
					}
					else
					{
						word32 a5_3457;
						xTaskGetTickCount(out a5_3457);
					}
					word32 a3_3462;
					word32 s3_3464;
					word32 a5_3463;
					word32 s4_3465;
					word32 s7_3467;
					word32 s10_3468;
					word32 s11_3469;
					word32 s6_3466;
					word32 s1_3459;
					word32 a0_3460;
					word32 a2_3461;
					ra_1067 = bl_printk(ra_1067, &g_t23084A10, (word32) dwArg0134 + 0x0600, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_3459, out a0_3460, out a1_1060, out a2_3461, out a3_3462, out a4_1081, out a5_3463, out s2_1070, out s3_3464, out s4_3465, out s5_1046, out s6_3466, out s7_3467, out s8_1073, out s9_1041, out s10_3468, out s11_3469);
				}
			}
		}
	}
	word32 a0_1214;
	word32 s0_1219;
	struct Eq_171459 * s1_1228;
