pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
	ra = dev_uart_init(ra_1067, s5_1046, a1_1060, s8_1073, s9_1041, a4_1081, s2_1070, mstatus, dwLocB8, dwLocA0, 0x23084688, s10, s6, s4, dwLoc4C, dwLoc48, a1, dwLoc18, dwLoc0C, dwArg28, dwArg58, dwArg68, dwArg98, dwArgA8, out s0_1219, out s1_1228, out a0_1214, out a5_1217, out s2_117, out s4_119, out s9);
	if (a0_1214 != 0x00)
	{
		a5_1217 = 0x04;
		if ((word32) s1_1228->bFFFFFC5C <= 0x04 && (word32) g_b4201FD46 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_3425;
				xTaskGetTickCountFromISR(out a5_3425);
			}
			else
			{
				word32 a5_3424;
				xTaskGetTickCount(out a5_3424);
			}
			word32 a2_3445;
			word32 s11_3454;
			word32 a4_3447;
			word32 s1_3442;
			word32 a3_3446;
			word32 s10_3453;
			word32 s3_3448;
			word32 s6_3450;
			word32 s7_3451;
			word32 s8_3452;
			word32 s5_3449;
			word32 a1_3444;
			word32 a0_3443;
			ra = bl_printk(ra, &g_t23084A48, s0_1219 + 0x0600, dwLocB8, dwLoc98, dwLoc50, dwLoc4C, a0_196, dwLoc04, out s1_3442, out a0_3443, out a1_3444, out a2_3445, out a3_3446, out a4_3447, out a5_1217, out s2_117, out s3_3448, out s4_119, out s5_3449, out s6_3450, out s7_3451, out s8_3452, out s9, out s10_3453, out s11_3454);
		}
	}
l23035EFE:
	a5_1522 = a5_1217 + 0x04;
	if (s2_117 != 0x00)
	{
		a5_1522->b0000 = (byte) s2_117;
		goto l23035F0E;
	}
	s2_1525.u0 = 0x01;
	goto l23035E14;
}

// 230365D8: Register word32 hal_uart_send_flush(Register (ptr32 Eq_172018) a0, Register out ptr32 a5Out)
// Called from:
//      vfs_uart_sync
word32 hal_uart_send_flush(struct Eq_172018 * a0, ptr32 & a5Out)
{
	ptr32 a5_10;
	word32 s1_11 = bl_uart_flush((word32) a0->b0000, out a5_10);
	a5Out = a5_10;
	return s1_11;
}

// 230365EC: void hal_uart_setbaud(Register (ptr32 byte) a0)
void hal_uart_setbaud(byte * a0)
{
	ui32 a0_5 = (word32) *a0;
	bl_uart_setbaud(a0_5);
}

// 230365F4: void hal_uart_setconfig(Register (ptr32 byte) a0)
// Called from:
//      uart_ioctl_cmd_setconfig
void hal_uart_setconfig(byte * a0)
{
	ui32 a0_5 = (word32) *a0;
	bl_uart_setconfig(a0_5);
}

// 230365FC: Register Eq_2 hal_gpio_init_from_dts(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s2, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack word32 dwArg0174, Register out (ptr32 Eq_2447) s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_2452) s3Out)
// Called from:
//      aos_loop_proc
Eq_2 hal_gpio_init_from_dts(Eq_2 ra, Eq_2 a0, Eq_2 s2, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg1C, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, word32 dwArg0174, struct Eq_2447 & s0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, struct Eq_2452 & s3Out)
{
	Eq_2 dwLoc48_959 = s2;
	Eq_2 dwArg18_1007 = 0x00;
	word32 a0_38;
	uint32 a5_43;
	word32 s6_2509;
	word32 s0_2500;
	word32 a1_2502;
	word32 a3_2503;
	word32 s1_2501;
	word32 s5_2508;
	word32 s4_2507;
	word32 a4_2504;
	word32 s3_2506;
	word32 s2_2505;
	word32 s8_2510;
	Eq_2 ra_108 = fdt_getprop(ra, a0, 587745904, dwLoc78, s10, dwLoc3C, dwArg58, dwArg88, out s0_2500, out s1_2501, out a0_38, out a1_2502, out a3_2503, out a4_2504, out a5_43, out s2_2505, out s3_2506, out s4_2507, out s5_2508, out s6_2509, out s8_2510);
	Eq_2 s1_109 = ~0x00;
	if (a0_38 != 0x00)
		s1_109 = a5_43 << 0x18 | a5_43 >> 0x18 | (a5_43 >> 0x08 & 0x00FF) << 16 | (a5_43 >> 16 & 0x00FF) << 8;
	struct Eq_2447 * s0_175 = &g_t42020000;
	ptr32 a4_106 = (word32) g_b4201FC5C;
	ptr32 a5_100 = 0x02;
	if (a4_106 <= 0x02)
	{
		a4_106 = (word32) g_b4201FD47;
		if (a4_106 <= 0x02)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_2512;
				xTaskGetTickCountFromISR(out a5_2512);
			}
			else
			{
				word32 a5_2511;
				xTaskGetTickCount(out a5_2511);
			}
			word32 a1_2544;
			word32 s3_2548;
			word32 s8_2553;
			word32 s9_2554;
			word32 s11_2556;
			word32 s10_2555;
			word32 a0_2543;
			word32 a3_2546;
			word32 a2_2545;
			word32 s4_2549;
			word32 s2_2547;
			word32 s5_2550;
			word32 s6_2551;
			word32 s7_2552;
			ra_108 = bl_printk(ra_108, &g_t23084A84, 587745912, dwLoc78, s10, dwLoc10, dwLoc0C, 0x00, ra, out s1_109, out a0_2543, out a1_2544, out a2_2545, out a3_2546, out a4_106, out a5_100, out s2_2547, out s3_2548, out s4_2549, out s5_2550, out s6_2551, out s7_2552, out s8_2553, out s9_2554, out s10_2555, out s11_2556);
		}
	}
	Eq_2 s7_122 = 0x00;
	Eq_2 s2_125 = 0x42020000;
	struct Eq_2452 * s3_126 = &g_t4200E000;
	while (true)
	{
		byte bLoc46_1013 = SLICE(dwLoc48_959, byte, 16);
		byte bLoc47_1009 = SLICE(dwLoc48_959, byte, 8);
		byte bLoc45_1021 = SLICE(dwLoc48_959, byte, 24);
		if (s7_122 >= s1_109)
			break;
		Eq_2 s1_147;
		word32 s10_148;
		word32 s11_149;
		Eq_2 s2_150;
		Eq_2 s5_153;
		Eq_2 s6_154;
		up32 s9_157;
		int32 a0_166;
		Eq_2 s5_180;
		word32 a4_2518;
		word32 a2_2516;
		word32 s8_2523;
		word32 s0_2513;
		word32 a1_2515;
		word32 a0_2514;
		word32 a3_2517;
		word32 a5_2519;
		word32 s3_2521;
		word32 a7_2520;
		word32 a5_2525;
		word32 s1_2524;
		word32 s4_2522;
		word32 s4_2526;
		word32 s6_2527;
		word32 s7_155;
		Eq_2 ra_174 = fdt_subnode_offset(snprintf(ra_108, fp + -88, 11, &g_t23084AB4, dwLoc68, dwLoc48_959, dwLoc1C, dwArg00, dwArg04, s9, dwArg4C, out s0_2513, out s1_147, out a0_2514, out a1_2515, out a2_2516, out a3_2517, out a4_2518, out a5_2519, out a7_2520, out s2_150, out s3_2521, out s4_2522, out s5_153, out s6_154, out s7_155, out s8_2523, out s9_157, out s10_148, out s11_149), s1_147, s5_153, fp + -88, s2_150, s6_154, dwLoc78, dwLoc48_959, dwArg68, out s0_175, out s1_2524, out a0_166, out a5_2525, out s2_125, out s3_126, out s4_2526, out s5_180, out s6_2527);
		if (a0_166 < 0x00)
		{
			a4_106 = (word32) s0_175->bFFFFFC5C;
			a5_100 = 0x02;
			if (a4_106 <= 0x02)
			{
				a4_106 = (word32) g_b4201FD47;
				if (a4_106 <= 0x02)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_2542;
						xTaskGetTickCountFromISR(out a5_2542);
					}
					else
					{
						word32 a5_2541;
						xTaskGetTickCount(out a5_2541);
					}
					word32 s9_2567;
					word32 s11_2569;
					word32 s10_2568;
					word32 s8_2566;
					word32 s5_2563;
					word32 s7_2565;
					word32 s6_2564;
					word32 s4_2562;
					word32 a3_2561;
					word32 a1_2559;
					word32 a2_2560;
					word32 s1_2557;
					word32 a0_2558;
					bl_printk(ra_174, &g_t23084ABC, 587745912, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18_1007, ra, out s1_2557, out a0_2558, out a1_2559, out a2_2560, out a3_2561, out a4_106, out a5_100, out s2_125, out s3_126, out s4_2562, out s5_2563, out s6_2564, out s7_2565, out s8_2566, out s9_2567, out s10_2568, out s11_2569);
				}
			}
			break;
		}
		Eq_2 dwLoc48_2478;
		struct Eq_274 * a0_507;
		Eq_2 a3_505;
		Eq_2 a0_206;
		Eq_2 s5_220;
		word32 a1_2530;
		word32 s8_2540;
		word32 t1_2528;
		word32 a3_2532;
		word32 a2_2531;
		word32 a0_2529;
		word32 a4_2533;
		word32 a5_2534;
		word32 a1_2535;
		word32 a5_2538;
		word32 a2_2536;
		word32 s6_2539;
		word32 a4_2537;
		word32 s4_219;
		Eq_2 a3_209;
		ra_108 = fdt_stringlist_get(memset(ra_174, fp + -76, 0x00, 0x0C, out t1_2528, out a0_2529, out a1_2530, out a2_2531, out a3_2532, out a4_2533, out a5_2534), s5_180, 587744976, dwLoc6C, s9, dwArg58, dwArgA8, out s0_175, out s1_109, out a0_206, out a1_2535, out a2_2536, out a3_209, out a4_2537, out a5_2538, out s2_125, out s3_126, out s4_219, out s5_220, out s6_2539, out s8_2540);
		if (s9_157 != 0x04)
		{
l23036780:
			dwLoc48_2478 = SEQ(SLICE(dwLoc48_959, word24, 8), 0x00);
			if ((word32) s0_175->bFFFFFC5C > 0x02)
				goto l2303678A;
			dwLoc48_2478 = SEQ(SLICE(dwLoc48_959, word24, 8), 0x00);
			if ((word32) *((word32) s2_125 - 697) > 0x02)
				goto l2303678A;
			if (s3_126->dwFFFFFE84 != 0x00)
			{
				word32 a5_2672;
				xTaskGetTickCountFromISR(out a5_2672);
			}
			else
			{
				word32 a5_2671;
				xTaskGetTickCount(out a5_2671);
			}
			a3_505 = s4_219 + -0x0588;
			a0_507 = (struct Eq_274 *) &g_t23084AE0;
			goto l2303687E;
		}
		word32 a1_2570;
		word32 a2_2571;
		word32 a4_2572;
		word32 a5_2573;
		if (memcmp(587745044, a0_206, 0x04, out a1_2570, out a2_2571, out a3_209, out a4_2572, out a5_2573) != 0x00)
			goto l23036780;
		struct Eq_274 * a0_577;
		Eq_2 a3_575;
		word32 a0_243;
		uint32 a5_248;
		Eq_2 s5_257;
		word32 a4_2575;
		word32 s6_2576;
		word32 s8_2577;
		word32 a1_2574;
		ra_108 = fdt_getprop(ra_108, s5_220, s10_148 + -0x069C, dwLoc78, s10, dwLoc3C, dwArg58, dwArg88, out s0_175, out s1_109, out a0_243, out a1_2574, out a3_209, out a4_2575, out a5_248, out s2_125, out s3_126, out s4_219, out s5_257, out s6_2576, out s8_2577);
		if (a0_243 == 0x00)
		{
			dwLoc48_2478 = SEQ(SLICE(dwLoc48_959, word24, 8), 0x00);
			if (s9_157 < (word32) s0_175->bFFFFFC5C)
				goto l2303678A;
			dwLoc48_2478 = SEQ(SLICE(dwLoc48_959, word24, 8), 0x00);
			if (s9_157 < (word32) (*((word32) s2_125 - 697)))
				goto l2303678A;
			if (s3_126->dwFFFFFE84 != 0x00)
			{
				word32 a5_2584;
				xTaskGetTickCountFromISR(out a5_2584);
			}
			else
			{
				word32 a5_2583;
				xTaskGetTickCount(out a5_2583);
			}
			a3_575 = s4_219 + -0x0588;
			a0_577 = (struct Eq_274 *) &g_t23084B08;
			goto l23036848;
		}
		dwArg18_1007 = (a5_248 >> 16 & 0x00FF) << 8 | ((a5_248 << 0x18 | a5_248 >> 0x18) | (a5_248 >> 0x08 & 0x00FF) << 16);
		Eq_2 a0_281;
		word32 a4_285;
		Eq_2 s5_295;
		word32 a1_2578;
		word32 s6_2581;
		word32 s8_2582;
		word32 a2_2579;
		word32 a5_2580;
		ra_108 = fdt_stringlist_get(ra_108, s5_257, s11_149 + -0x0740, dwLoc6C, s9, dwArg58, dwArgA8, out s0_175, out s1_109, out a0_281, out a1_2578, out a2_2579, out a3_209, out a4_285, out a5_2580, out s2_125, out s3_126, out s4_219, out s5_295, out s6_2581, out s8_2582);
		if (a4_285 == 0x03)
		{
			word32 a1_2609;
			word32 a5_2612;
			word32 a2_2610;
			word32 a4_2611;
			if (memcmp(587751700, a0_281, 0x03, out a1_2609, out a2_2610, out a3_209, out a4_2611, out a5_2612) != 0x00)
				goto l230369A6;
			bLoc47_1009 = 0x00;
			Eq_2 a0_340;
			word32 a5_345;
			Eq_2 s5_354;
			word32 s6_2616;
			word32 s8_2617;
			word32 a4_2615;
			word32 a2_2614;
			word32 a1_2613;
			ra_108 = fdt_stringlist_get(ra_108, s5_295, 0x23084B34, dwLoc6C, s9, dwArg58, dwArgA8, out s0_175, out s1_109, out a0_340, out a1_2613, out a2_2614, out a3_209, out a4_2615, out a5_345, out s2_125, out s3_126, out s4_219, out s5_354, out s6_2616, out s8_2617);
			if (a5_345 == 0x02)
			{
				word32 a5_369;
				word32 a4_371;
				word32 a2_2619;
				word32 a1_2618;
				if (memcmp(0x23084B70, a0_340, 0x02, out a1_2618, out a2_2619, out a3_209, out a4_371, out a5_369) == 0x00)
				{
					bLoc46_1013 = 0x01;
					goto l2303691E;
				}
				if (a4_371 != a5_369)
					goto l23036A06;
				word32 a4_2647;
				word32 a5_2648;
				word32 a2_2646;
				word32 a1_2645;
				if (memcmp(587746164, a0_340, 0x02, out a1_2645, out a2_2646, out a3_209, out a4_2647, out a5_2648) != 0x00)
					goto l23036A06;
				bLoc46_1013 = 0x00;
l2303691E:
				Eq_2 a0_419;
				Eq_2 s5_433;
				word32 a5_2651;
				word32 s8_2653;
				word32 s6_2652;
				word32 a2_2650;
				word32 a1_2649;
				word32 a4_423;
				ra_108 = fdt_stringlist_get(ra_108, s5_354, 587718612, dwLoc6C, s9, dwArg58, dwArgA8, out s0_175, out s1_109, out a0_419, out a1_2649, out a2_2650, out a3_209, out a4_423, out a5_2651, out s2_125, out s3_126, out s4_219, out s5_433, out s6_2652, out s8_2653);
				if (a4_423 == 0x05)
				{
					word32 a1_2620;
					word32 a5_2622;
					word32 a2_2621;
					if (memcmp(587746168, a0_419, 0x05, out a1_2620, out a2_2621, out a3_209, out a4_423, out a5_2622) != 0x00)
						goto l23036A32;
					bLoc45_1021 = 0x00;
					goto l23036954;
				}
l23036A32:
				if (a4_423 == 0x09)
				{
					word32 a2_2637;
					word32 a4_2638;
					word32 a5_2639;
					word32 a1_2636;
					if (memcmp(0x23084B80, a0_419, 0x09, out a1_2636, out a2_2637, out a3_209, out a4_2638, out a5_2639) != 0x00)
						goto l23036A54;
					bLoc45_1021 = 0x01;
l23036954:
					word32 a0_524;
					uint32 a5_529;
					word32 s8_2644;
					word32 s6_2643;
					word32 s5_2642;
					word32 a1_2640;
					word32 a4_2641;
					ra_108 = fdt_getprop(ra_108, s5_433, 587732968, dwLoc78, s10, dwLoc3C, dwArg58, dwArg88, out s0_175, out s1_109, out a0_524, out a1_2640, out a3_209, out a4_2641, out a5_529, out s2_125, out s3_126, out s4_219, out s5_2642, out s6_2643, out s8_2644);
					if (a0_524 == 0x00)
					{
						dwLoc48_2478 = SEQ(bLoc45_1021, bLoc46_1013, 0x00, 0x00);
						if ((word32) s0_175->bFFFFFC5C <= 0x04)
						{
							dwLoc48_2478 = SEQ(bLoc45_1021, bLoc46_1013, 0x00, 0x00);
							if ((word32) *((word32) s2_125 - 697) <= 0x04)
							{
								if (s3_126->dwFFFFFE84 != 0x00)
								{
									word32 a5_2624;
									xTaskGetTickCountFromISR(out a5_2624);
								}
								else
								{
									word32 a5_2623;
									xTaskGetTickCount(out a5_2623);
								}
								a3_575 = s4_219 + -0x0588;
								a0_577 = (struct Eq_274 *) &g_t23084B8C;
l23036848:
								word32 a5_2629;
								word32 s5_2630;
								word32 s10_2634;
								word32 s11_2635;
								word32 s9_2633;
								word32 s6_2631;
								word32 s8_2632;
								word32 a1_2626;
								word32 a4_2628;
								word32 a2_2627;
								word32 a0_2625;
								ra_108 = bl_printk(ra_108, a0_577, a3_575, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18_1007, ra, out s1_109, out a0_2625, out a1_2626, out a2_2627, out a3_209, out a4_2628, out a5_2629, out s2_125, out s3_126, out s4_219, out s5_2630, out s6_2631, out s7_155, out s8_2632, out s9_2633, out s10_2634, out s11_2635);
								dwLoc48_2478 = SEQ(bLoc45_1021, bLoc46_1013, bLoc47_1009, 0x00);
							}
						}
					}
					else
					{
						ui32 a3_549 = a5_529 >> 0x08 & 0x00FF;
						a3_209 = a3_549 << 16;
						dwArg1C = (a5_529 >> 16 & 0x00FF) << 8 | ((a5_529 << 0x18 | a5_529 >> 0x18) | a3_549 << 16);
						dwLoc48_2478 = SEQ(bLoc45_1021, bLoc46_1013, 0x00, 0x01);
					}
					goto l2303678A;
				}
l23036A54:
				dwLoc48_2478 = SEQ(bLoc45_1021, bLoc46_1013, 0x00, 0x00);
				if ((word32) s0_175->bFFFFFC5C > 0x04)
					goto l2303678A;
				dwLoc48_2478 = SEQ(bLoc45_1021, bLoc46_1013, 0x00, 0x00);
				if ((word32) *((word32) s2_125 - 697) > 0x04)
					goto l2303678A;
				if (s3_126->dwFFFFFE84 != 0x00)
				{
					word32 a5_2668;
					xTaskGetTickCountFromISR(out a5_2668);
				}
				else
				{
					word32 a5_2667;
					xTaskGetTickCount(out a5_2667);
				}
				goto l230369CA;
			}
l23036A06:
			dwLoc48_2478 = SEQ(SLICE(dwLoc48_959, word16, 16), 0x00, 0x00);
			if ((word32) s0_175->bFFFFFC5C > 0x04)
				goto l2303678A;
			dwLoc48_2478 = SEQ(SLICE(dwLoc48_959, word16, 16), 0x00, 0x00);
			if ((word32) *((word32) s2_125 - 697) > 0x04)
				goto l2303678A;
			if (s3_126->dwFFFFFE84 != 0x00)
			{
				word32 a5_2655;
				xTaskGetTickCountFromISR(out a5_2655);
			}
			else
			{
				word32 a5_2654;
				xTaskGetTickCount(out a5_2654);
			}
			goto l230369CA;
		}
l230369A6:
		dwLoc48_2478 = SEQ(SLICE(dwLoc48_959, word24, 8), 0x00);
		if ((word32) s0_175->bFFFFFC5C <= 0x04)
		{
			dwLoc48_2478 = SEQ(SLICE(dwLoc48_959, word24, 8), 0x00);
			if ((word32) *((word32) s2_125 - 697) <= 0x04)
			{
				if (s3_126->dwFFFFFE84 != 0x00)
				{
					word32 a5_2670;
					xTaskGetTickCountFromISR(out a5_2670);
				}
				else
				{
					word32 a5_2669;
					xTaskGetTickCount(out a5_2669);
				}
l230369CA:
				a3_505 = s4_219 + -0x0588;
				a0_507 = (struct Eq_274 *) &g_t23084B3C;
l2303687E:
				word32 a1_2657;
				word32 a2_2658;
				word32 s6_2662;
				word32 s8_2663;
				word32 s10_2665;
				word32 s11_2666;
				word32 s9_2664;
				word32 s5_2661;
				word32 a4_2659;
				word32 a5_2660;
				word32 a0_2656;
				ra_108 = bl_printk(ra_108, a0_507, a3_505, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18_1007, ra, out s1_109, out a0_2656, out a1_2657, out a2_2658, out a3_209, out a4_2659, out a5_2660, out s2_125, out s3_126, out s4_219, out s5_2661, out s6_2662, out s7_155, out s8_2663, out s9_2664, out s10_2665, out s11_2666);
				dwLoc48_2478 = SEQ(bLoc45_1021, bLoc46_1013, bLoc47_1009, 0x00);
			}
		}
l2303678A:
		a5_100 = (word32) (byte) dwLoc48_2478;
		a4_106 = 0x01;
		if (a5_100 == 0x01)
		{
			Eq_2 a4_758 = (word32) s0_175->bFFFFFC5C;
			Eq_2 a5_759 = 0x02;
			dwLoc48_1481 = dwLoc48_2478;
			if (a4_758 <= 0x02)
			{
				a4_758 = (word32) *((word32) s2_125 - 697);
				if (a4_758 <= 0x02)
				{
					Eq_2 a5_763;
					if (s3_126->dwFFFFFE84 != 0x00)
						xTaskGetTickCountFromISR(out a5_763);
					else
						xTaskGetTickCount(out a5_763);
					dwArg00 = a5_763;
					word32 s9_2595;
					word32 s10_2596;
					word32 s11_2597;
					word32 s5_2592;
					word32 s8_2594;
					word32 s6_2593;
					word32 s4_2591;
					word32 a1_2588;
					word32 s3_2590;
					word32 a2_2589;
					word32 a0_2587;
					ra_108 = bl_printk(ra_108, &g_t23084BBC, dwArg0174 + -0x0588, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18_1007, ra, out s1_109, out a0_2587, out a1_2588, out a2_2589, out a3_209, out a4_758, out a5_759, out s2_125, out s3_2590, out s4_2591, out s5_2592, out s6_2593, out s7_155, out s8_2594, out s9_2595, out s10_2596, out s11_2597);
				}
			}
			ra_108 = loopset_led_trigger(ra_108, s1_109, a3_209, a4_758, a5_759, s2_125, mstatus, dwLoc78, dwLoc6C, dwLoc60, dwLoc5C, dwLoc48_2478, dwLoc30, dwLoc2C, dwLoc28, dwLoc08, dwArg14, dwArg1C, dwArg64, dwArg80, dwArg84, dwArg98, dwArgA8, dwArgD8, out s0_175, out s1_109, out a4_106, out a5_100, out s2_125, out s3_126, out mstatus);
		}
		else if (a5_100 == 0x00)
		{
			a4_106 = (word32) s0_175->bFFFFFC5C;
			a5_100 = 0x04;
			if (a4_106 <= 0x04)
			{
				a4_106 = (word32) *((word32) s2_125 - 697);
				if (a4_106 <= 0x04)
				{
					if (s3_126->dwFFFFFE84 != 0x00)
					{
						word32 a5_2586;
						xTaskGetTickCountFromISR(out a5_2586);
					}
					else
					{
						word32 a5_2585;
						xTaskGetTickCount(out a5_2585);
					}
					word32 a3_2601;
					word32 s4_2602;
					word32 s9_2606;
					word32 s10_2607;
					word32 s11_2608;
					word32 s8_2605;
					word32 s5_2603;
					word32 s6_2604;
					word32 a0_2598;
					word32 a2_2600;
					word32 a1_2599;
					ra_108 = bl_printk(ra_108, &g_t23084B8C, s4_219 + -0x0588, dwLoc78, s10, dwLoc10, dwLoc0C, dwArg18_1007, ra, out s1_109, out a0_2598, out a1_2599, out a2_2600, out a3_2601, out a4_106, out a5_100, out s2_125, out s3_126, out s4_2602, out s5_2603, out s6_2604, out s7_155, out s8_2605, out s9_2606, out s10_2607, out s11_2608);
				}
			}
		}
		s7_122 = s7_155 + 0x01;
		dwLoc48_959 = dwLoc48_1481;
	}
	s0Out = s0_175;
	a3Out = dwLoc14;
	a4Out = a4_106;
	a5Out = a5_100;
	s2Out = s2_125;
	s3Out = s3_126;
	return dwArg0158;
}

