pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23037120: Register Eq_2 hal_board_cfg(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg94, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgF4, Register out ptr32 gpOut)
// Called from:
//      bfl_main
Eq_2 hal_board_cfg(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 s2, Eq_2 s4, Eq_2 s6, Eq_2 s8, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg94, Eq_2 dwArgD4, Eq_2 dwArgF4, ptr32 & gpOut)
{
	byte bLoc79_7680 = SLICE(dwLoc7C, byte, 24);
	byte bLoc7A_7727 = SLICE(dwLoc7C, byte, 16);
	word16 wLoc7C_8087 = (word16) dwLoc7C;
	byte bLoc7C_12057 = (byte) dwLoc7C;
	byte bLoc7B_12058 = SLICE(dwLoc7C, byte, 8);
	word16 wLocB0_11868 = (word16) nLocB0;
	word32 s1_45;
	word32 a3_12775;
	word32 a5_12776;
	word32 a0_12774;
	word32 s2_115;
	struct Eq_174423 * s0_44 = hal_boot2_partition_addr_active(587746720, s1, out s1_45, out a0_12774, out a3_12775, out a5_12776, out s2_115);
	struct Eq_174433 * sp_3 = fp + -0x0100;
	union Eq_2 * s3_108 = s1_45 + -308;
	if ((word32) s0_44->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_12778;
			xTaskGetTickCountFromISR(out a5_12778);
		}
		else
		{
			word32 a5_12777;
			xTaskGetTickCount(out a5_12777);
		}
		word32 a1_12787;
		word32 a3_12789;
		word32 a5_12791;
		word32 s4_12792;
		word32 s6_12794;
		word32 s8_12796;
		word32 s9_12797;
		word32 s11_12799;
		word32 s10_12798;
		word32 s7_12795;
		word32 s5_12793;
		word32 a4_12790;
		word32 a2_12788;
		word32 a0_12786;
		word32 s1_12785;
		ra = bl_printk(ra, &g_t23084DB4, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_12785, out a0_12786, out a1_12787, out a2_12788, out a3_12789, out a4_12790, out a5_12791, out s2_115, out s3_108, out s4_12792, out s5_12793, out s6_12794, out s7_12795, out s8_12796, out s9_12797, out s10_12798, out s11_12799);
	}
	if (*s3_108 == 0x00)
	{
		if ((word32) s0_44->bFFFFFC5C <= 0x04 && (word32) g_b4201FD49 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_12784;
				xTaskGetTickCountFromISR(out a5_12784);
			}
			else
			{
				word32 a5_12783;
				xTaskGetTickCount(out a5_12783);
			}
			word32 s8_12813;
			word32 s9_12814;
			word32 s10_12815;
			word32 s11_12816;
			word32 a0_12801;
			word32 a1_12802;
			word32 a4_12805;
			word32 s5_12810;
			word32 s7_12812;
			word32 s6_12811;
			word32 a5_12806;
			word32 s4_12809;
			word32 s3_12808;
			word32 s2_12807;
			word32 a3_12804;
			word32 a2_12803;
			word32 s1_12800;
			bl_printk(ra, &g_t23084E08, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_12800, out a0_12801, out a1_12802, out a2_12803, out a3_12804, out a4_12805, out a5_12806, out s2_12807, out s3_12808, out s4_12809, out s5_12810, out s6_12811, out s7_12812, out s8_12813, out s9_12814, out s10_12815, out s11_12816);
		}
		while (true)
			;
	}
	word32 a0_12780;
	word32 a5_12782;
	word32 a3_12781;
	word32 s1_12779;
	union Eq_2 * s3_128;
	Eq_2 s2_127;
	Eq_2 s6_131;
	struct Eq_174475 * s0_125 = hal_boot2_partition_bus_addr_active(s2_115 + -608, s1, out s1_12779, out a0_12780, out a3_12781, out a5_12782, out s2_127, out s3_128, out s6_131);
	if ((word32) s0_125->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_12818;
			xTaskGetTickCountFromISR(out a5_12818);
		}
		else
		{
			word32 a5_12817;
			xTaskGetTickCount(out a5_12817);
		}
		word32 a4_12830;
		word32 s4_12832;
		word32 s7_12834;
		word32 s11_12838;
		word32 s8_12835;
		word32 s10_12837;
		word32 s9_12836;
		word32 s5_12833;
		word32 a5_12831;
		word32 a3_12829;
		word32 a1_12827;
		word32 a2_12828;
		word32 a0_12826;
		word32 s1_12825;
		ra = bl_printk(ra, &g_t23084E68, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_12825, out a0_12826, out a1_12827, out a2_12828, out a3_12829, out a4_12830, out a5_12831, out s2_127, out s3_128, out s4_12832, out s5_12833, out s6_131, out s7_12834, out s8_12835, out s9_12836, out s10_12837, out s11_12838);
	}
	Eq_2 s1_192 = *s3_128;
	if (s1_192 == 0x00)
	{
		if ((word32) s0_125->bFFFFFC5C <= 0x04 && (word32) g_b4201FD49 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_12824;
				xTaskGetTickCountFromISR(out a5_12824);
			}
			else
			{
				word32 a5_12823;
				xTaskGetTickCount(out a5_12823);
			}
			word32 s1_12839;
			word32 a1_12841;
			word32 a3_12843;
			word32 a4_12844;
			word32 s2_12846;
			word32 s4_12848;
			word32 s5_12849;
			word32 s9_12853;
			word32 s10_12854;
			word32 s11_12855;
			word32 s7_12851;
			word32 s8_12852;
			word32 s6_12850;
			word32 s3_12847;
			word32 a5_12845;
			word32 a2_12842;
			word32 a0_12840;
			bl_printk(ra, &g_t23084EBC, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_12839, out a0_12840, out a1_12841, out a2_12842, out a3_12843, out a4_12844, out a5_12845, out s2_12846, out s3_12847, out s4_12848, out s5_12849, out s6_12850, out s7_12851, out s8_12852, out s9_12853, out s10_12854, out s11_12855);
		}
		while (true)
			;
	}
	int32 a0_202;
	struct Eq_174619 * s0_211;
	word32 a5_12819;
	word32 s3_12820;
	word32 s5_12822;
	word32 s4_12821;
	Eq_2 s1_212;
	Eq_2 s2_213;
	Eq_2 s6_217;
	Eq_2 ra_210 = fdt_subnode_offset(ra, s1_192, s1_192, 0x23072C3C, s2_127, s6_131, dwLocF8, dwLocC8, s9, out s0_211, out s1_212, out a0_202, out a5_12819, out s2_213, out s3_12820, out s4_12821, out s5_12822, out s6_217);
	if (a0_202 <= 0x00 && ((word32) s0_211->bFFFFFC5C <= 0x04 && (word32) g_b4201FD49 <= 0x04))
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_12862;
			xTaskGetTickCountFromISR(out a5_12862);
		}
		else
		{
			word32 a5_12861;
			xTaskGetTickCount(out a5_12861);
		}
		word32 a1_12894;
		word32 a3_12896;
		word32 a4_12897;
		word32 s5_12901;
		word32 s7_12902;
		word32 s10_12905;
		word32 s11_12906;
		word32 s9_12904;
		word32 s8_12903;
		word32 s3_12899;
		word32 s4_12900;
		word32 a5_12898;
		word32 a2_12895;
		word32 a0_12893;
		ra_210 = bl_printk(ra_210, &g_t230806B8, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_212, out a0_12893, out a1_12894, out a2_12895, out a3_12896, out a4_12897, out a5_12898, out s2_213, out s3_12899, out s4_12900, out s5_12901, out s6_217, out s7_12902, out s8_12903, out s9_12904, out s10_12905, out s11_12906);
	}
	Eq_2 a0_278;
	Eq_2 s3_290;
	word32 a5_12857;
	word32 s2_12858;
	word32 s5_12860;
	word32 s4_12859;
	word32 s0_12856;
	Eq_2 s1_1327;
	Eq_2 s6_1332;
	Eq_2 ra_1325 = fdt_subnode_offset(ra_210, s1_212, s1_212, 0x23080968, s2_213, s6_217, dwLocF8, dwLocC8, s9, out s0_12856, out s1_1327, out a0_278, out a5_12857, out s2_12858, out s3_290, out s4_12859, out s5_12860, out s6_1332);
	Eq_2 s2_1328 = a0_278;
	if (a0_278 > 0x00)
	{
		dwLocD0.u0 = 0x00;
		word32 a0_305;
		word32 s3_317;
		word32 s6_12872;
		word32 s8_12873;
		word32 s0_12868;
		word32 s4_12870;
		word32 s5_12871;
		word32 s2_12869;
		Eq_2 s1_315;
		Eq_2 ra_313 = fdt_stringlist_count(ra_1325, s1_1327, 587747096, a0_278, dwLocF8, dwLocDC, dwLoc48, s9, out s0_12868, out s1_315, out a0_305, out s2_12869, out s3_317, out s4_12870, out s5_12871, out s6_12872, out s8_12873);
		if (a0_305 == 0x01)
		{
			Eq_2 a0_331;
			word32 s3_12887;
			word32 s6_12889;
			word32 s8_12890;
			word32 s5_12888;
			word32 a5_12886;
			word32 a1_12883;
			word32 a4_12885;
			word32 a3_12884;
			Eq_2 a2_333;
			struct Eq_166956 * s0_340;
			int32 s2_342;
			ptr32 s4_344;
			fdt_stringlist_get(ra_313, s1_315, s3_317 + -232, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_340, out s1_315, out a0_331, out a1_12883, out a2_333, out a3_12884, out a4_12885, out a5_12886, out s2_342, out s3_12887, out s4_344, out s5_12888, out s6_12889, out s8_12890);
			Eq_2 s5_353 = a0_331;
			if ((word32) s0_340->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_12892;
					xTaskGetTickCountFromISR(out a5_12892);
				}
				else
				{
					word32 a5_12891;
					xTaskGetTickCount(out a5_12891);
				}
				word32 a5_12925;
				word32 s7_12928;
				word32 s9_12930;
				word32 s11_12932;
				word32 s10_12931;
				word32 s8_12929;
				word32 s6_12927;
				word32 s3_12926;
				word32 a4_12924;
				word32 a3_12923;
				word32 a1_12922;
				word32 a0_12921;
				bl_printk(dwArgF4, &g_t23084F24, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_315, out a0_12921, out a1_12922, out a2_333, out a3_12923, out a4_12924, out a5_12925, out s2_342, out s3_12926, out s4_344, out s5_353, out s6_12927, out s7_12928, out s8_12929, out s9_12930, out s10_12931, out s11_12932);
			}
			ra_313 = dwArg94;
			struct Eq_166962 * s3_399 = (struct Eq_166962 *) 0x02;
			if (a2_333 <= 0x02)
			{
				word32 a6_13050;
				word32 a7_13051;
				word32 a4_13048;
				word32 a5_13049;
				word32 a1_13045;
				word32 a3_13047;
				word32 a2_13046;
				memcpy(fp + -0x00B0, s5_353, a2_333, out a1_13045, out a2_13046, out a3_13047, out a4_13048, out a5_13049, out a6_13050, out a7_13051);
				nLocB0 = (uint24) wLocB0_11868;
				if ((word32) s0_340->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_13057;
						xTaskGetTickCountFromISR(out a5_13057);
					}
					else
					{
						word32 a5_13056;
						xTaskGetTickCount(out a5_13056);
					}
					word32 a0_13074;
					word32 a1_13075;
					word32 a3_13077;
					word32 a5_13079;
					word32 s5_13080;
					word32 s9_13084;
					word32 s10_13085;
					word32 s11_13086;
					word32 s7_13082;
					word32 s8_13083;
					word32 s6_13081;
					word32 a4_13078;
					word32 a2_13076;
					ra_313 = bl_printk(dwArg94, &g_t23084F50, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_315, out a0_13074, out a1_13075, out a2_13076, out a3_13077, out a4_13078, out a5_13079, out s2_342, out s3_399, out s4_344, out s5_13080, out s6_13081, out s7_13082, out s8_13083, out s9_13084, out s10_13085, out s11_13086);
				}
				word32 a4_13054;
				word32 a5_13055;
				word32 a1_13052;
				word32 a2_13053;
				Eq_2 a3_467;
				Eq_2 s10_472 = strlen(fp + -0x00B0, out a1_13052, out a2_13053, out a3_467, out a4_13054, out a5_13055);
				Eq_2 s5_473 = 0x00;
				struct Eq_175711 * s7_475 = &g_t4200E000;
				word32 s11_478 = 0x23085000;
				do
				{
					int32 s5_670;
					int32 s3_679;
					if (s5_473 >= s10_472)
						break;
					word32 s5_510;
					struct Eq_274 * a0_587;
					Eq_2 a3_582;
					word32 a5_485 = CONVERT(Mem484[sp_3 + 80 + s5_473:byte], byte, word32);
					if (a5_485 != 70)
					{
						if (a5_485 != 77)
						{
							if (g_t4200DE84 != 0x00)
							{
								word32 a5_13091;
								xTaskGetTickCountFromISR(out a5_13091);
							}
							else
							{
								word32 a5_13090;
								xTaskGetTickCount(out a5_13090);
							}
							word32 s11_13108;
							word32 a0_13093;
							word32 a2_13095;
							word32 a3_13096;
							word32 a4_13097;
							word32 s10_13107;
							word32 s9_13106;
							word32 a5_13098;
							word32 s8_13105;
							word32 s7_13104;
							word32 s2_13099;
							word32 s3_13100;
							word32 s4_13101;
							word32 s6_13103;
							word32 s5_13102;
							word32 a1_13094;
							word32 s1_13092;
							bl_printk(ra_313, &g_t2307C074, 587746728, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13092, out a0_13093, out a1_13094, out a2_13095, out a3_13096, out a4_13097, out a5_13098, out s2_13099, out s3_13100, out s4_13101, out s5_13102, out s6_13103, out s7_13104, out s8_13105, out s9_13106, out s10_13107, out s11_13108);
							while (true)
								;
						}
						sp_3->t0080.u1 = 0x00;
						word32 a0_732;
						struct Eq_175892 * s6_750;
						word32 s8_752;
						ra_313 = bl_efuse_read_capcode(ra_313, s0_340, s1_315, &sp_3->t0080, a3_467, (struct Eq_277262 **) 77, s2_342, s3_399, s4_344, mstatus, sp_3->t0028, sp_3->t0040, sp_3->t0044, sp_3->t0068, sp_3->t008C, out s0_340, out s1_315, out a0_732, out a3_467, out s2_342, out s3_399, out s4_344, out s5_510, out s6_750, out s7_475, out s8_752, out s10_472, out s11_478, out mstatus);
						if (a0_732 == 0x00)
						{
							s5_670 = (word32) sp_3->t0080;
							if ((word32) s0_340->bFFFFFC5C <= 0x01)
							{
								s3_679 = s5_670;
								if ((word32) g_b4201FD49 > 0x01)
									goto l23037596;
								if (g_t4200DE84 != 0x00)
								{
									word32 a5_13132;
									xTaskGetTickCountFromISR(out a5_13132);
								}
								else
								{
									word32 a5_13131;
									xTaskGetTickCount(out a5_13131);
								}
								word32 a2_13158;
								word32 a4_13160;
								word32 s3_13162;
								word32 s4_13163;
								word32 s7_13165;
								word32 s9_13167;
								word32 s10_13168;
								word32 s11_13169;
								word32 s8_13166;
								word32 s6_13164;
								word32 a5_13161;
								word32 a3_13159;
								word32 a1_13157;
								word32 a0_13156;
								word32 s1_13155;
								ra_313 = bl_printk(ra_313, &g_t2308502C, 587746728, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13155, out a0_13156, out a1_13157, out a2_13158, out a3_13159, out a4_13160, out a5_13161, out s2_342, out s3_13162, out s4_13163, out s5_670, out s6_13164, out s7_13165, out s8_13166, out s9_13167, out s10_13168, out s11_13169);
							}
							s3_679 = s5_670;
							goto l23037596;
						}
						if ((word32) s0_340->bFFFFFC5C > 0x01 || (word32) s6_750->bFFFFFD49 > 0x01)
							goto l23037904;
						if (s7_475->dwFFFFFE84 != 0x00)
						{
							word32 a5_13171;
							xTaskGetTickCountFromISR(out a5_13171);
						}
						else
						{
							word32 a5_13170;
							xTaskGetTickCount(out a5_13170);
						}
						a3_582 = s8_752 + -600;
						a0_587 = (struct Eq_274 *) &g_t23085058;
						goto l23037900;
					}
					sp_3->t0040.u0 = 0x00;
					struct Eq_166962 * a0_496;
					word32 a4_500;
					word32 a5_13088;
					word32 s3_13089;
					word32 a1_13087;
					struct Eq_175847 * s6_511;
					word32 s8_512;
					ra_313 = fdt_getprop(ra_313, s1_315, 0x23080970, sp_3->t0008, sp_3->t0028, sp_3->t0044, sp_3->t00D8, sp_3->t0108, out s0_340, out s1_315, out a0_496, out a1_13087, out a3_467, out a4_500, out a5_13088, out s2_342, out s3_13089, out s4_344, out s5_510, out s6_511, out s8_512);
					sp_3 = sp_3->ptr00C4;
					s3_399 = a0_496;
					if (a4_500 == 0x14)
					{
						if ((word32) s0_340->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
						{
							Eq_2 a0_594;
							if (g_t4200DE84 != 0x00)
							{
								word32 a5_13111;
								a0_594 = xTaskGetTickCountFromISR(out a5_13111);
							}
							else
							{
								word32 a5_13110;
								a0_594 = xTaskGetTickCount(out a5_13110);
							}
							sp_3->t0090 = a0_594;
							fdt32_to_cpu(a0_496->dw0000);
							fdt32_to_cpu(a0_496->dw0004);
							fdt32_to_cpu(a0_496->t0008);
							Eq_2 a0_618 = fdt32_to_cpu(a0_496->t000C);
							sp_3->t0080 = fdt32_to_cpu(a0_496->t0010) & 0x00FF;
							sp_3->dw0000 = a0_618 & 0x00FF;
							word32 a0_13113;
							word32 a2_13115;
							word32 a3_13116;
							word32 a5_13118;
							word32 s5_13120;
							word32 s6_13121;
							word32 s7_13122;
							word32 s11_13126;
							word32 s8_13123;
							word32 s10_13125;
							word32 s9_13124;
							word32 s4_13119;
							word32 a4_13117;
							word32 a1_13114;
							word32 s1_13112;
							ra_313 = bl_printk(ra_313, &g_t23084F78, 587746728, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13112, out a0_13113, out a1_13114, out a2_13115, out a3_13116, out a4_13117, out a5_13118, out s2_342, out s3_399, out s4_13119, out s5_13120, out s6_13121, out s7_13122, out s8_13123, out s9_13124, out s10_13125, out s11_13126);
						}
						s5_670 = fdt32_to_cpu(s3_399->dw0000) & 0x00FF;
						s3_679 = fdt32_to_cpu(s3_399->dw0004) & 0x00FF;
						if ((word32) s0_340->bFFFFFC5C <= 0x01 && (word32) g_b4201FD49 <= 0x01)
						{
							if (g_t4200DE84 != 0x00)
							{
								word32 a5_13128;
								xTaskGetTickCountFromISR(out a5_13128);
							}
							else
							{
								word32 a5_13127;
								xTaskGetTickCount(out a5_13127);
							}
							word32 s7_13142;
							word32 s9_13144;
							word32 s11_13146;
							word32 s10_13145;
							word32 s8_13143;
							word32 s4_13140;
							word32 s6_13141;
							word32 a4_13138;
							word32 a5_13139;
							word32 a2_13136;
							word32 a3_13137;
							word32 s1_13133;
							word32 a1_13135;
							word32 a0_13134;
							ra_313 = bl_printk(ra_313, &g_t23084FD4, 587746728, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13133, out a0_13134, out a1_13135, out a2_13136, out a3_13137, out a4_13138, out a5_13139, out s2_342, out s3_679, out s4_13140, out s5_670, out s6_13141, out s7_13142, out s8_13143, out s9_13144, out s10_13145, out s11_13146);
						}
						goto l23037596;
					}
					if ((word32) s0_340->bFFFFFC5C <= 0x04)
					{
						if ((word32) s6_511->bFFFFFD49 <= 0x04)
						{
							if (s7_475->dwFFFFFE84 != 0x00)
							{
								word32 a5_13130;
								xTaskGetTickCountFromISR(out a5_13130);
							}
							else
							{
								word32 a5_13129;
								xTaskGetTickCount(out a5_13129);
							}
							word32 a0_13149;
							word32 a2_13151;
							word32 a5_13153;
							word32 s9_13154;
							word32 a4_13152;
							word32 a1_13150;
							ra_313 = bl_printk(ra_313, s11_478 + -80, s8_512 + -600, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_315, out a0_13149, out a1_13150, out a2_13151, out a3_467, out a4_13152, out a5_13153, out s2_342, out s3_399, out s4_344, out s5_510, out s6_511, out s7_475, out s8_512, out s9_13154, out s10_472, out s11_478);
						}
						if ((word32) s0_340->bFFFFFC5C <= 0x01 && (word32) s6_511->bFFFFFD49 <= 0x01)
						{
							if (s7_475->dwFFFFFE84 != 0x00)
							{
								word32 a5_13148;
								xTaskGetTickCountFromISR(out a5_13148);
							}
							else
							{
								word32 a5_13147;
								xTaskGetTickCount(out a5_13147);
							}
							a3_582 = s8_512 + -600;
							a0_587 = (struct Eq_274 *) &g_t23085000;
l23037900:
							word32 a0_13172;
							word32 a1_13173;
							word32 a5_13176;
							word32 s6_13177;
							word32 s9_13179;
							word32 s8_13178;
							word32 a4_13175;
							word32 a2_13174;
							ra_313 = bl_printk(ra_313, a0_587, a3_582, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_315, out a0_13172, out a1_13173, out a2_13174, out a3_467, out a4_13175, out a5_13176, out s2_342, out s3_399, out s4_344, out s5_510, out s6_13177, out s7_475, out s8_13178, out s9_13179, out s10_472, out s11_478);
						}
					}
l23037904:
					s5_473 = s5_510 + 0x01;
				} while (s5_473 != 0x02);
				if ((word32) s0_340->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_13181;
						xTaskGetTickCountFromISR(out a5_13181);
					}
					else
					{
						word32 a5_13180;
						xTaskGetTickCount(out a5_13180);
					}
					word32 s10_13196;
					word32 s11_13197;
					word32 a0_13183;
					word32 a1_13184;
					word32 a2_13185;
					word32 s9_13195;
					word32 s8_13194;
					word32 a3_13186;
					word32 s7_13193;
					word32 s6_13192;
					word32 a4_13187;
					word32 a5_13188;
					word32 s3_13189;
					word32 s5_13191;
					word32 s4_13190;
					word32 s1_13182;
					ra_313 = bl_printk(ra_313, &g_t23085084, 587746728, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_13182, out a0_13183, out a1_13184, out a2_13185, out a3_13186, out a4_13187, out a5_13188, out s2_342, out s3_13189, out s4_13190, out s5_13191, out s6_13192, out s7_13193, out s8_13194, out s9_13195, out s10_13196, out s11_13197);
				}
				s3_679 = 50;
				s5_670 = 50;
l23037596:
				word32 a3_13109;
				ra_313 = hal_sys_capcode_update(ra_313, s5_670, s3_679 & 0x00FF, s2_342, s3_679, sp_3->dw0000, sp_3->dw0004, sp_3->t0028, sp_3->t0048, out s1_315, out a3_13109);
			}
		}
		int32 a4_969;
		struct Eq_174840 * s0_974;
		word32 s3_12878;
		word32 s5_12880;
		word32 s8_12882;
		word32 s6_12881;
		word32 s4_12879;
		word32 s2_12877;
		word32 a3_12875;
		word32 a5_12876;
		word32 a1_12874;
		Eq_2 a0_1034;
		Eq_2 s1_1019;
		Eq_2 ra_1018 = fdt_getprop(ra_313, s1_315, 0x230809E4, sp_3->t0008, sp_3->t0028, sp_3->t0044, sp_3->t00D8, sp_3->t0108, out s0_974, out s1_1019, out a0_1034, out a1_12874, out a3_12875, out a4_969, out a5_12876, out s2_12877, out s3_12878, out s4_12879, out s5_12880, out s6_12881, out s8_12882);
		Eq_2 s6_1088 = a0_1034;
		if (a4_969 == 60)
		{
			int32 s3_1032;
			Eq_2 s5_1033 = 60;
			for (s3_1032 = 0x00; s3_1032 != 60; s3_1032 += 0x04)
			{
				a0_1034 = fdt32_to_cpu(a0_1034);
				*a0_1034 = (char *) &sp_3->t0080 + s3_1032;
			}
			if ((word32) s0_974->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_12920;
					xTaskGetTickCountFromISR(out a5_12920);
				}
				else
				{
					word32 a5_12919;
					xTaskGetTickCount(out a5_12919);
				}
				word32 s9_12959;
				word32 s11_12961;
				word32 s10_12960;
				word32 s7_12957;
				word32 s8_12958;
				word32 a0_12948;
				word32 s3_12955;
				word32 s4_12956;
				word32 a1_12949;
				word32 a5_12953;
				word32 s2_12954;
				word32 a2_12950;
				word32 a4_12952;
				word32 a3_12951;
				word32 s1_12947;
				ra_1018 = bl_printk(ra_1018, &g_t23080A2C, 587746728, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_12947, out a0_12948, out a1_12949, out a2_12950, out a3_12951, out a4_12952, out a5_12953, out s2_12954, out s3_12955, out s4_12956, out s5_1033, out s6_1088, out s7_12957, out s8_12958, out s9_12959, out s10_12960, out s11_12961);
			}
			word32 a5_12910;
			word32 s3_12912;
			word32 s4_12913;
			word32 s5_12914;
			word32 s6_12915;
			word32 s7_12916;
			word32 s8_12917;
			word32 s9_12918;
			word32 s2_12911;
			word32 a4_12909;
			word32 a3_12908;
			word32 s0_12907;
			ra_1018 = log_buf_out(ra_1018, &sp_3->t0080, 60, 0x00, s5_1033, s6_1088, sp_3->t0014, sp_3->t0020, sp_3->t0024, sp_3->t0030, sp_3->t0058, sp_3->t006C, sp_3->t007C, sp_3->dw010C, out s0_12907, out s1_1019, out a3_12908, out a4_12909, out a5_12910, out s2_12911, out s3_12912, out s4_12913, out s5_12914, out s6_12915, out s7_12916, out s8_12917, out s9_12918);
		}
		else if ((word32) s0_974->bFFFFFC5C <= 0x04 && (word32) g_b4201FD49 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_13044;
				xTaskGetTickCountFromISR(out a5_13044);
			}
			else
			{
				word32 a5_13043;
				xTaskGetTickCount(out a5_13043);
			}
			word32 a2_13060;
			word32 a3_13061;
			word32 a5_13063;
			word32 s3_13065;
			word32 s8_13070;
			word32 s10_13072;
			word32 s11_13073;
			word32 s9_13071;
			word32 s7_13069;
			word32 s4_13066;
			word32 s6_13068;
			word32 s5_13067;
			word32 s2_13064;
			word32 a4_13062;
			word32 a0_13058;
			word32 a1_13059;
