pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
			ra_1018 = bl_printk(ra_1018, &g_t23080A6C, 587746728, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_1019, out a0_13058, out a1_13059, out a2_13060, out a3_13061, out a4_13062, out a5_13063, out s2_13064, out s3_13065, out s4_13066, out s5_13067, out s6_13068, out s7_13069, out s8_13070, out s9_13071, out s10_13072, out s11_13073);
		}
		int32 * a0_1141;
		int32 a4_1145;
		struct Eq_175117 * s0_1150;
		word32 a1_13034;
		word32 s6_13041;
		word32 s8_13042;
		word32 s4_13039;
		word32 s5_13040;
		word32 s3_13038;
		word32 a3_13035;
		word32 s2_13037;
		word32 a5_13036;
		Eq_2 s1_1151;
		Eq_2 ra_1149 = fdt_getprop(ra_1018, s1_1019, 0x23080A58, sp_3->t0008, sp_3->t0028, sp_3->t0044, sp_3->t00D8, sp_3->t0108, out s0_1150, out s1_1151, out a0_1141, out a1_13034, out a3_13035, out a4_1145, out a5_13036, out s2_13037, out s3_13038, out s4_13039, out s5_13040, out s6_13041, out s8_13042);
		if (a4_1145 == 56)
		{
			Eq_2 s5_1207 = (char *) &sp_3->t0058 + 8;
			int32 * s3_1208 = a0_1141;
			Eq_2 s6_1210 = s5_1207;
			do
			{
				s5_1207 = (word32) s5_1207 + 2;
				*((word32) s5_1207 + 0x0FFE) = (word16) fdt32_to_cpu(*s3_1208);
				++s3_1208;
			} while (a0_1141 + 0x0E != s3_1208);
			if ((word32) s0_1150->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_12946;
					xTaskGetTickCountFromISR(out a5_12946);
				}
				else
				{
					word32 a5_12945;
					xTaskGetTickCount(out a5_12945);
				}
				word32 s7_12972;
				word32 s2_12969;
				word32 a2_12965;
				word32 a3_12966;
				word32 s8_12973;
				word32 s10_12975;
				word32 s11_12976;
				word32 s9_12974;
				word32 s3_12970;
				word32 s4_12971;
				word32 a4_12967;
				word32 a5_12968;
				word32 a0_12963;
				word32 a1_12964;
				word32 s1_12962;
				ra_1149 = bl_printk(ra_1149, &g_t23080A9C, 587746728, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_12962, out a0_12963, out a1_12964, out a2_12965, out a3_12966, out a4_12967, out a5_12968, out s2_12969, out s3_12970, out s4_12971, out s5_1207, out s6_1210, out s7_12972, out s8_12973, out s9_12974, out s10_12975, out s11_12976);
			}
			word32 s0_12933;
			word32 a4_12935;
			word32 s2_12937;
			word32 s3_12938;
			word32 s4_12939;
			word32 s9_12944;
			word32 s8_12943;
			word32 s5_12940;
			word32 s7_12942;
			word32 s6_12941;
			word32 a5_12936;
			word32 a3_12934;
			ra_1149 = log_buf_out(ra_1149, s6_1210, 56, 0x00, s5_1207, s6_1210, sp_3->t0014, sp_3->t0020, sp_3->t0024, sp_3->t0030, sp_3->t0058, sp_3->t006C, sp_3->t007C, sp_3->dw010C, out s0_12933, out s1_1151, out a3_12934, out a4_12935, out a5_12936, out s2_12937, out s3_12938, out s4_12939, out s5_12940, out s6_12941, out s7_12942, out s8_12943, out s9_12944);
		}
		else if ((word32) s0_1150->bFFFFFC5C <= 0x04 && (word32) g_b4201FD49 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_12987;
				xTaskGetTickCountFromISR(out a5_12987);
			}
			else
			{
				word32 a5_12986;
				xTaskGetTickCount(out a5_12986);
			}
			word32 a3_13005;
			word32 a5_13007;
			word32 s2_13008;
			word32 s3_13009;
			word32 s4_13010;
			word32 s11_13017;
			word32 s10_13016;
			word32 s5_13011;
			word32 s6_13012;
			word32 s7_13013;
			word32 s9_13015;
			word32 s8_13014;
			word32 a4_13006;
			word32 a2_13004;
			word32 a1_13003;
			word32 a0_13002;
			ra_1149 = bl_printk(ra_1149, &g_t23080AD4, 587746728, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_1151, out a0_13002, out a1_13003, out a2_13004, out a3_13005, out a4_13006, out a5_13007, out s2_13008, out s3_13009, out s4_13010, out s5_13011, out s6_13012, out s7_13013, out s8_13014, out s9_13015, out s10_13016, out s11_13017);
		}
		union Eq_2 * a0_1317;
		word32 a4_1321;
		struct Eq_175332 * s0_1326;
		word32 s3_12982;
		word32 s5_12984;
		word32 s8_12985;
		word32 s4_12983;
		word32 a5_12981;
		word32 a3_12980;
		word32 a1_12979;
		ra_1325 = fdt_getprop(ra_1149, s1_1151, 0x23080AC8, sp_3->t0008, sp_3->t0028, sp_3->t0044, sp_3->t00D8, sp_3->t0108, out s0_1326, out s1_1327, out a0_1317, out a1_12979, out a3_12980, out a4_1321, out a5_12981, out s2_1328, out s3_12982, out s4_12983, out s5_12984, out s6_1332, out s8_12985);
		if (a4_1321 == 0x04)
		{
			if ((word32) s0_1326->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
			{
				Eq_2 a0_1389;
				Eq_2 s2_1388 = *a0_1317;
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_12978;
					a0_1389 = xTaskGetTickCountFromISR(out a5_12978);
				}
				else
				{
					word32 a5_12977;
					a0_1389 = xTaskGetTickCount(out a5_12977);
				}
				sp_3->t0090 = a0_1389;
				fdt32_to_cpu(s2_1388);
				word32 a1_12989;
				word32 a3_12991;
				word32 a4_12992;
				word32 s5_12996;
				word32 s7_12997;
				word32 s10_13000;
				word32 s11_13001;
				word32 s9_12999;
				word32 s8_12998;
				word32 s3_12994;
				word32 s4_12995;
				word32 a5_12993;
				word32 a2_12990;
				word32 a0_12988;
				ra_1325 = bl_printk(ra_1325, &g_t230850AC, 587746728, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_1327, out a0_12988, out a1_12989, out a2_12990, out a3_12991, out a4_12992, out a5_12993, out s2_1328, out s3_12994, out s4_12995, out s5_12996, out s6_1332, out s7_12997, out s8_12998, out s9_12999, out s10_13000, out s11_13001);
			}
		}
		else if ((word32) s0_1326->bFFFFFC5C <= 0x04 && (word32) g_b4201FD49 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_13019;
				xTaskGetTickCountFromISR(out a5_13019);
			}
			else
			{
				word32 a5_13018;
				xTaskGetTickCount(out a5_13018);
			}
			word32 a0_13020;
			word32 a3_13023;
			word32 a5_13025;
			word32 s4_13027;
			word32 s5_13028;
			word32 s8_13030;
			word32 s10_13032;
			word32 s11_13033;
			word32 s9_13031;
			word32 s7_13029;
			word32 s3_13026;
			word32 a4_13024;
			word32 a2_13022;
			word32 a1_13021;
			ra_1325 = bl_printk(ra_1325, &g_t23080B28, 587746728, sp_3->t0008, sp_3->t0028, sp_3->t0070, sp_3->t0074, sp_3->t0098, sp_3->t00BC, out s1_1327, out a0_13020, out a1_13021, out a2_13022, out a3_13023, out a4_13024, out a5_13025, out s2_1328, out s3_13026, out s4_13027, out s5_13028, out s6_1332, out s7_13029, out s8_13030, out s9_13031, out s10_13032, out s11_13033);
		}
	}
	int32 a0_1445;
	word32 s3_12865;
	word32 s4_12866;
	word32 s5_12867;
	word32 a5_12864;
	word32 s0_12863;
	Eq_2 s1_1455;
	Eq_2 s2_1456;
	Eq_2 s6_1460;
	Eq_2 ra_1453 = fdt_subnode_offset(ra_1325, s1_1327, s1_1327, 587728712, s2_1328, s6_1332, dwLocF8, dwLocC8, s9, out s0_12863, out s1_1455, out a0_1445, out a5_12864, out s2_1456, out s3_12865, out s4_12866, out s5_12867, out s6_1460);
	if (a0_1445 > 0x00)
	{
		word32 a0_1471;
		word32 s3_13203;
		word32 s4_13204;
		word32 s8_13206;
		word32 s5_13205;
		word32 s0_13202;
		ra_1453 = fdt_stringlist_count(ra_1453, s1_1455, 587718612, 0x2307E000, dwLocF8, dwLocDC, dwLoc48, s9, out s0_13202, out s1_1455, out a0_1471, out s2_1456, out s3_13203, out s4_13204, out s5_13205, out s6_1460, out s8_13206);
		if (a0_1471 == 0x01)
		{
			Eq_2 a2_1525;
			word32 s9_13230;
			word32 s11_13232;
			word32 s10_13231;
			word32 a0_13208;
			word32 a1_13209;
			word32 s7_13228;
			word32 s8_13229;
			word32 a2_13210;
			word32 s5_13217;
			word32 s8_13219;
			word32 s4_13226;
			word32 s5_13227;
			word32 a0_13220;
			word32 a5_13224;
			word32 s3_13225;
			word32 a1_13221;
			word32 a4_13223;
			word32 a3_13222;
			word32 s6_13218;
			word32 s3_13215;
			word32 s4_13216;
			word32 s2_13214;
			word32 a3_13211;
			word32 a5_13213;
			word32 a4_13212;
			word32 s1_13207;
			struct Eq_166813 * s0_1506;
			ra_1453 = bl_printk(fdt_stringlist_get(ra_1453, s1_1455, (word32) s2_1456 - 44, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_1506, out s1_13207, out a0_13208, out a1_13209, out a2_13210, out a3_13211, out a4_13212, out a5_13213, out s2_13214, out s3_13215, out s4_13216, out s5_13217, out s6_13218, out s8_13219), &g_t230850D4, dwLoc9C, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13220, out a1_13221, out a2_1525, out a3_13222, out a4_13223, out a5_13224, out s2_1456, out s3_13225, out s4_13226, out s5_13227, out s6_1460, out s7_13228, out s8_13229, out s9_13230, out s10_13231, out s11_13232);
			if (a2_1525 <= 0x03)
			{
				Eq_2 a3_1552;
				word32 a5_13236;
				word32 a6_13237;
				word32 a7_13238;
				word32 a2_13234;
				word32 a4_13235;
				word32 a1_13233;
				memcpy(fp - 0x00B0, s2_1456, a2_1525, out a1_13233, out a2_13234, out a3_1552, out a4_13235, out a5_13236, out a6_13237, out a7_13238);
				word32 a1_13240;
				word32 a2_13241;
				word32 a4_13243;
				word32 s2_13245;
				word32 s9_13250;
				word32 s11_13252;
				word32 s10_13251;
				word32 s8_13249;
				word32 s5_13246;
				word32 s7_13248;
				word32 s6_13247;
				word32 a5_13244;
				word32 a3_13242;
				word32 a0_13239;
				word32 s4_1578;
				word32 s3_1577;
				ra_1453 = bl_printk(ra_1453, &g_t230850F4, a3_1552, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13239, out a1_13240, out a2_13241, out a3_13242, out a4_13243, out a5_13244, out s2_13245, out s3_1577, out s4_1578, out s5_13246, out s6_13247, out s7_13248, out s8_13249, out s9_13250, out s10_13251, out s11_13252);
				word32 a2_13254;
				word32 a4_13255;
				word32 a5_13256;
				word32 a1_13253;
				Eq_2 a3_1588;
				Eq_2 s10_1593 = strlen(fp - 0x00B0, out a1_13253, out a2_13254, out a3_1588, out a4_13255, out a5_13256);
				s2_1456.u0 = 0x00;
				struct Eq_176744 * s5_1595 = &g_t42020000;
				s6_1460.u0 = 0x4200E000;
				word32 s7_1597 = 0x23085000;
				word32 s11_1600 = 0x23080000;
				Eq_2 dwLocB0_11890 = (uint32) nLocB0;
				while (s2_1456 < s10_1593)
				{
					struct Eq_274 * a0_1843;
					Eq_2 a3_1839;
					struct Eq_274 * a0_1767;
					int32 a5_1607 = (word32) *((word16) s2_1456.u0 + (fp - 0x00B0));
					if (a5_1607 != 70)
					{
						if (a5_1607 != 77)
						{
							if (a5_1607 != 66)
							{
								if (g_t4200DE84 != 0x00)
								{
									word32 a5_13290;
									xTaskGetTickCountFromISR(out a5_13290);
								}
								else
								{
									word32 a5_13289;
									xTaskGetTickCount(out a5_13289);
								}
								word32 s11_13321;
								word32 s9_13319;
								word32 s10_13320;
								word32 a2_13308;
								word32 a4_13310;
								word32 s7_13317;
								word32 s8_13318;
								word32 a5_13311;
								word32 s5_13315;
								word32 s6_13316;
								word32 s2_13312;
								word32 s4_13314;
								word32 s3_13313;
								word32 a3_13309;
								word32 a0_13306;
								word32 a1_13307;
								word32 s1_13305;
								bl_printk(ra_1453, &g_t2307C074, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13305, out a0_13306, out a1_13307, out a2_13308, out a3_13309, out a4_13310, out a5_13311, out s2_13312, out s3_13313, out s4_13314, out s5_13315, out s6_13316, out s7_13317, out s8_13318, out s9_13319, out s10_13320, out s11_13321);
								while (true)
									;
							}
							ui32 a0_1995 = (word32) bLoc80;
							ui32 a6_1996 = (word32) bLoc7F;
							ui32 a1_1997 = (word32) bLoc7E;
							ui32 a2_1998 = (word32) bLoc7D;
							ui32 a3_1999 = (word32) bLoc7C_12057;
							ui32 a4_2002 = (word32) bLoc7B_12058;
							a3_1588 = a3_1999 | (a2_1998 | (a1_1997 | (a0_1995 | a6_1996)));
							ra_1453 = bl_efuse_read_mac(ra_1453, s0_1506, s1_1455, fp - 0x0080, s2_1456, s3_1577, s4_1578, out s0_1506, out s1_1455, out s2_1456, out s3_1577, out s4_1578);
							ui32 a5_2009 = a0_1995 & a6_1996 & a1_1997 & a2_1998 & a3_1999 & a4_2002;
							if ((a4_2002 | a3_1588) == 0x00 || a5_2009 == 0x01)
							{
								if ((word32) s0_1506->bFFFFFC5C > 0x01 || (word32) s5_1595->bFFFFFD49 > 0x01)
									goto l2303786E;
								if (*((word16) s6_1460.u0 - 380) != 0x00)
								{
									word32 a5_13261;
									xTaskGetTickCountFromISR(out a5_13261);
								}
								else
								{
									word32 a5_13260;
									xTaskGetTickCount(out a5_13260);
								}
								a3_1839 = s7_1597 + -600;
								a0_1843 = (struct Eq_274 *) &g_t2308513C;
								goto l2303786A;
							}
							if ((word32) s0_1506->bFFFFFC5C > 0x01)
								goto l23037B5A;
							if ((word32) g_b4201FD49 > 0x01)
								goto l23037B64;
							if (g_t4200DE84 != 0x00)
							{
								word32 a5_13270;
								xTaskGetTickCountFromISR(out a5_13270);
							}
							else
							{
								word32 a5_13269;
								xTaskGetTickCount(out a5_13269);
							}
							a0_1767 = (struct Eq_274 *) &g_t23085110;
						}
						else
						{
							word32 a0_1850;
							ra_1453 = bl_efuse_read_mac_factory(ra_1453, s0_1506, s1_1455, fp - 0x0080, a3_1588, (word32 *) 77, s2_1456, s3_1577, s4_1578, mstatus, dwLocF8, dwLocD8, dwLocC0, dwLocBC, dwLocB0_11890, dwLocAC, s10, s2, dwLoc74, dwLoc64, out s0_1506, out s1_1455, out a0_1850, out a3_1588, out s2_1456, out s3_1577, out s4_1578, out s5_1595, out s6_1460, out s7_1597, out s10_1593, out s11_1600, out mstatus);
							if (a0_1850 != 0x00)
							{
l230381C0:
								if ((word32) s0_1506->bFFFFFC5C > 0x01 || (word32) s5_1595->bFFFFFD49 > 0x01)
									goto l2303786E;
								if (*((word16) s6_1460.u0 - 380) != 0x00)
								{
									word32 a5_13364;
									xTaskGetTickCountFromISR(out a5_13364);
								}
								else
								{
									word32 a5_13363;
									xTaskGetTickCount(out a5_13363);
								}
								a3_1839 = s7_1597 + -600;
								a0_1843 = (struct Eq_274 *) &g_t23085214;
								goto l2303786A;
							}
							ui32 a0_1879 = (word32) bLoc80;
							ui32 a6_1880 = (word32) bLoc7F;
							ui32 a1_1881 = (word32) bLoc7E;
							ui32 a2_1882 = (word32) bLoc7D;
							ui32 a3_1883 = (word32) bLoc7C_12057;
							ui32 a4_1886 = (word32) bLoc7B_12058;
							a3_1588 = a3_1883 | (a2_1882 | (a1_1881 | (a0_1879 | a6_1880)));
							ui32 a5_1893 = a0_1879 & a6_1880 & a1_1881 & a2_1882 & a3_1883 & a4_1886;
							if ((a4_1886 | a3_1588) == 0x00 || a5_1893 == 0x01)
								goto l230381C0;
							if ((word32) s0_1506->bFFFFFC5C > 0x01)
								goto l23037B5A;
							if ((word32) g_b4201FD49 > 0x01)
								goto l23037B64;
							if (g_t4200DE84 != 0x00)
							{
								word32 a5_13323;
								xTaskGetTickCountFromISR(out a5_13323);
							}
							else
							{
								word32 a5_13322;
								xTaskGetTickCount(out a5_13322);
							}
							a0_1767 = (struct Eq_274 *) &g_t230851E8;
						}
						goto l23037B56;
					}
					struct Eq_274 * a0_1660;
					Eq_2 a3_1654;
					Eq_2 a0_1617;
					word32 a5_1622;
					word32 a1_13257;
					word32 s8_13259;
					word32 a4_13258;
					fdt_getprop(ra_1453, s1_1455, 587728716, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_1506, out s1_1455, out a0_1617, out a1_13257, out a3_1588, out a4_13258, out a5_1622, out s2_1456, out s3_1577, out s4_1578, out s5_1595, out s6_1460, out s8_13259);
					ra_1453 = dwArgF4;
					if (a5_1622 == 0x06)
					{
						word32 a2_13339;
						word32 a4_13341;
						word32 a5_13342;
						word32 a7_13344;
						word32 a6_13343;
						word32 a3_13340;
						word32 a1_13338;
						memcpy(fp - 0x0080, a0_1617, 0x06, out a1_13338, out a2_13339, out a3_13340, out a4_13341, out a5_13342, out a6_13343, out a7_13344);
						bl_wifi_sta_mac_addr_set(fp - 0x0080);
						Eq_2 a0_1696;
						word32 a4_1700;
						word32 a5_1701;
						word32 s8_13346;
						word32 a1_13345;
						fdt_getprop(dwArgF4, s1_1455, 587728764, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_1506, out s1_1455, out a0_1696, out a1_13345, out a3_1588, out a4_1700, out a5_1701, out s2_1456, out s3_1577, out s4_1578, out s5_1595, out s6_1460, out s8_13346);
						ra_1453 = dwArgD4;
						if (a4_1700 != a5_1701)
						{
							if ((word32) s0_1506->bFFFFFC5C > 0x04)
								goto l2303786E;
							if ((word32) s5_1595->bFFFFFD49 > 0x04)
								goto l23038098;
							if (*((word16) s6_1460.u0 - 380) != 0x00)
							{
								word32 a5_13355;
								xTaskGetTickCountFromISR(out a5_13355);
							}
							else
							{
								word32 a5_13354;
								xTaskGetTickCount(out a5_13354);
							}
							a3_1654 = s7_1597 + -600;
							a0_1660 = (struct Eq_274 *) &g_t23085168;
							goto l23038094;
						}
						word32 a1_13347;
						word32 a5_13351;
						word32 a6_13352;
						word32 a7_13353;
						word32 a3_13349;
						word32 a4_13350;
						word32 a2_13348;
						memcpy(fp - 0x0080, a0_1696, 0x06, out a1_13347, out a2_13348, out a3_13349, out a4_13350, out a5_13351, out a6_13352, out a7_13353);
						bl_wifi_ap_mac_addr_set(fp - 0x0080);
						if ((word32) s0_1506->bFFFFFC5C > 0x01)
							goto l23037B5A;
						if ((word32) g_b4201FD49 > 0x01)
							goto l23037B64;
						if (g_t4200DE84 != 0x00)
						{
							word32 a5_13375;
							xTaskGetTickCountFromISR(out a5_13375);
						}
						else
						{
							word32 a5_13374;
							xTaskGetTickCount(out a5_13374);
						}
						a0_1767 = (struct Eq_274 *) &g_t23085190;
l23037B56:
						word32 a3_13327;
						word32 a4_13328;
						word32 s3_13330;
						word32 s5_13332;
						word32 s11_13337;
						word32 s10_13336;
						word32 s7_13333;
						word32 s9_13335;
						word32 s8_13334;
						word32 s4_13331;
						word32 a5_13329;
						word32 a1_13325;
						word32 a2_13326;
						word32 a0_13324;
						ra_1453 = bl_printk(ra_1453, a0_1767, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13324, out a1_13325, out a2_13326, out a3_13327, out a4_13328, out a5_13329, out s2_1456, out s3_13330, out s4_13331, out s5_13332, out s6_1460, out s7_13333, out s8_13334, out s9_13335, out s10_13336, out s11_13337);
						goto l23037B5A;
					}
					if ((word32) s0_1506->bFFFFFC5C <= 0x04)
					{
						if ((word32) s5_1595->bFFFFFD49 <= 0x04)
						{
							if (*((word16) s6_1460.u0 - 380) != 0x00)
							{
								word32 a5_13377;
								xTaskGetTickCountFromISR(out a5_13377);
							}
							else
							{
								word32 a5_13376;
								xTaskGetTickCount(out a5_13376);
							}
							a3_1654 = s7_1597 + -600;
							a0_1660 = s11_1600 + 0x0788;
l23038094:
							word32 a5_13360;
							word32 s9_13362;
							word32 s8_13361;
							word32 a0_13356;
							word32 a4_13359;
							word32 a2_13358;
							word32 a1_13357;
							ra_1453 = bl_printk(ra_1453, a0_1660, a3_1654, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13356, out a1_13357, out a2_13358, out a3_1588, out a4_13359, out a5_13360, out s2_1456, out s3_1577, out s4_1578, out s5_1595, out s6_1460, out s7_1597, out s8_13361, out s9_13362, out s10_1593, out s11_1600);
						}
l23038098:
						if ((word32) s0_1506->bFFFFFC5C <= 0x01 && (word32) s5_1595->bFFFFFD49 <= 0x01)
						{
							if (*((word16) s6_1460.u0 - 380) != 0x00)
							{
								word32 a5_13373;
								xTaskGetTickCountFromISR(out a5_13373);
							}
							else
							{
								word32 a5_13372;
								xTaskGetTickCount(out a5_13372);
							}
							a3_1839 = s7_1597 + -600;
							a0_1843 = (struct Eq_274 *) &g_t230851BC;
l2303786A:
							word32 a0_13365;
							word32 s9_13371;
							word32 a1_13366;
							word32 a2_13367;
							word32 a4_13368;
							word32 s8_13370;
							word32 a5_13369;
							ra_1453 = bl_printk(ra_1453, a0_1843, a3_1839, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13365, out a1_13366, out a2_13367, out a3_1588, out a4_13368, out a5_13369, out s2_1456, out s3_1577, out s4_1578, out s5_1595, out s6_1460, out s7_1597, out s8_13370, out s9_13371, out s10_1593, out s11_1600);
						}
					}
l2303786E:
					s2_1456 = (word16) s2_1456.u0 + 1;
					if (s2_1456 == 0x03)
						break;
				}
				if ((word32) s0_1506->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_13288;
						xTaskGetTickCountFromISR(out a5_13288);
					}
					else
					{
						word32 a5_13287;
						xTaskGetTickCount(out a5_13287);
					}
					word32 a1_13292;
					word32 a3_13294;
					word32 a4_13295;
					word32 s3_13297;
					word32 s5_13299;
					word32 s7_13300;
					word32 s8_13301;
					word32 s9_13302;
					word32 s11_13304;
					word32 s10_13303;
					word32 s4_13298;
					word32 a5_13296;
					word32 a2_13293;
					word32 a0_13291;
					ra_1453 = bl_printk(ra_1453, &g_t23085240, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13291, out a1_13292, out a2_13293, out a3_13294, out a4_13295, out a5_13296, out s2_1456, out s3_13297, out s4_13298, out s5_13299, out s6_1460, out s7_13300, out s8_13301, out s9_13302, out s10_13303, out s11_13304);
				}
				word32 a3_13264;
				word32 a4_13265;
				word32 a7_13268;
				word32 a6_13267;
				word32 a5_13266;
				word32 a1_13262;
				word32 a2_13263;
				memcpy(fp - 0x0080, 587783808, 0x06, out a1_13262, out a2_13263, out a3_13264, out a4_13265, out a5_13266, out a6_13267, out a7_13268);
l23037B5A:
				wLoc7C_8087 = (word16) dwLoc7C;
				if ((word32) s0_1506->bFFFFFC5C <= 0x02)
				{
l23037B64:
					if ((word32) g_b4201FD49 <= 0x02)
					{
						if (g_t4200DE84 != 0x00)
						{
							word32 a5_13272;
							xTaskGetTickCountFromISR(out a5_13272);
						}
						else
						{
							word32 a5_13271;
							xTaskGetTickCount(out a5_13271);
						}
						word32 a0_13273;
						word32 a2_13275;
						word32 a3_13276;
						word32 a4_13277;
						word32 s11_13286;
						word32 a5_13278;
						word32 s10_13285;
						word32 s9_13284;
						word32 s3_13279;
						word32 s4_13280;
						word32 s5_13281;
						word32 s8_13283;
						word32 s7_13282;
						word32 a1_13274;
						ra_1453 = bl_printk(ra_1453, &g_t23085270, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_1455, out a0_13273, out a1_13274, out a2_13275, out a3_13276, out a4_13277, out a5_13278, out s2_1456, out s3_13279, out s4_13280, out s5_13281, out s6_1460, out s7_13282, out s8_13283, out s9_13284, out s10_13285, out s11_13286);
					}
				}
				bl_wifi_ap_mac_addr_set(fp - 0x0080);
				bl_wifi_sta_mac_addr_set(fp - 0x0080);
			}
		}
	}
	int32 a0_2355;
	word32 s3_13199;
	word32 s5_13201;
	word32 s4_13200;
	word32 s0_13198;
	Eq_2 s1_2365;
	word32 a5_2360;
	Eq_2 s2_2366;
	Eq_2 s6_2370;
	Eq_2 ra_2363 = fdt_subnode_offset(ra_1453, s1_1455, s1_1455, 0x230806D8, s2_1456, s6_1460, dwLocF8, dwLocC8, s9, out s0_13198, out s1_2365, out a0_2355, out a5_2360, out s2_2366, out s3_13199, out s4_13200, out s5_13201, out s6_2370);
	if (a0_2355 > 0x00)
	{
		Eq_2 a0_2380;
		word32 a4_2384;
		struct Eq_177484 * s0_2389;
		word32 a1_13383;
		word32 a5_13385;
		word32 s3_13387;
		word32 s4_13388;
		word32 s5_13389;
		word32 s8_13390;
		word32 s2_13386;
		word32 a3_13384;
		ra_2363 = fdt_getprop(ra_2363, s1_2365, 0x230806E0, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_2389, out s1_2365, out a0_2380, out a1_13383, out a3_13384, out a4_2384, out a5_13385, out s2_13386, out s3_13387, out s4_13388, out s5_13389, out s6_2370, out s8_13390);
		a5_2360 = 0x04;
		s2_2366 = a0_2380;
		if (a4_2384 == 0x04)
		{
			if ((word32) s0_2389->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_13392;
					xTaskGetTickCountFromISR(out a5_13392);
				}
				else
				{
					word32 a5_13391;
					xTaskGetTickCount(out a5_13391);
				}
				fdt32_to_cpu(*a0_2380);
				word32 a5_13415;
				word32 s3_13416;
				word32 s7_13419;
				word32 s5_13418;
				word32 s4_13417;
				word32 s8_13420;
				word32 s9_13421;
