pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
				word32 s11_13423;
				word32 s10_13422;
				word32 a1_13411;
				word32 a3_13413;
				word32 a4_13414;
				word32 a2_13412;
				word32 a0_13410;
				ra_2363 = bl_printk(ra_2363, &g_t230852B4, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2365, out a0_13410, out a1_13411, out a2_13412, out a3_13413, out a4_13414, out a5_13415, out s2_2366, out s3_13416, out s4_13417, out s5_13418, out s6_2370, out s7_13419, out s8_13420, out s9_13421, out s10_13422, out s11_13423);
			}
			a5_2360 = bl_wifi_country_code_set(fdt32_to_cpu(*s2_2366) & 0x00FF);
		}
		else if ((word32) s0_2389->bFFFFFC5C <= 0x04 && (word32) g_b4201FD49 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_13942;
				xTaskGetTickCountFromISR(out a5_13942);
			}
			else
			{
				word32 a5_13941;
				xTaskGetTickCount(out a5_13941);
			}
			word32 a2_13963;
			word32 a4_13965;
			word32 s3_13966;
			word32 s4_13967;
			word32 s5_13968;
			word32 s7_13969;
			word32 s8_13970;
			word32 s9_13971;
			word32 s11_13973;
			word32 s10_13972;
			word32 a3_13964;
			word32 a1_13962;
			word32 a0_13961;
			ra_2363 = bl_printk(ra_2363, &g_t23080720, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2365, out a0_13961, out a1_13962, out a2_13963, out a3_13964, out a4_13965, out a5_2360, out s2_2366, out s3_13966, out s4_13967, out s5_13968, out s6_2370, out s7_13969, out s8_13970, out s9_13971, out s10_13972, out s11_13973);
		}
	}
	int32 a0_2522;
	word32 s0_13378;
	word32 s3_13380;
	word32 s5_13382;
	word32 s4_13381;
	word32 a5_13379;
	Eq_2 s2_2533;
	Eq_2 s6_2537;
	Eq_2 s1_2532;
	Eq_2 ra_2530 = fdt_subnode_offset(ra_2363, s1_2365, s1_2365, a5_2360 + -1688, s2_2366, s6_2370, dwLocF8, dwLocC8, s9, out s0_13378, out s1_2532, out a0_2522, out a5_13379, out s2_2533, out s3_13380, out s4_13381, out s5_13382, out s6_2537);
	if (a0_2522 > 0x00)
	{
		word32 a4_2552;
		struct Eq_177577 * s0_2557;
		word32 s8_13407;
		word32 s5_13405;
		word32 s6_13406;
		word32 a1_13399;
		word32 s3_13403;
		word32 s4_13404;
		word32 a3_13400;
		word32 s2_13402;
		word32 a5_13401;
		Eq_2 a0_2548;
		Eq_2 s1_2558;
		Eq_2 ra_2556 = fdt_getprop(ra_2530, s1_2532, 587748060, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_2557, out s1_2558, out a0_2548, out a1_13399, out a3_13400, out a4_2552, out a5_13401, out s2_13402, out s3_13403, out s4_13404, out s5_13405, out s6_13406, out s8_13407);
		if (a4_2552 == 0x10)
		{
			int32 s2_2616;
			for (s2_2616 = 0x00; s2_2616 != 0x04; ++s2_2616)
			{
				a0_2548 = fdt32_to_cpu(a0_2548);
				fp - 0x0080 + s2_2616 = (byte *) (byte) a0_2548;
			}
			if ((word32) s0_2557->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_13409;
					xTaskGetTickCountFromISR(out a5_13409);
				}
				else
				{
					word32 a5_13408;
					xTaskGetTickCount(out a5_13408);
				}
				word32 s2_13430;
				word32 s4_13432;
				word32 s6_13434;
				word32 s11_13439;
				word32 s10_13438;
				word32 s7_13435;
				word32 s9_13437;
				word32 s8_13436;
				word32 s5_13433;
				word32 s3_13431;
				word32 a4_13428;
				word32 a5_13429;
				word32 a3_13427;
				word32 a1_13425;
				word32 a2_13426;
				word32 a0_13424;
				ra_2556 = bl_printk(ra_2556, &g_t230852EC, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2558, out a0_13424, out a1_13425, out a2_13426, out a3_13427, out a4_13428, out a5_13429, out s2_13430, out s3_13431, out s4_13432, out s5_13433, out s6_13434, out s7_13435, out s8_13436, out s9_13437, out s10_13438, out s11_13439);
			}
			bl_tpc_update_power_rate_11b(fp - 0x0080);
		}
		else if ((word32) s0_2557->bFFFFFC5C <= 0x04 && (word32) g_b4201FD49 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_13775;
				xTaskGetTickCountFromISR(out a5_13775);
			}
			else
			{
				word32 a5_13774;
				xTaskGetTickCount(out a5_13774);
			}
			word32 a3_13779;
			word32 s2_13782;
			word32 s4_13784;
			word32 s6_13786;
			word32 s7_13787;
			word32 s9_13789;
			word32 s11_13791;
			word32 s10_13790;
			word32 s8_13788;
			word32 s5_13785;
			word32 s3_13783;
			word32 a5_13781;
			word32 a4_13780;
			word32 a2_13778;
			word32 a1_13777;
			word32 a0_13776;
			ra_2556 = bl_printk(ra_2556, &g_t2308531C, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2558, out a0_13776, out a1_13777, out a2_13778, out a3_13779, out a4_13780, out a5_13781, out s2_13782, out s3_13783, out s4_13784, out s5_13785, out s6_13786, out s7_13787, out s8_13788, out s9_13789, out s10_13790, out s11_13791);
		}
		Eq_2 dwLoc7C_12765;
		int32 a4_2710;
		struct Eq_177735 * s0_2715;
		word32 a5_13767;
		word32 a1_13765;
		word32 a3_13766;
		word32 s2_13768;
		word32 s3_13769;
		word32 s4_13770;
		word32 s5_13771;
		word32 s6_13772;
		word32 s8_13773;
		Eq_2 a0_2706;
		Eq_2 s1_2716;
		Eq_2 ra_2714 = fdt_getprop(ra_2556, s1_2558, 587748180, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_2715, out s1_2716, out a0_2706, out a1_13765, out a3_13766, out a4_2710, out a5_13767, out s2_13768, out s3_13769, out s4_13770, out s5_13771, out s6_13772, out s8_13773);
		if (a4_2710 == 32)
		{
			int32 s2_2774;
			for (s2_2774 = 0x00; s2_2774 != 0x08; ++s2_2774)
			{
				a0_2706 = fdt32_to_cpu(a0_2706);
				fp - 0x0080 + s2_2774 = (byte *) (byte) a0_2706;
			}
			Eq_2 dwLoc7C_12770 = SEQ(SLICE(dwLoc7C, word16, 16), wLoc7C_8087);
			if ((word32) s0_2715->bFFFFFC5C <= 0x02)
			{
				dwLoc7C_12770 = SEQ(SLICE(dwLoc7C, word16, 16), wLoc7C_8087);
				if ((word32) g_b4201FD49 <= 0x02)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_13441;
						xTaskGetTickCountFromISR(out a5_13441);
					}
					else
					{
						word32 a5_13440;
						xTaskGetTickCount(out a5_13440);
					}
					Eq_2 a5_2803 = (word32) bLoc79_7680;
					dwLocF8 = a5_2803;
					dwLoc7C_12770 = (word32) bLoc7A_7727;
					word32 a0_13444;
					word32 a2_13446;
					word32 a4_13448;
					word32 a5_13449;
					word32 s5_13453;
					word32 s6_13454;
					word32 s9_13457;
					word32 s10_13458;
					word32 s11_13459;
					word32 s8_13456;
					word32 s7_13455;
					word32 s3_13451;
					word32 s4_13452;
					word32 s2_13450;
					word32 a3_13447;
					word32 a1_13445;
					ra_2714 = bl_printk(ra_2714, &g_t23085364, 587746728, a5_2803, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2716, out a0_13444, out a1_13445, out a2_13446, out a3_13447, out a4_13448, out a5_13449, out s2_13450, out s3_13451, out s4_13452, out s5_13453, out s6_13454, out s7_13455, out s8_13456, out s9_13457, out s10_13458, out s11_13459);
				}
			}
			bl_tpc_update_power_rate_11g(fp - 0x0080);
			dwLoc7C_12765 = dwLoc7C_12770;
		}
		else
		{
			dwLoc7C_12765 = SEQ(SLICE(dwLoc7C, word16, 16), wLoc7C_8087);
			if ((word32) s0_2715->bFFFFFC5C <= 0x04)
			{
				dwLoc7C_12765 = SEQ(SLICE(dwLoc7C, word16, 16), wLoc7C_8087);
				if ((word32) g_b4201FD49 <= 0x04)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_13576;
						xTaskGetTickCountFromISR(out a5_13576);
					}
					else
					{
						word32 a5_13575;
						xTaskGetTickCount(out a5_13575);
					}
					word32 s7_13725;
					word32 s10_13728;
					word32 s11_13729;
					word32 s9_13727;
					word32 s8_13726;
					word32 a0_13714;
					word32 s6_13724;
					word32 s5_13723;
					word32 a1_13715;
					word32 s4_13722;
					word32 s3_13721;
					word32 a2_13716;
					word32 a3_13717;
					word32 a4_13718;
					word32 s2_13720;
					word32 a5_13719;
					ra_2714 = bl_printk(ra_2714, &g_t230853A0, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2716, out a0_13714, out a1_13715, out a2_13716, out a3_13717, out a4_13718, out a5_13719, out s2_13720, out s3_13721, out s4_13722, out s5_13723, out s6_13724, out s7_13725, out s8_13726, out s9_13727, out s10_13728, out s11_13729);
					dwLoc7C_12765 = SEQ(SLICE(dwLoc7C, word16, 16), wLoc7C_8087);
				}
			}
		}
		byte bLoc7A_7839 = SLICE(dwLoc7C_12765, byte, 16);
		byte bLoc79_7820 = SLICE(dwLoc7C_12765, byte, 24);
		int32 a4_2875;
		struct Eq_177789 * s0_2880;
		word32 s4_13571;
		word32 s8_13574;
		word32 s6_13573;
		word32 s5_13572;
		word32 s3_13570;
		word32 s2_13569;
		word32 a5_13568;
		word32 a3_13567;
		word32 a1_13566;
		Eq_2 a0_2871;
		Eq_2 s1_2881;
		Eq_2 ra_2879 = fdt_getprop(ra_2714, s1_2716, 0x230853D8, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_2880, out s1_2881, out a0_2871, out a1_13566, out a3_13567, out a4_2875, out a5_13568, out s2_13569, out s3_13570, out s4_13571, out s5_13572, out s6_13573, out s8_13574);
		Eq_2 dwLoc7C_7843 = dwLoc7C_12765;
		if (a4_2875 == 32)
		{
			int32 s2_2939;
			for (s2_2939 = 0x00; s2_2939 != 0x08; ++s2_2939)
			{
				a0_2871 = fdt32_to_cpu(a0_2871);
				fp - 0x0080 + s2_2939 = (byte *) (byte) a0_2871;
			}
			if ((word32) s0_2880->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_13443;
					xTaskGetTickCountFromISR(out a5_13443);
				}
				else
				{
					word32 a5_13442;
					xTaskGetTickCount(out a5_13442);
				}
				Eq_2 a5_2968 = (word32) bLoc79_7820;
				dwLocF8 = a5_2968;
				dwLoc7C_7843 = (word32) bLoc7A_7839;
				word32 s10_13481;
				word32 s6_13477;
				word32 s3_13474;
				word32 a4_13471;
				word32 a1_13468;
				word32 s7_13478;
				word32 s4_13475;
				word32 a5_13472;
				word32 a2_13469;
				word32 s11_13482;
				word32 s8_13479;
				word32 s9_13480;
				word32 s5_13476;
				word32 s2_13473;
				word32 a3_13470;
				word32 a0_13467;
				ra_2879 = bl_printk(ra_2879, &g_t230853E8, 587746728, a5_2968, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2881, out a0_13467, out a1_13468, out a2_13469, out a3_13470, out a4_13471, out a5_13472, out s2_13473, out s3_13474, out s4_13475, out s5_13476, out s6_13477, out s7_13478, out s8_13479, out s9_13480, out s10_13481, out s11_13482);
			}
			bl_tpc_update_power_rate_11n(fp - 0x0080);
		}
		else if ((word32) s0_2880->bFFFFFC5C <= 0x04 && (word32) g_b4201FD49 <= 0x04)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_13466;
				xTaskGetTickCountFromISR(out a5_13466);
			}
			else
			{
				word32 a5_13465;
				xTaskGetTickCount(out a5_13465);
			}
			word32 s10_13497;
			word32 s6_13493;
			word32 s4_13491;
			word32 s2_13489;
			word32 a2_13485;
			word32 a3_13486;
			word32 s7_13494;
			word32 s11_13498;
			word32 s8_13495;
			word32 s9_13496;
			word32 s5_13492;
			word32 s3_13490;
			word32 a4_13487;
			word32 a5_13488;
			word32 a0_13483;
			word32 a1_13484;
			ra_2879 = bl_printk(ra_2879, &g_t23085424, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2881, out a0_13483, out a1_13484, out a2_13485, out a3_13486, out a4_13487, out a5_13488, out s2_13489, out s3_13490, out s4_13491, out s5_13492, out s6_13493, out s7_13494, out s8_13495, out s9_13496, out s10_13497, out s11_13498);
		}
		dwLocDC.u0 = 0x00;
		word32 a0_3034;
		word32 s4_13462;
		word32 s8_13464;
		word32 s5_13463;
		word32 s3_13461;
		word32 s0_13460;
		ra_2530 = fdt_stringlist_count(ra_2879, s1_2881, 587748444, 0x23085000, dwLocF8, 0x00, dwLoc48, s9, out s0_13460, out s1_2532, out a0_3034, out s2_2533, out s3_13461, out s4_13462, out s5_13463, out s6_2537, out s8_13464);
		if (a0_3034 == 0x01)
		{
			Eq_2 a0_3061;
			word32 s8_13506;
			word32 s3_13505;
			word32 s2_13504;
			word32 a5_13503;
			word32 a4_13502;
			word32 a3_13501;
			word32 s1_13499;
			word32 a1_13500;
			Eq_2 a2_3063;
			struct Eq_167055 * s0_3070;
			Eq_2 s5_3075;
			word32 s4_3074;
			ra_2530 = fdt_stringlist_get(ra_2530, s1_2532, (word32) s2_2533 + 1116, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_3070, out s1_13499, out a0_3061, out a1_13500, out a2_3063, out a3_13501, out a4_13502, out a5_13503, out s2_13504, out s3_13505, out s4_3074, out s5_3075, out s6_2537, out s8_13506);
			Eq_2 s3_3083 = a0_3061;
			if ((word32) s0_3070->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_13508;
					xTaskGetTickCountFromISR(out a5_13508);
				}
				else
				{
					word32 a5_13507;
					xTaskGetTickCount(out a5_13507);
				}
				word32 s10_13519;
				word32 s11_13520;
				word32 s9_13518;
				word32 s8_13517;
				word32 s1_13509;
				word32 s7_13516;
				word32 s2_13515;
				word32 a0_13510;
				word32 a1_13511;
				word32 a3_13512;
				word32 a5_13514;
				word32 a4_13513;
				ra_2530 = bl_printk(ra_2530, &g_t23085468, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13509, out a0_13510, out a1_13511, out a2_3063, out a3_13512, out a4_13513, out a5_13514, out s2_13515, out s3_3083, out s4_3074, out s5_3075, out s6_2537, out s7_13516, out s8_13517, out s9_13518, out s10_13519, out s11_13520);
			}
			s1_2532 = dwLoc7C_7843;
			s2_2533.u0 = 0x02;
			if (a2_3063 <= 0x02)
			{
				word32 a2_13522;
				word32 a4_13524;
				word32 a6_13526;
				word32 a7_13527;
				word32 a5_13525;
				word32 a3_13523;
				word32 a1_13521;
				memcpy(fp - 0x00C4, s3_3083, a2_3063, out a1_13521, out a2_13522, out a3_13523, out a4_13524, out a5_13525, out a6_13526, out a7_13527);
				if ((word32) s0_3070->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_13546;
						xTaskGetTickCountFromISR(out a5_13546);
					}
					else
					{
						word32 a5_13545;
						xTaskGetTickCount(out a5_13545);
					}
					word32 s11_13559;
					word32 s2_13553;
					word32 s7_13555;
					word32 s9_13557;
					word32 s10_13558;
					word32 s8_13556;
					word32 s6_13554;
					word32 a4_13551;
					word32 a5_13552;
					word32 a2_13549;
					word32 a3_13550;
					word32 a0_13547;
					word32 a1_13548;
					ra_2530 = bl_printk(ra_2530, &g_t23085490, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2532, out a0_13547, out a1_13548, out a2_13549, out a3_13550, out a4_13551, out a5_13552, out s2_13553, out s3_3083, out s4_3074, out s5_3075, out s6_13554, out s7_13555, out s8_13556, out s9_13557, out s10_13558, out s11_13559);
				}
				word32 a0_13529;
				word32 a2_13531;
				word32 a3_13532;
				word32 a4_13533;
				word32 a4_13540;
				word32 a5_13541;
				word32 a2_13538;
				word32 a3_13539;
				word32 a1_13537;
				word32 a5_13534;
				word32 a0_13536;
				word32 t1_13535;
				word32 a1_13530;
				word32 t1_13528;
				Eq_2 ra_3219 = memset(memset(ra_2530, fp - 0x00B0, 0x00, 0x0E, out t1_13528, out a0_13529, out a1_13530, out a2_13531, out a3_13532, out a4_13533, out a5_13534), fp - 0x00A0, 0x00, 0x0E, out t1_13535, out a0_13536, out a1_13537, out a2_13538, out a3_13539, out a4_13540, out a5_13541);
				word32 a1_13542;
				word32 a2_13543;
				word32 a4_13544;
				int32 a5_3226;
				Eq_2 a3_3224;
				strlen(fp - 0x00C4, out a1_13542, out a2_13543, out a3_3224, out a4_13544, out a5_3226);
				byte * s2_3230 = fp - 0x00C4;
				int32 s9_3232;
				struct Eq_178177 * s7_3233 = &g_t42020000;
				Eq_2 s6_3235 = 0x23085000;
				for (s9_3232 = 0x00; s9_3232 != 0x02; ++s9_3232)
				{
					struct Eq_274 * a0_3670;
					Eq_2 a3_3668;
					if (s9_3232 >= a5_3226)
						break;
					byte * s2_3271;
					struct Eq_274 * a0_3353;
					Eq_2 a3_3347;
					Eq_178237 a5_3243 = (word32) *s2_3230;
					if (a5_3243 != 70)
					{
						struct Eq_277262 ** a4_3245;
						if (a5_3243 <= 70)
						{
							a4_3245 = (struct Eq_277262 **) 66;
							if (a5_3243 != 66)
								goto l23037F9E;
							goto l2303859C;
						}
						a4_3245 = (struct Eq_277262 **) 98;
						if (a5_3243 != 98)
						{
							if (a5_3243 != 0x0066)
							{
l23037F9E:
								if (g_t4200DE84 != 0x00)
								{
									word32 a5_13565;
									xTaskGetTickCountFromISR(out a5_13565);
								}
								else
								{
									word32 a5_13564;
									xTaskGetTickCount(out a5_13564);
								}
								word32 s11_13603;
								word32 a4_13592;
								word32 s2_13594;
								word32 s9_13601;
								word32 s10_13602;
								word32 s3_13595;
								word32 s7_13599;
								word32 s8_13600;
								word32 s4_13596;
								word32 s6_13598;
								word32 s5_13597;
								word32 a5_13593;
								word32 a2_13590;
								word32 a3_13591;
								word32 a1_13589;
								word32 a0_13588;
								word32 s1_13587;
								bl_printk(ra_3219, &g_t2307C074, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13587, out a0_13588, out a1_13589, out a2_13590, out a3_13591, out a4_13592, out a5_13593, out s2_13594, out s3_13595, out s4_13596, out s5_13597, out s6_13598, out s7_13599, out s8_13600, out s9_13601, out s10_13602, out s11_13603);
								while (true)
									;
							}
							goto l230383FA;
						}
l2303859C:
						Eq_2 a0_3689;
						struct Eq_178278 * s8_3709;
						ra_3219 = bl_efuse_read_pwroft(ra_3219, s0_3070, s1_2532, fp - 0x00A0, a3_3224, a4_3245, s2_3230, s3_3083, s4_3074, mstatus, dwLocD8, dwLocC0, dwLocBC, s10, dwLoc74, dwArg18, out s0_3070, out s1_2532, out a0_3689, out a3_3224, out s2_3271, out s4_3074, out s5_3075, out s6_3235, out s7_3233, out s8_3709, out s9_3232, out mstatus);
						s3_3083 = a0_3689;
						up32 a4_3717 = (word32) s0_3070->bFFFFFC5C;
						if (a0_3689 == 0x00)
						{
							if (a4_3717 <= 0x02 && (word32) s7_3233->bFFFFFD49 <= 0x02)
							{
								if (s8_3709->dwFFFFFE84 != 0x00)
								{
									word32 a5_13734;
									xTaskGetTickCountFromISR(out a5_13734);
								}
								else
								{
									word32 a5_13733;
									xTaskGetTickCount(out a5_13733);
								}
								word32 s1_13737;
								word32 a0_13738;
								word32 a1_13739;
								word32 s4_13746;
								word32 s8_13748;
								word32 s9_13749;
								word32 s10_13750;
								word32 s11_13751;
								word32 s7_13747;
								word32 s2_13744;
								word32 s3_13745;
								word32 a5_13743;
								word32 a2_13740;
								word32 a4_13742;
								word32 a3_13741;
								ra_3219 = bl_printk(ra_3219, &g_t230854B4, (word32) s6_3235 - 600, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13737, out a0_13738, out a1_13739, out a2_13740, out a3_13741, out a4_13742, out a5_13743, out s2_13744, out s3_13745, out s4_13746, out s5_3075, out s6_3235, out s7_13747, out s8_13748, out s9_13749, out s10_13750, out s11_13751);
							}
							struct Eq_179030 * s8_3839;
							word32 a3_13730;
							word32 a5_13732;
							word32 a4_13731;
							ra_3219 = log_buf_out(ra_3219, fp - 0x00A0, 0x0E, 0x01, s5_3075, s6_3235, s3_290, dwLocE0, 0x00, dwLocD0, dwLocA8, s8, s0, dwArg0C, out s0_3070, out s1_2532, out a3_13730, out a4_13731, out a5_13732, out s2_3271, out s3_3083, out s4_3074, out s5_3075, out s6_3235, out s7_3233, out s8_3839, out s9_3232);
							if ((word32) *s2_3271 == 66)
							{
								do
								{
									Mem3962[fp - 0x00B0 + s3_3083:byte] = SLICE(CONVERT(Mem3958[fp - 0x00A0 + s3_3083:byte], byte, word32), byte, 0);
									s3_3083 = (word32) s3_3083 + 1;
								} while (s3_3083 != 0x0E);
								if ((word32) s0_3070->bFFFFFC5C > 0x01 || (word32) g_b4201FD49 > 0x01)
									goto l23038844;
								if (g_t4200DE84 != 0x00)
								{
									word32 a5_13736;
									xTaskGetTickCountFromISR(out a5_13736);
								}
								else
								{
									word32 a5_13735;
									xTaskGetTickCount(out a5_13735);
								}
								a3_3668 = (word32) s6_3235 - 600;
								a0_3670 = (struct Eq_274 *) &g_t230854E8;
								goto l23038656;
							}
							if ((word32) s0_3070->bFFFFFC5C <= 0x01 && (word32) s7_3233->bFFFFFD49 <= 0x01)
							{
								if (s8_3839->dwFFFFFE84 != 0x00)
								{
									word32 a5_13753;
									xTaskGetTickCountFromISR(out a5_13753);
								}
								else
								{
									word32 a5_13752;
									xTaskGetTickCount(out a5_13752);
								}
								word32 a5_13759;
								word32 s10_13761;
								word32 s11_13762;
								word32 s8_13760;
								word32 a3_13757;
								word32 a4_13758;
								word32 a1_13755;
								word32 a2_13756;
								word32 a0_13754;
								ra_3219 = bl_printk(ra_3219, &g_t23085518, (word32) s6_3235 - 600, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2532, out a0_13754, out a1_13755, out a2_13756, out a3_13757, out a4_13758, out a5_13759, out s2_3271, out s3_3083, out s4_3074, out s5_3075, out s6_3235, out s7_3233, out s8_13760, out s9_3232, out s10_13761, out s11_13762);
							}
							struct Eq_179159 * a5_3890 = fp - 0x00B0;
							a3_3224.u0 = 0x0E;
							do
							{
								++a5_3890;
								Mem3903[a5_3890 + 0x0FFF:byte] = Mem3897[fp - 0x00A0 + s3_3083:byte] + Mem3897[a5_3890 + 0x00:byte];
								s3_3083 = (word32) s3_3083 + 1;
							} while (s3_3083 != 0x0E);
							goto l230386BE;
						}
						if (a4_3717 > 0x01 || (word32) s7_3233->bFFFFFD49 > 0x01)
							goto l230386BE;
						if (s8_3709->dwFFFFFE84 != 0x00)
						{
							word32 a5_13764;
							xTaskGetTickCountFromISR(out a5_13764);
						}
						else
						{
							word32 a5_13763;
							xTaskGetTickCount(out a5_13763);
						}
						a3_3347 = (word32) s6_3235 - 600;
						a0_3353 = (struct Eq_274 *) &g_t23085558;
						goto l23038748;
					}
l230383FA:
					word32 a1_13560;
					word32 a3_13561;
					word32 a4_13562;
					word32 a5_13563;
					struct Eq_178248 * s8_3276;
					Eq_2 a0_3260;
					ra_3219 = fdt_getprop(ra_3219, s1_2532, 587748752, dwLocF8, dwLocD8, dwLocBC, dwLoc28, dwArg08, out s0_3070, out s1_2532, out a0_3260, out a1_13560, out a3_13561, out a4_13562, out a5_13563, out s2_3271, out s3_3083, out s4_3074, out s5_3075, out s6_3235, out s8_3276);
					a3_3224.u0 = 0x00;
					if (false)
					{
						int32 s3_3354;
						Eq_2 s5_3355 = 0x0E;
						for (s3_3354 = 0x00; s3_3354 != 0x0E; ++s3_3354)
						{
							a0_3260 = fdt32_to_cpu(a0_3260);
							fp - 0x00A0 + s3_3354 = (byte *) (byte) a0_3260;
						}
						if ((word32) s0_3070->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
						{
							if (g_t4200DE84 != 0x00)
							{
								word32 a5_13586;
								xTaskGetTickCountFromISR(out a5_13586);
							}
							else
							{
								word32 a5_13585;
								xTaskGetTickCount(out a5_13585);
							}
							word32 s2_13611;
							word32 s3_13612;
							word32 s4_13613;
							word32 s7_13614;
							word32 s8_13615;
							word32 s9_13616;
							word32 s11_13618;
							word32 s10_13617;
							word32 a0_13605;
							word32 a2_13607;
							word32 a4_13609;
							word32 a5_13610;
							word32 a3_13608;
							word32 a1_13606;
							word32 s1_13604;
							ra_3219 = bl_printk(ra_3219, &g_t2308559C, 587746728, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13604, out a0_13605, out a1_13606, out a2_13607, out a3_13608, out a4_13609, out a5_13610, out s2_13611, out s3_13612, out s4_13613, out s5_3355, out s6_3235, out s7_13614, out s8_13615, out s9_13616, out s10_13617, out s11_13618);
						}
						struct Eq_178393 * s0_3441;
						word32 a3_13578;
						word32 a4_13579;
						word32 s4_13581;
						word32 s8_13583;
						word32 s9_13584;
						word32 s7_13582;
						word32 a5_13580;
						word32 s1_13577;
						union Eq_2 * s2_3445;
						word32 s3_3446;
						ra_3219 = log_buf_out(ra_3219, fp - 0x00A0, 0x0E, 0x00, s5_3355, s6_3235, s3_290, dwLocE0, 0x00, dwLocD0, dwLocA8, s8, s0, dwArg0C, out s0_3441, out s1_13577, out a3_13578, out a4_13579, out a5_13580, out s2_3445, out s3_3446, out s4_13581, out s5_3075, out s6_3235, out s7_13582, out s8_13583, out s9_13584);
						struct Eq_178426 * a5_3457 = fp - 0x00A0;
						do
						{
							++a5_3457;
							a5_3457[0x0FFF] = (struct Eq_178426) (byte) ((word32) a5_3457->b0000 + ~0x09);
						} while (fp - 0x0092 != a5_3457);
