pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
						if ((word32) s0_3441->bFFFFFC5C <= 0x02)
						{
							s5_3075.u0 = 0x42020000;
							if ((word32) g_b4201FD49 <= 0x02)
							{
								if (g_t4200DE84 != 0x00)
								{
									word32 a5_13620;
									xTaskGetTickCountFromISR(out a5_13620);
								}
								else
								{
									word32 a5_13619;
									xTaskGetTickCount(out a5_13619);
								}
								word32 s1_13623;
								word32 a2_13626;
								word32 a4_13628;
								word32 s4_13630;
								word32 s7_13631;
								word32 s9_13633;
								word32 s11_13635;
								word32 s10_13634;
								word32 s8_13632;
								word32 a5_13629;
								word32 a3_13627;
								word32 a1_13625;
								word32 a0_13624;
								ra_3219 = bl_printk(ra_3219, &g_t230855C8, s3_3446 + -600, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13623, out a0_13624, out a1_13625, out a2_13626, out a3_13627, out a4_13628, out a5_13629, out s2_3445, out s3_3446, out s4_13630, out s5_3075, out s6_3235, out s7_13631, out s8_13632, out s9_13633, out s10_13634, out s11_13635);
							}
							if ((word32) s0_3441->bFFFFFC5C <= 0x01 && (word32) (*((word16) s5_3075.u0 - 695)) <= 0x01)
							{
								if (g_t4200DE84 != 0x00)
								{
									word32 a5_13637;
									xTaskGetTickCountFromISR(out a5_13637);
								}
								else
								{
									word32 a5_13636;
									xTaskGetTickCount(out a5_13636);
								}
								word32 s11_13657;
								word32 s9_13655;
								word32 s10_13656;
								word32 a0_13646;
								word32 s7_13653;
								word32 s8_13654;
								word32 a1_13647;
								word32 a5_13651;
								word32 s4_13652;
								word32 a2_13648;
								word32 a4_13650;
								word32 a3_13649;
								word32 s1_13645;
								ra_3219 = bl_printk(ra_3219, &g_t23085638, s3_3446 + -600, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13645, out a0_13646, out a1_13647, out a2_13648, out a3_13649, out a4_13650, out a5_13651, out s2_3445, out s3_3446, out s4_13652, out s5_3075, out s6_3235, out s7_13653, out s8_13654, out s9_13655, out s10_13656, out s11_13657);
							}
						}
						up32 a4_3574 = (word32) s0_3441->bFFFFFC5C;
						if ((word32) *s2_3445 != 66)
						{
							if (a4_3574 <= 0x01 && (word32) g_b4201FD49 <= 0x01)
							{
								if (g_t4200DE84 != 0x00)
								{
									word32 a5_13698;
									xTaskGetTickCountFromISR(out a5_13698);
								}
								else
								{
									word32 a5_13697;
									xTaskGetTickCount(out a5_13697);
								}
								word32 s11_13713;
								word32 s3_13707;
								word32 s7_13709;
								word32 s9_13711;
								word32 s10_13712;
								word32 s8_13710;
								word32 s4_13708;
								word32 a5_13705;
								word32 s2_13706;
								word32 a3_13703;
								word32 a4_13704;
								word32 a1_13701;
								word32 a2_13702;
								word32 a0_13700;
								word32 s1_13699;
								ra_3219 = bl_printk(ra_3219, &g_t2308569C, s3_3446 + -600, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13699, out a0_13700, out a1_13701, out a2_13702, out a3_13703, out a4_13704, out a5_13705, out s2_13706, out s3_13707, out s4_13708, out s5_3075, out s6_3235, out s7_13709, out s8_13710, out s9_13711, out s10_13712, out s11_13713);
							}
							struct Eq_178911 * a4_3622 = fp - 0x00B0;
							int32 a5_3623;
							for (a5_3623 = 0x00; a5_3623 != 0x0E; ++a5_3623)
							{
								++a4_3622;
								a4_3622[0x0FFF] = (struct Eq_178911) (fp - 0x00A0 + a5_3623 + a4_3622->b0000);
							}
							goto l23038844;
						}
						else
						{
							int32 a5_3638;
							for (a5_3638 = 0x00; a5_3638 != 0x0E; ++a5_3638)
								(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(&(fp - 0x00B0)[a5_3638].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0].a0000)[0] = (byte) (word32) (fp - 0x00A0 + a5_3638);
							if (a4_3574 > 0x01 || (word32) g_b4201FD49 > 0x01)
								goto l23038844;
							if (g_t4200DE84 != 0x00)
							{
								word32 a5_13696;
								xTaskGetTickCountFromISR(out a5_13696);
							}
							else
							{
								word32 a5_13695;
								xTaskGetTickCount(out a5_13695);
							}
							a3_3668 = s3_3446 + -600;
							a0_3670 = (struct Eq_274 *) &g_t2308566C;
							goto l23038656;
						}
					}
					if ((word32) s0_3070->bFFFFFC5C <= 0x04)
					{
						if ((word32) s7_3233->bFFFFFD49 <= 0x04)
						{
							if (s8_3276->dwFFFFFE84 != 0x00)
							{
								word32 a5_13622;
								xTaskGetTickCountFromISR(out a5_13622);
							}
							else
							{
								word32 a5_13621;
								xTaskGetTickCount(out a5_13621);
							}
							word32 s11_13644;
							word32 a5_13642;
							word32 s10_13643;
							word32 a4_13641;
							word32 a0_13638;
							word32 a2_13640;
							word32 a1_13639;
							ra_3219 = bl_printk(ra_3219, &g_t23085604, (word32) s6_3235 - 600, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2532, out a0_13638, out a1_13639, out a2_13640, out a3_3224, out a4_13641, out a5_13642, out s2_3271, out s3_3083, out s4_3074, out s5_3075, out s6_3235, out s7_3233, out s8_3276, out s9_3232, out s10_13643, out s11_13644);
						}
						if ((word32) s0_3070->bFFFFFC5C <= 0x01 && (word32) s7_3233->bFFFFFD49 <= 0x01)
						{
							if (s8_3276->dwFFFFFE84 != 0x00)
							{
								word32 a5_13659;
								xTaskGetTickCountFromISR(out a5_13659);
							}
							else
							{
								word32 a5_13658;
								xTaskGetTickCount(out a5_13658);
							}
							a3_3347 = (word32) s6_3235 - 600;
							a0_3353 = (struct Eq_274 *) &g_t230856DC;
l23038748:
							word32 a4_13663;
							word32 a5_13664;
							word32 s8_13665;
							word32 s10_13666;
							word32 s11_13667;
							word32 a1_13661;
							word32 a2_13662;
							word32 a0_13660;
							ra_3219 = bl_printk(ra_3219, a0_3353, a3_3347, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_2532, out a0_13660, out a1_13661, out a2_13662, out a3_3224, out a4_13663, out a5_13664, out s2_3271, out s3_3083, out s4_3074, out s5_3075, out s6_3235, out s7_3233, out s8_13665, out s9_3232, out s10_13666, out s11_13667);
						}
					}
l230386BE:
					a5_3226 = 0x02;
					s2_3230 = s2_3271 + 1;
				}
				if (a5_3226 == 0x00 && ((word32) s0_3070->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02))
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_13679;
						xTaskGetTickCountFromISR(out a5_13679);
					}
					else
					{
						word32 a5_13678;
						xTaskGetTickCount(out a5_13678);
					}
					a3_3668.u0 = 587746728;
					a0_3670 = (struct Eq_274 *) &g_t23085714;
l23038656:
					word32 a0_13681;
					word32 a1_13682;
					word32 a3_13684;
					word32 a5_13686;
					word32 s2_13687;
					word32 s11_13694;
					word32 s9_13692;
					word32 s10_13693;
					word32 s8_13691;
					word32 s3_13688;
					word32 s7_13690;
					word32 s4_13689;
					word32 a4_13685;
					word32 a2_13683;
					word32 s1_13680;
					ra_3219 = bl_printk(ra_3219, a0_3670, a3_3668, dwLocF8, dwLocD8, s6, s4, dwLoc68, dwLoc44, out s1_13680, out a0_13681, out a1_13682, out a2_13683, out a3_13684, out a4_13685, out a5_13686, out s2_13687, out s3_13688, out s4_13689, out s5_3075, out s6_3235, out s7_13690, out s8_13691, out s9_13692, out s10_13693, out s11_13694);
				}
l23038844:
				word32 s9_13677;
				word32 s8_13676;
				word32 s7_13675;
				word32 s5_13674;
				word32 s4_13673;
				word32 s3_13672;
				word32 a5_13671;
				word32 s0_13668;
				word32 a4_13670;
				word32 a3_13669;
				ra_2530 = log_buf_out(ra_3219, fp - 0x00B0, 0x0E, 0x01, s5_3075, s6_3235, s3_290, dwLocE0, 0x00, dwLocD0, dwLocA8, s8, s0, dwArg0C, out s0_13668, out s1_2532, out a3_13669, out a4_13670, out a5_13671, out s2_2533, out s3_13672, out s4_13673, out s5_13674, out s6_2537, out s7_13675, out s8_13676, out s9_13677);
				phy_powroffset_set(fp - 0x00B0);
			}
		}
	}
	Eq_2 a0_4107;
	word32 s3_13396;
	word32 s5_13398;
	word32 s4_13397;
	word32 a5_13394;
	word32 s2_13395;
	word32 s0_13393;
	Eq_2 s1_4117;
	Eq_2 s6_4122;
	Eq_2 ra_4115 = fdt_subnode_offset(ra_2530, s1_2532, s1_2532, 587728848, s2_2533, s6_2537, dwLocF8, dwLocC8, s9, out s0_13393, out s1_4117, out a0_4107, out a5_13394, out s2_13395, out s3_13396, out s4_13397, out s5_13398, out s6_4122);
	Eq_2 s2_4127 = a0_4107;
	if (a0_4107 <= 0x00)
	{
l2303892C:
		Eq_2 a0_4588;
		word32 s0_13792;
		word32 a5_13793;
		word32 s5_13797;
		word32 s2_13794;
		word32 s4_13796;
		word32 s3_13795;
		Eq_2 s1_4598;
		Eq_2 s6_4603;
		Eq_2 ra_4596 = fdt_subnode_offset(ra_4115, s1_4117, s1_4117, 0x230857C4, s2_4127, s6_4122, dwLocF8, dwLocC8, s9, out s0_13792, out s1_4598, out a0_4588, out a5_13793, out s2_13794, out s3_13795, out s4_13796, out s5_13797, out s6_4603);
		Eq_2 s2_4608 = a0_4588;
		if (a0_4588 <= 0x00)
		{
l230389F6:
			Eq_2 a0_5020;
			struct Eq_179816 * s0_5029;
			word32 s4_13915;
			word32 s5_13916;
			word32 s2_13913;
			word32 s3_13914;
			Eq_2 s1_5030;
			word32 a5_5025;
			Eq_2 s6_5035;
			Eq_2 ra_5028 = fdt_subnode_offset(ra_4596, s1_4598, s1_4598, 0x23085898, s2_4608, s6_4603, dwLocF8, dwLocC8, s9, out s0_5029, out s1_5030, out a0_5020, out a5_5025, out s2_13913, out s3_13914, out s4_13915, out s5_13916, out s6_5035);
			Eq_2 s2_5040 = a0_5020;
			if (a0_5020 <= 0x00)
			{
				a5_5025 = 0x04;
				if ((word32) s0_5029->bFFFFFC5C <= 0x04 && (word32) g_b4201FD49 <= 0x04)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_13951;
						xTaskGetTickCountFromISR(out a5_13951);
					}
					else
					{
						word32 a5_13950;
						xTaskGetTickCount(out a5_13950);
					}
					word32 s4_13999;
					word32 s7_14001;
					word32 s8_14002;
					word32 s9_14003;
					word32 s11_14005;
					word32 s10_14004;
					word32 s5_14000;
					word32 a4_13997;
					word32 s3_13998;
					word32 a3_13996;
					word32 a0_13993;
					word32 a2_13995;
					word32 a1_13994;
					ra_5028 = bl_printk(ra_5028, &g_t230858A4, 587746728, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_5030, out a0_13993, out a1_13994, out a2_13995, out a3_13996, out a4_13997, out a5_5025, out s2_5040, out s3_13998, out s4_13999, out s5_14000, out s6_5035, out s7_14001, out s8_14002, out s9_14003, out s10_14004, out s11_14005);
				}
			}
			int32 a0_5096;
			Eq_2 s1_5106;
			word32 a5_13944;
			word32 s2_13945;
			word32 s4_13947;
			word32 s6_13949;
			word32 s5_13948;
			word32 s3_13946;
			word32 s0_13943;
			Eq_2 ra_5104 = fdt_subnode_offset(ra_5028, s1_5030, s1_5030, a5_5025 + -1688, s2_5040, s6_5035, dwLocF8, dwLocC8, s9, out s0_13943, out s1_5106, out a0_5096, out a5_13944, out s2_13945, out s3_13946, out s4_13947, out s5_13948, out s6_13949);
			if (a0_5096 > 0x00)
			{
				union Eq_2 * a0_5121;
				struct Eq_180216 * s0_5130;
				word32 s3_14012;
				word32 s5_14014;
				word32 s8_14016;
				word32 s6_14015;
				word32 s4_14013;
				word32 a5_14010;
				word32 s2_14011;
				word32 a3_14008;
				word32 a4_14009;
				word32 s1_14006;
				word32 a1_14007;
				ra_5104 = fdt_getprop(ra_5104, s1_5106, 587749572, dwLocF8, 0x00, dwLocBC, dwLoc28, dwArg08, out s0_5130, out s1_14006, out a0_5121, out a1_14007, out a3_14008, out a4_14009, out a5_14010, out s2_14011, out s3_14012, out s4_14013, out s5_14014, out s6_14015, out s8_14016);
				if (a0_5121 != null)
					fdt32_to_cpu(*a0_5121);
				if ((word32) s0_5130->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_14032;
						xTaskGetTickCountFromISR(out a5_14032);
					}
					else
					{
						word32 a5_14031;
						xTaskGetTickCount(out a5_14031);
					}
					word32 a1_14035;
					word32 s10_14048;
					word32 s11_14049;
					word32 a2_14036;
					word32 a4_14038;
					word32 s2_14040;
					word32 s5_14043;
					word32 s6_14044;
					word32 s9_14047;
					word32 s7_14045;
					word32 s8_14046;
					word32 s3_14041;
					word32 s4_14042;
					word32 a5_14039;
					word32 a3_14037;
					word32 a0_14034;
					word32 s1_14033;
					ra_5104 = bl_printk(ra_5104, &g_t230858D4, 587746728, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_14033, out a0_14034, out a1_14035, out a2_14036, out a3_14037, out a4_14038, out a5_14039, out s2_14040, out s3_14041, out s4_14042, out s5_14043, out s6_14044, out s7_14045, out s8_14046, out s9_14047, out s10_14048, out s11_14049);
				}
			}
			gpOut = dwArgD8;
			return ra_5104;
		}
		word32 a0_4613;
		word32 s3_4625;
		word32 s6_13920;
		word32 s8_13921;
		word32 s5_13919;
		word32 s0_13917;
		word32 s4_13918;
		Eq_2 s2_4624;
		Eq_2 s1_4623;
		Eq_2 ra_4621 = fdt_stringlist_count(ra_4596, s1_4598, 587669860, a0_4588, dwLocF8, dwLocDC, dwLoc48, s9, out s0_13917, out s1_4623, out a0_4613, out s2_4624, out s3_4625, out s4_13918, out s5_13919, out s6_13920, out s8_13921);
		if (a0_4613 == 0x01)
		{
			Eq_2 a0_4639;
			up32 a5_4644;
			struct Eq_179866 * s0_4648;
			word32 a3_13923;
			word32 s3_13925;
			word32 s6_13928;
			word32 s8_13929;
			word32 s4_13926;
			word32 s5_13927;
			word32 a4_13924;
			word32 a1_13922;
			Eq_2 a2_4641;
			ra_4621 = fdt_stringlist_get(ra_4621, s1_4623, s3_4625 + 356, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_4648, out s1_4623, out a0_4639, out a1_13922, out a2_4641, out a3_13923, out a4_13924, out a5_4644, out s2_4624, out s3_13925, out s4_13926, out s5_13927, out s6_13928, out s8_13929);
			Eq_2 s3_4661 = a0_4639;
			if (a5_4644 <= ~0x1E)
			{
				if ((word32) s0_4648->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
				{
					if (g_t4200DE84 != 0x00)
					{
						word32 a5_13960;
						xTaskGetTickCountFromISR(out a5_13960);
					}
					else
					{
						word32 a5_13959;
						xTaskGetTickCount(out a5_13959);
					}
					word32 a5_13978;
					word32 s6_13981;
					word32 s8_13983;
					word32 s10_13985;
					word32 s11_13986;
					word32 s9_13984;
					word32 s7_13982;
					word32 s5_13980;
					word32 s4_13979;
					word32 a4_13977;
					word32 a3_13976;
					word32 a1_13975;
					word32 a0_13974;
					ra_4621 = bl_printk(ra_4621, &g_t230857C8, 587746728, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_4623, out a0_13974, out a1_13975, out a2_4641, out a3_13976, out a4_13977, out a5_13978, out s2_4624, out s3_4661, out s4_13979, out s5_13980, out s6_13981, out s7_13982, out s8_13983, out s9_13984, out s10_13985, out s11_13986);
				}
				word32 a3_13954;
				word32 a4_13955;
				word32 a7_13958;
				word32 a6_13957;
				word32 a5_13956;
				word32 a1_13952;
				word32 a2_13953;
				memcpy(fp - 0x00A0, s3_4661, a2_4641, out a1_13952, out a2_13953, out a3_13954, out a4_13955, out a5_13956, out a6_13957, out a7_13958);
				(word32) s3_4661 + (fp - 64) + 4000 = (ptr32) 0x00;
l2303895C:
				word32 a0_4754;
				word32 s4_4767;
				word32 s2_13988;
				word32 s5_13990;
				word32 s6_13991;
				word32 s8_13992;
				word32 s3_13989;
				word32 s0_13987;
				Eq_2 s1_4764;
				Eq_2 ra_4762 = fdt_stringlist_count(ra_4621, s1_4623, 0x2308082C, s2_4624, dwLocF8, dwLocDC, dwLoc48, s9, out s0_13987, out s1_4764, out a0_4754, out s2_13988, out s3_13989, out s4_4767, out s5_13990, out s6_13991, out s8_13992);
				if (a0_4754 == 0x01)
				{
					Eq_2 a0_4780;
					up32 a5_4785;
					struct Eq_179899 * s0_4789;
					word32 s4_13935;
					word32 s5_13936;
					word32 s8_13938;
					word32 s6_13937;
					word32 s2_13933;
					word32 s3_13934;
					word32 a4_13932;
					word32 a1_13930;
					word32 a3_13931;
					Eq_2 a2_4782;
					ra_4762 = fdt_stringlist_get(ra_4762, s1_4764, s4_4767 + -2004, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_4789, out s1_4764, out a0_4780, out a1_13930, out a2_4782, out a3_13931, out a4_13932, out a5_4785, out s2_13933, out s3_13934, out s4_13935, out s5_13936, out s6_13937, out s8_13938);
					Eq_2 s4_4802 = a0_4780;
					if (a5_4785 <= ~0x1E)
					{
						if ((word32) s0_4789->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
						{
							if (g_t4200DE84 != 0x00)
							{
								word32 a5_14058;
								xTaskGetTickCountFromISR(out a5_14058);
							}
							else
							{
								word32 a5_14057;
								xTaskGetTickCount(out a5_14057);
							}
							word32 a0_14068;
							word32 a1_14069;
							word32 s11_14081;
							word32 s9_14079;
							word32 s10_14080;
							word32 s5_14075;
							word32 s8_14078;
							word32 s6_14076;
							word32 s7_14077;
							word32 a3_14070;
							word32 a4_14071;
							word32 s2_14073;
							word32 s3_14074;
							word32 a5_14072;
							ra_4762 = bl_printk(ra_4762, &g_t23085810, 587746728, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_4764, out a0_14068, out a1_14069, out a2_4782, out a3_14070, out a4_14071, out a5_14072, out s2_14073, out s3_14074, out s4_4802, out s5_14075, out s6_14076, out s7_14077, out s8_14078, out s9_14079, out s10_14080, out s11_14081);
						}
						word32 a4_14053;
						word32 a7_14056;
						word32 a5_14054;
						word32 a6_14055;
						word32 a1_14050;
						word32 a2_14051;
						word32 a3_14052;
						memcpy(fp - 0x0080, s4_4802, a2_4782, out a1_14050, out a2_14051, out a3_14052, out a4_14053, out a5_14054, out a6_14055, out a7_14056);
						(word32) s4_4802 + (fp - 64) + 0x0FC0 = (ptr32) 0x00;
l23038974:
						union Eq_2 * a0_4896;
						struct Eq_179945 * s0_4905;
						word32 s8_14067;
						word32 s1_14059;
						word32 a5_14063;
						word32 s2_14064;
						word32 s5_14066;
						word32 s4_14065;
						word32 a3_14061;
						word32 a4_14062;
						word32 a1_14060;
						Eq_2 s3_4908;
						Eq_2 ra_4904 = fdt_getprop(ra_4762, s1_4764, 0x23085854, dwLocF8, 0x00, dwLocBC, dwLoc28, dwArg08, out s0_4905, out s1_14059, out a0_4896, out a1_14060, out a3_14061, out a4_14062, out a5_14063, out s2_14064, out s3_4908, out s4_14065, out s5_14066, out s6_4603, out s8_14067);
						union Eq_2 * s2_4916 = a0_4896;
						if (a0_4896 != null)
						{
							if ((word32) s0_4905->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
							{
								if (g_t4200DE84 != 0x00)
								{
									word32 a5_13940;
									xTaskGetTickCountFromISR(out a5_13940);
								}
								else
								{
									word32 a5_13939;
									xTaskGetTickCount(out a5_13939);
								}
								fdt32_to_cpu(*a0_4896);
								word32 a0_14018;
								word32 a3_14021;
								word32 a5_14023;
								word32 s4_14024;
								word32 s5_14025;
								word32 s8_14027;
								word32 s11_14030;
								word32 s9_14028;
								word32 s10_14029;
								word32 s7_14026;
								word32 a4_14022;
								word32 a2_14020;
								word32 a1_14019;
								word32 s1_14017;
								ra_4904 = bl_printk(ra_4904, &g_t23085868, 587746728, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_14017, out a0_14018, out a1_14019, out a2_14020, out a3_14021, out a4_14022, out a5_14023, out s2_4916, out s3_4908, out s4_14024, out s5_14025, out s6_4603, out s7_14026, out s8_14027, out s9_14028, out s10_14029, out s11_14030);
							}
							fdt32_to_cpu(*s2_4916);
						}
						ra_4596 = bl_wifi_sta_info_set(ra_4904, fp - 0x00A0, s3_4908, fp - 0x0080, dwArg28, out s1_4598, out s2_4608);
						goto l230389F6;
					}
				}
				goto l23038974;
			}
		}
		goto l2303895C;
	}
	word32 a0_4132;
	word32 s3_4144;
	word32 s5_13800;
	word32 s8_13802;
	word32 s6_13801;
	word32 s0_13798;
	word32 s4_13799;
	Eq_2 s2_4143;
	Eq_2 s1_4142;
	Eq_2 ra_4140 = fdt_stringlist_count(ra_4115, s1_4117, 587669860, a0_4107, dwLocF8, dwLocDC, dwLoc48, s9, out s0_13798, out s1_4142, out a0_4132, out s2_4143, out s3_4144, out s4_13799, out s5_13800, out s6_13801, out s8_13802);
	if (a0_4132 == 0x01)
	{
		Eq_2 a0_4158;
		up32 a5_4163;
		struct Eq_179388 * s0_4167;
		word32 s6_13809;
		word32 s8_13810;
		word32 a1_13803;
		word32 s4_13807;
		word32 s5_13808;
		word32 a3_13804;
		word32 s3_13806;
		word32 a4_13805;
		Eq_2 a2_4160;
		ra_4140 = fdt_stringlist_get(ra_4140, s1_4142, s3_4144 + 356, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_4167, out s1_4142, out a0_4158, out a1_13803, out a2_4160, out a3_13804, out a4_13805, out a5_4163, out s2_4143, out s3_13806, out s4_13807, out s5_13808, out s6_13809, out s8_13810);
		Eq_2 s3_4180 = a0_4158;
		if (a5_4163 <= ~0x1E)
		{
			if ((word32) s0_4167->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
			{
				if (g_t4200DE84 != 0x00)
				{
					word32 a5_13855;
					xTaskGetTickCountFromISR(out a5_13855);
				}
				else
				{
					word32 a5_13854;
					xTaskGetTickCount(out a5_13854);
				}
				word32 s11_13889;
				word32 s9_13887;
				word32 s7_13885;
				word32 s5_13883;
				word32 a5_13881;
				word32 a3_13879;
				word32 s10_13888;
				word32 s8_13886;
				word32 s6_13884;
				word32 s4_13882;
				word32 a4_13880;
				word32 a0_13877;
				word32 a1_13878;
				ra_4140 = bl_printk(ra_4140, &g_t23085744, 587746728, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_4142, out a0_13877, out a1_13878, out a2_4160, out a3_13879, out a4_13880, out a5_13881, out s2_4143, out s3_4180, out s4_13882, out s5_13883, out s6_13884, out s7_13885, out s8_13886, out s9_13887, out s10_13888, out s11_13889);
			}
			word32 a1_13847;
			word32 a3_13849;
			word32 a5_13851;
			word32 a6_13852;
			word32 a7_13853;
			word32 a4_13850;
			word32 a2_13848;
			memcpy(fp - 0x00A0, s3_4180, a2_4160, out a1_13847, out a2_13848, out a3_13849, out a4_13850, out a5_13851, out a6_13852, out a7_13853);
			(word32) s3_4180 + (fp - 64) + 4000 = (ptr32) 0x00;
l23038890:
			word32 a0_4273;
			word32 s5_4287;
			word32 s3_13873;
			word32 s6_13875;
			word32 s8_13876;
			word32 s4_13874;
			word32 s0_13871;
			word32 s2_13872;
			Eq_2 s1_4283;
			Eq_2 ra_4281 = fdt_stringlist_count(ra_4140, s1_4142, 0x2308082C, s2_4143, dwLocF8, dwLocDC, dwLoc48, s9, out s0_13871, out s1_4283, out a0_4273, out s2_13872, out s3_13873, out s4_13874, out s5_4287, out s6_13875, out s8_13876);
			if (a0_4273 == 0x01)
			{
				Eq_2 a0_4299;
				up32 a5_4304;
				struct Eq_179421 * s0_4308;
				word32 s8_13819;
				word32 a4_13813;
				word32 s3_13815;
				word32 s5_13817;
				word32 s6_13818;
				word32 s4_13816;
				word32 s2_13814;
				word32 a1_13811;
				word32 a3_13812;
				Eq_2 a2_4301;
				ra_4281 = fdt_stringlist_get(ra_4281, s1_4283, s5_4287 + -2004, s3_290, dwLoc58, dwLoc28, dwArg28, out s0_4308, out s1_4283, out a0_4299, out a1_13811, out a2_4301, out a3_13812, out a4_13813, out a5_4304, out s2_13814, out s3_13815, out s4_13816, out s5_13817, out s6_13818, out s8_13819);
				Eq_2 s5_4321 = a0_4299;
				if (a5_4304 <= ~0x1E)
				{
					if ((word32) s0_4308->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
					{
						if (g_t4200DE84 != 0x00)
						{
							word32 a5_13846;
							xTaskGetTickCountFromISR(out a5_13846);
						}
						else
						{
							word32 a5_13845;
							xTaskGetTickCount(out a5_13845);
						}
						word32 a0_13890;
						word32 s11_13903;
						word32 s9_13901;
						word32 s10_13902;
						word32 s7_13899;
						word32 s8_13900;
						word32 s4_13897;
						word32 s6_13898;
						word32 s2_13895;
						word32 s3_13896;
						word32 a4_13893;
						word32 a5_13894;
						word32 a1_13891;
						word32 a3_13892;
						ra_4281 = bl_printk(ra_4281, &g_t23085784, 587746728, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_4283, out a0_13890, out a1_13891, out a2_4301, out a3_13892, out a4_13893, out a5_13894, out s2_13895, out s3_13896, out s4_13897, out s5_4321, out s6_13898, out s7_13899, out s8_13900, out s9_13901, out s10_13902, out s11_13903);
					}
					word32 a2_13839;
					word32 a5_13842;
					word32 a7_13844;
					word32 a6_13843;
