pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
					word32 a4_13841;
					word32 a3_13840;
					word32 a1_13838;
					memcpy(fp - 0x0080, s5_4321, a2_4301, out a1_13838, out a2_13839, out a3_13840, out a4_13841, out a5_13842, out a6_13843, out a7_13844);
					(word32) s5_4321 + (fp - 64) + 0x0FC0 = (ptr32) 0x00;
l230388A8:
					union Eq_2 * a0_4415;
					struct Eq_179456 * s0_4424;
					word32 a3_13906;
					word32 a5_13908;
					word32 s2_13909;
					word32 s4_13910;
					word32 s8_13912;
					word32 s5_13911;
					word32 a4_13907;
					word32 a1_13905;
					word32 s1_13904;
					Eq_2 s3_4427;
					Eq_2 ra_4423 = fdt_getprop(ra_4281, s1_4283, 0x23080888, dwLocF8, 0x00, dwLocBC, dwLoc28, dwArg08, out s0_4424, out s1_13904, out a0_4415, out a1_13905, out a3_13906, out a4_13907, out a5_13908, out s2_13909, out s3_4427, out s4_13910, out s5_13911, out s6_4122, out s8_13912);
					union Eq_2 * s2_4435 = a0_4415;
					if (a0_4415 != null)
					{
						if ((word32) s0_4424->bFFFFFC5C <= 0x02 && (word32) g_b4201FD49 <= 0x02)
						{
							if (g_t4200DE84 != 0x00)
							{
								word32 a5_13821;
								xTaskGetTickCountFromISR(out a5_13821);
							}
							else
							{
								word32 a5_13820;
								xTaskGetTickCount(out a5_13820);
							}
							fdt32_to_cpu(*a0_4415);
							word32 a4_13827;
							word32 a2_13825;
							word32 a0_13823;
							word32 a3_13826;
							word32 a1_13824;
							word32 s1_13822;
							word32 a5_13828;
							word32 s4_13829;
							word32 s11_13835;
							word32 s5_13830;
							word32 s7_13831;
							word32 s8_13832;
							word32 s10_13834;
							word32 s9_13833;
							ra_4423 = bl_printk(ra_4423, &g_t23080894, 587746728, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_13822, out a0_13823, out a1_13824, out a2_13825, out a3_13826, out a4_13827, out a5_13828, out s2_4435, out s3_4427, out s4_13829, out s5_13830, out s6_4122, out s7_13831, out s8_13832, out s9_13833, out s10_13834, out s11_13835);
						}
						fdt32_to_cpu(*s2_4435);
					}
					else if ((word32) s0_4424->bFFFFFC5C <= 0x04 && (word32) g_b4201FD49 <= 0x04)
					{
						if (g_t4200DE84 != 0x00)
						{
							word32 a5_13837;
							xTaskGetTickCountFromISR(out a5_13837);
						}
						else
						{
							word32 a5_13836;
							xTaskGetTickCount(out a5_13836);
						}
						word32 a3_13860;
						word32 a5_13862;
						word32 s10_13869;
						word32 s11_13870;
						word32 s2_13863;
						word32 s8_13867;
						word32 s9_13868;
						word32 s4_13864;
						word32 s7_13866;
						word32 s5_13865;
						word32 a4_13861;
						word32 a1_13858;
						word32 a2_13859;
						word32 a0_13857;
						word32 s1_13856;
						ra_4423 = bl_printk(ra_4423, &g_t230808D0, 587746728, dwLocF8, 0x00, s6, s4, dwLoc68, dwLoc44, out s1_13856, out a0_13857, out a1_13858, out a2_13859, out a3_13860, out a4_13861, out a5_13862, out s2_13863, out s3_4427, out s4_13864, out s5_13865, out s6_4122, out s7_13866, out s8_13867, out s9_13868, out s10_13869, out s11_13870);
					}
					ra_4115 = bl_wifi_ap_info_set(ra_4423, fp - 0x00A0, s3_4427, fp - 0x0080, dwArg28, out s1_4117, out s2_4127);
					goto l2303892C;
				}
			}
			goto l230388A8;
		}
	}
	goto l23038890;
}

// 23038D94: Register Eq_2 bl_tsen_adc_get(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 a0, Register word32 a1, Register Eq_116475 fs1, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Register out ptr32 s0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 fs1Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      wifi_mgmr_start
Eq_2 bl_tsen_adc_get(Eq_2 ra, Eq_2 s0, ptr32 a0, word32 a1, Eq_116475 fs1, ptr32 fflags, ptr32 frm, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, ptr32 & s0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & fs1Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	word32 * a5_130 = (word32 *) 0x0FFFFFFF;
	word32 s0_190 = 0x4200D948;
	if ((word32) g_w4200D948 == 0x0FFFFFFF)
	{
		g_w4200D948 = 0x00;
		word32 a5_446;
		word32 a6_447;
		word32 a7_448;
		word32 a1_442;
		word32 a2_443;
		word32 a4_445;
		word32 a3_444;
		memcpy(fp + -64, 587749660, 0x0E, out a1_442, out a2_443, out a3_444, out a4_445, out a5_446, out a6_447, out a7_448);
		GLB_Set_ADC_CLK(0x01, 0x00, 0x07);
		ADC_Disable();
		ADC_Enable();
		ADC_Reset();
		ADC_Init(fp + -64);
		word32 a1_70 = ADC_Channel_Config(0x0E, 0x17, 0x00);
		ADC_FIFO_Cfg(fp + -0x0044, ADC_Tsen_Init(0x00));
		struct Eq_180586 * sp_86;
		Eq_2 ra_93;
		word32 a0_94;
		g_t4200C9E8();
		Eq_2 a5_111 = g_t4200DE84;
		if (a0_94 == 0x01)
		{
			if (a5_111 != 0x00)
			{
				word32 a5_450;
				xTaskGetTickCountFromISR(out a5_450);
			}
			else
			{
				word32 a5_449;
				xTaskGetTickCount(out a5_449);
			}
			word32 s1_468;
			word32 a2_471;
			word32 a1_470;
			word32 a4_473;
			word32 a0_469;
			word32 s2_474;
			word32 a3_472;
			word32 s4_476;
			word32 s5_477;
			word32 s3_475;
			word32 s7_479;
			word32 s8_480;
			word32 s6_478;
			word32 s10_482;
			word32 s11_483;
			word32 s9_481;
			ra = bl_printk(ra_93, &g_t230859A0, 587749744, sp_86->t0008, sp_86->t0028, sp_86->t0070, sp_86->t0074, sp_86->t0098, sp_86->t00BC, out s1_468, out a0_469, out a1_470, out a2_471, out a3_472, out a4_473, out a5_130, out s2_474, out s3_475, out s4_476, out s5_477, out s6_478, out s7_479, out s8_480, out s9_481, out s10_482, out s11_483);
		}
		else
		{
			if (a5_111 != 0x00)
			{
				word32 a5_485;
				xTaskGetTickCountFromISR(out a5_485);
			}
			else
			{
				word32 a5_484;
				xTaskGetTickCount(out a5_484);
			}
			word32 s1_486;
			word32 a2_489;
			word32 a1_488;
			word32 a0_487;
			word32 a3_490;
			word32 a4_491;
			word32 s2_492;
			word32 s3_493;
			word32 s4_494;
			word32 s5_495;
			word32 s6_496;
			word32 s7_497;
			word32 s8_498;
			word32 s9_499;
			word32 s10_500;
			word32 s11_501;
			ra = bl_printk(ra_93, &g_t230859CC, 587749744, sp_86->t0008, sp_86->t0028, sp_86->t0070, sp_86->t0074, sp_86->t0098, sp_86->t00BC, out s1_486, out a0_487, out a1_488, out a2_489, out a3_490, out a4_491, out a5_130, out s2_492, out s3_493, out s4_494, out s5_495, out s6_496, out s7_497, out s8_498, out s9_499, out s10_500, out s11_501);
		}
	}
	Eq_5614 fa0_217;
	ptr32 fflags_220;
	ptr32 frm_221;
	ptr32 fs1_223;
	ptr32 s0_225;
	word32 s3_230;
	word16 * s2_229;
	ptr32 a1_210;
	Eq_2 ra_224 = TSEN_Get_Temp(ra, s0_190, a5_130, fs1, fflags, frm, dwLoc0C, s0, out s0_225, out a1_210, out s2_229, out s3_230, out fs1_223, out fa0_217, out fflags_220, out frm_221);
	if (s3_230 != 0x00)
	{
		Eq_2 a1_247;
		__extendsfdf2(ra_224, fa0_217, fflags_220, frm_221, out a1_247);
		word32 s3_458;
		word32 a5_456;
		word32 a7_457;
		word32 s9_464;
		word32 s8_463;
		word32 s10_465;
		word32 s6_461;
		word32 s7_462;
		word32 t4_467;
		word32 s11_466;
		word32 s5_460;
		word32 s4_459;
		word32 s1_451;
		word32 a0_452;
		word32 a2_453;
		word32 a4_455;
		word32 a3_454;
		printf(ra_224, &g_t230859F0, a1_247, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_451, out a0_452, out a1_210, out a2_453, out a3_454, out a4_455, out a5_456, out a7_457, out s2_229, out s3_458, out s4_459, out s5_460, out s6_461, out s7_462, out s8_463, out s9_464, out s10_465, out s11_466, out t4_467);
	}
	if (s2_229 != null)
		*s2_229 = (word16) (int32) fa0_217;
	s0Out = s0_225;
	a1Out = a1_210;
	a3Out = s2;
	fs1Out = fs1_223;
	fflagsOut = fflags_220;
	frmOut = frm_221;
	return dwLoc08;
}

// 23038EBE: Register word32 bl_rtc_get_counter(Register Eq_2 a4, Register out ptr32 a1Out)
// Called from:
//      bl_rtc_get_timestamp_ms
word32 bl_rtc_get_counter(Eq_2 a4, ptr32 & a1Out)
{
	word32 a0_9 = HBN_Get_RTC_Timer_Val(fp + ~0x17, fp + ~0x13, a4);
	a1Out = fp + ~0x13;
	return a0_9;
}

// 23038ED4: Register ui32 bl_rtc_get_timestamp_ms(Register Eq_2 a4, Register out Eq_136167 a3Out)
// Called from:
//      bl_sys_time_sync_state
ui32 bl_rtc_get_timestamp_ms(Eq_2 a4, union Eq_136167 & a3Out)
{
	uint32 a1_8;
	uint32 a0_7 = bl_rtc_get_counter(a4, out a1_8);
	a3Out = a1_8 >> 0x05;
	return (a0_7 >> 0x05 | a1_8 << 0x1B) - ((a1_8 << 0x14 | a0_7 >> 0x0C) + (a0_7 >> 11 | a1_8 << 0x15));
}

// 23038F24: Register Eq_2 hal_wifi_start_firmware_task(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg01A4)
// Called from:
//      cmd_stack_wifi
Eq_2 hal_wifi_start_firmware_task(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArgD8, Eq_2 dwArg01A4)
{
	word32 tp_49;
	word32 t0_50;
	word32 s0_51;
	word32 a0_52;
	word32 a2_53;
	word32 a3_54;
	word32 a4_55;
	word32 a5_56;
	word32 s2_57;
	return xTaskCreateStatic(ra, &g_ptr2301339E, 587749916, 0x0600, 0x00, 0x1E, 1107373032, 1107379176, mstatus, dwLoc0C, dwArg14, dwArgD8, dwArg01A4, out tp_49, out t0_50, out s0_51, out a0_52, out a2_53, out a3_54, out a4_55, out a5_56, out s2_57);
}

// 23038F5C: void bl_sys_reset_por(Register ptr32 mstatus)
// Called from:
//      hal_reboot
void bl_sys_reset_por(ptr32 mstatus)
{
	__csrrc(mstatus, 0x08);
	g_t4200C5A6();
	while (true)
		;
}

// 23038F6E: void bl_sys_reset_system(Register ptr32 mstatus)
// Called from:
//      hal_sys_reset
void bl_sys_reset_system(ptr32 mstatus)
{
	__csrrc(mstatus, 0x08);
	g_t4200C592();
	while (true)
		;
}

