pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23038F80: Register Eq_2 bl_sys_isxipaddr(Register Eq_2 a0)
// Called from:
//      bl_mtd_write
Eq_2 bl_sys_isxipaddr(Eq_2 a0)
{
	return (word32) (((a0 & 0xFF000000) + 0xDD000000 & 0xDF000000) < 1);
}

// 23038F98: void PtTable_Update_Entry(Register word32 a1, Register Eq_2 a2, Register Eq_2 a3)
// Called from:
//      hal_boot2_update_ptable
void PtTable_Update_Entry(word32 a1, Eq_2 a2, Eq_2 a3)
{
	if (a3 == 0x00 || a2 == 0x00)
		return;
	if (a1 == 0x02)
		return;
	word32 s4_110 = 0x0E000000;
	if (a1 != 0x00)
		s4_110 = 0x0F000000;
	struct Eq_180877 * a4_27 = (word32) *((word32) a2 + 6);
	Eq_2 a5_32 = (word32) a2 + 16;
	struct Eq_180877 * s1_33 = null;
	a3_100 = a3;
	a2_101 = a2;
	while (true)
	{
		Eq_2 a2_101;
		Eq_2 a3_100;
		if (s1_33 >= a4_27)
			break;
		a2_101 = (word32) *a5_32;
		a3_100 = (word32) *a3;
		a5_32 = (word32) a5_32 + 36;
		if (a2_101 == a3_100)
		{
			word32 a4_356;
			word32 a5_357;
			word32 a7_359;
			word32 a6_358;
			word32 a1_355;
			memcpy(a5_32, a3, 36, out a1_355, out a2_101, out a3_100, out a4_356, out a5_357, out a6_358, out a7_359);
			break;
		}
		s1_33 = (struct Eq_180877 *) ((char *) s1_33 + 1);
	}
	struct Eq_180877 * a5_62 = (word32) *((word32) a2 + 6);
	if (a5_62 == s1_33)
	{
		if (s1_33 > (struct Eq_180877 *) 0x0F)
			return;
		word32 a1_360;
		word32 a6_363;
		word32 a5_362;
		word32 a7_364;
		word32 a4_361;
		memcpy(&s1_33->dw0008 + 7 + ((word32) a2 + 16) / 0x0C, a3, 36, out a1_360, out a2_101, out a3_100, out a4_361, out a5_362, out a6_363, out a7_364);
		word32 a5_87 = (word32) *((word32) a2 + 6);
		*((word32) a2 + 6) = (word16) (a5_87 + 0x01);
		a5_62 = a5_87 + 0x01;
	}
	word32 s0_92 = a5_62->dw0008;
	struct Eq_180929 * a5_95 = (char *) a5_62 + 1;
	a5_95->dw0008 = s0_92;
	struct Eq_180935 * a0_116;
	word32 a3_117;
	word32 a2_118;
	word32 s2_119;
	struct Eq_180939 * s0_121;
	word32 s3_123;
	word32 s4_124;
	g_t4200C9DE();
	word32 s1_137 = (word32) s0_121->w0006;
	a0_116->ptr000C = s0_121;
	word32 a0_145;
	ptr32 s2_148;
	Eq_2 ra_149;
	Eq_2 s0_150;
	int32 s1_151;
	word32 s4_153;
	word32 t3_156;
	word32 s8_157;
	word32 a6_158;
	word32 a7_160;
	word32 t0_161;
	word32 t1_162;
	word32 t4_163;
	word32 t5_164;
	word32 t6_165;
	g_t4200C9DE();
	s2_148 + s1_151 = a0_145;
	ui32 a0_170;
	Eq_2 ra_175 = bl_flash_erase(ra_149, s4_153, s1_151 + 20, out a0_170);
	if ((a0_170 & 0x00FF) == 0x00)
	{
		ui32 a0_180;
		word32 a4_366;
		word32 a1_365;
		word32 a5_367;
		bl_flash_write(ra_175, s4_153, s0_150, 596, out a0_180, out a1_365, out a4_366, out a5_367);
		if ((a0_180 & 0x00FF) == 0x00)
			;
	}
}

// 23039080: Register (ptr32 Eq_174234) PtTable_Get_Active_Entries(Register (ptr32 Eq_174234) a0, Register ui32 a1, Register Eq_2 a2)
// Called from:
//      hal_boot2_get_active_entries
struct Eq_174234 * PtTable_Get_Active_Entries(struct Eq_174234 * a0, ui32 a1, Eq_2 a2)
{
	if (a0 == null)
		return (struct Eq_174234 *) 0x05;
	if (a2 == 0x00)
		return (struct Eq_174234 *) 0x05;
	up32 a0_9 = (word32) a0->w0006;
	struct Eq_181053 * a3_10 = &a0->w0006 + 5;
	up32 a5_11;
	for (a5_11 = 0x34; a5_11 < a0_9; ++a5_11)
	{
		++a3_10;
		if ((word32) a3_10->bFFFFFFDC == a1)
		{
			word32 a7_94;
			word32 a6_93;
			word32 a5_92;
			word32 a4_91;
			word32 a3_90;
			word32 a2_89;
			word32 a1_88;
			memcpy(a2, a0 + (a5_11 + 0x00) / 8, 36, out a1_88, out a2_89, out a3_90, out a4_91, out a5_92, out a6_93, out a7_94);
			return null;
		}
	}
	return (struct Eq_174234 *) 0x02;
}

// 230390D4: Register word32 bl_gpio_enable_output(Register word32 a1, Register word32 a2)
// Called from:
//      cmd_gpio_func
//      loopset_led_trigger
word32 bl_gpio_enable_output(word32 a1, word32 a2)
{
	word32 ra_31;
	g_t4200C5D8();
	return ra_31;
}

// 23039118: void bl_gpio_enable_input(Register word32 a1, Register word32 a2)
// Called from:
//      cmd_gpio_func
void bl_gpio_enable_input(word32 a1, word32 a2)
{
	g_t4200C5D8();
}

// 2303915A: void bl_gpio_output_set(Register ui32 a0, Register word32 a1, Register (ptr32 word32) a3)
// Called from:
//      cmd_gpio_set
//      _cb_led_trigger
void bl_gpio_output_set(ui32 a0, word32 a1, word32 * a3)
{
	GLB_GPIO_Write(a0, (word32) (a1 != 0x00), a3);
}

// 2303916E: Register uint32 bl_gpio_input_get(Register uint32 a0, Register (ptr32 byte) a1)
// Called from:
//      cmd_gpio_get
uint32 bl_gpio_input_get(uint32 a0, byte * a1)
{
	*a1 = (byte) GLB_GPIO_Read(a0);
	return 0x00;
}

// 23039186: Register Eq_2 bl_flash_erase(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register out ptr32 a0Out)
// Called from:
//      PtTable_Update_Entry
//      bl_mtd_erase
//      bl_mtd_erase_all
Eq_2 bl_flash_erase(Eq_2 ra, word32 a0, Eq_2 a1, ptr32 & a0Out)
{
	if ((word32) g_b4200DC31 == 0x00)
	{
		a0Out = ~0x00;
		return ra;
	}
	else
	{
		<anonymous> * a4_12 = *(<anonymous> **) 0x21010AB0;
		Eq_2 ra_21;
		a4_12();
		a0Out = 0x00;
		return ra_21;
	}
}

// 230391B6: Register Eq_2 bl_flash_write(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      PtTable_Update_Entry
//      bl_mtd_write
Eq_2 bl_flash_write(Eq_2 ra, word32 a0, Eq_2 a1, Eq_2 a2, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a4_6 = (word32) g_b4200DC31;
	if (a4_6 == 0x00)
	{
		a0Out = ~0x00;
		a1Out = a1;
		a4Out = a4_6;
		a5Out = 0x4200DC20;
		return ra;
	}
	else
	{
		<anonymous> * a4_12 = *(<anonymous> **) 0x21010AAC;
		ptr32 a5_21;
		ptr32 a4_22;
		Eq_2 ra_23;
		Eq_2 a1_26;
		a4_12();
		a0Out = 0x00;
		a1Out = a1_26;
		a4Out = a4_22;
		a5Out = a5_21;
		return ra_23;
	}
}

// 230391E8: Register Eq_2 bl_flash_read(Register Eq_2 ra, Register word32 a0, Register ptr32 a1, Register Eq_2 a2, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      bl_mtd_read
Eq_2 bl_flash_read(Eq_2 ra, word32 a0, ptr32 a1, Eq_2 a2, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a4_6 = (word32) g_b4200DC31;
	if (a4_6 == 0x00)
	{
		a1Out = a1;
		a3Out = a3;
		a4Out = a4_6;
		return ra;
	}
	else
	{
		<anonymous> * a4_12 = *(<anonymous> **) 0x21010AA8;
		ptr32 a4_22;
		Eq_2 ra_23;
		ptr32 a3_25;
		ptr32 a1_26;
		a4_12();
		a1Out = a1_26;
		a3Out = a3_25;
		a4Out = a4_22;
		return ra_23;
	}
}

// 2303921A: Register Eq_2 bl_flash_config_update(Register Eq_2 ra, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out ptr32 s1Out, Register out Eq_2 s2Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      hal_boot2_init
Eq_2 bl_flash_config_update(Eq_2 ra, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, ptr32 & s1Out, union Eq_2 & s2Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & s10Out)
{
	if ((word32) g_b4201FC5C <= 0x02 && (word32) g_b4201FD4B <= 0x02)
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_491;
			xTaskGetTickCountFromISR(out a5_491);
		}
		else
		{
			word32 a5_490;
			xTaskGetTickCount(out a5_490);
		}
		struct Eq_181316 * s3_58;
		struct Eq_181196 * s4_59;
		word32 s11_513;
		word32 s8_512;
		word32 a0_504;
		word32 s7_511;
		word32 s5_510;
		word32 a5_509;
		word32 a4_508;
		word32 a3_507;
		word32 a2_506;
		word32 a1_505;
		ra = bl_printk(ra, &g_t23085A2C, 0x23085A20, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_504, out a1_505, out a2_506, out a3_507, out a4_508, out a5_509, out s2, out s3_58, out s4_59, out s5_510, out s6, out s7_511, out s8_512, out s9, out s10, out s11_513);
		if ((word32) s3_58->bFFFFFC5C <= 0x02 && (word32) s4_59->bFFFFFD4B <= 0x02)
		{
			if (*((word32) s2 - 380) != 0x00)
			{
				word32 a5_493;
				xTaskGetTickCountFromISR(out a5_493);
			}
			else
			{
				word32 a5_492;
				xTaskGetTickCount(out a5_492);
			}
			struct Eq_181544 * s3_103;
			struct Eq_181216 * s4_104;
			word32 a0_566;
			word32 a1_567;
			word32 a2_568;
			word32 a3_569;
			word32 a4_570;
			word32 a5_571;
			word32 s5_572;
			word32 s7_573;
			word32 s8_574;
			word32 s11_575;
			ra = bl_printk(ra, &g_t23085A78, s1 + -0x05E0, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_566, out a1_567, out a2_568, out a3_569, out a4_570, out a5_571, out s2, out s3_103, out s4_104, out s5_572, out s6, out s7_573, out s8_574, out s9, out s10, out s11_575);
			if ((word32) s3_103->bFFFFFC5C <= 0x02 && (word32) s4_104->bFFFFFD4B <= 0x02)
			{
				if (*((word32) s2 - 380) != 0x00)
				{
					word32 a5_495;
					xTaskGetTickCountFromISR(out a5_495);
				}
				else
				{
					word32 a5_494;
					xTaskGetTickCount(out a5_494);
				}
				struct Eq_181505 * s3_147;
				struct Eq_181236 * s4_148;
				word32 a0_556;
				word32 a1_557;
				word32 a2_558;
				word32 a3_559;
				word32 a4_560;
				word32 a5_561;
				word32 s5_562;
				word32 s7_563;
				word32 s8_564;
				word32 s11_565;
				ra = bl_printk(ra, &g_t23085A98, s1 + -0x05E0, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_556, out a1_557, out a2_558, out a3_559, out a4_560, out a5_561, out s2, out s3_147, out s4_148, out s5_562, out s6, out s7_563, out s8_564, out s9, out s10, out s11_565);
				if ((word32) s3_147->bFFFFFC5C <= 0x02 && (word32) s4_148->bFFFFFD4B <= 0x02)
				{
					if (*((word32) s2 - 380) != 0x00)
					{
						word32 a5_497;
						xTaskGetTickCountFromISR(out a5_497);
					}
					else
					{
						word32 a5_496;
						xTaskGetTickCount(out a5_496);
					}
					word32 a0_546;
					struct Eq_181467 * s3_191;
					struct Eq_181256 * s4_192;
					word32 a1_547;
					word32 a2_548;
					word32 a3_549;
					word32 a4_550;
					word32 a5_551;
					word32 s5_552;
					word32 s7_553;
					word32 s8_554;
					word32 s11_555;
					ra = bl_printk(ra, &g_t23085ABC, s1 + -0x05E0, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_546, out a1_547, out a2_548, out a3_549, out a4_550, out a5_551, out s2, out s3_191, out s4_192, out s5_552, out s6, out s7_553, out s8_554, out s9, out s10, out s11_555);
					if ((word32) s3_191->bFFFFFC5C <= 0x02 && (word32) s4_192->bFFFFFD4B <= 0x02)
					{
						if (*((word32) s2 - 380) != 0x00)
						{
							word32 a5_499;
							xTaskGetTickCountFromISR(out a5_499);
						}
						else
						{
							word32 a5_498;
							xTaskGetTickCount(out a5_498);
						}
						word32 a0_536;
						word32 a1_537;
						word32 a2_538;
						word32 a3_539;
						word32 a4_540;
						word32 a5_541;
						word32 s5_542;
						word32 s7_543;
						word32 s8_544;
						word32 s11_545;
						struct Eq_181437 * s3_235;
						struct Eq_181276 * s4_236;
						ra = bl_printk(ra, &g_t23085AE4, s1 + -0x05E0, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_536, out a1_537, out a2_538, out a3_539, out a4_540, out a5_541, out s2, out s3_235, out s4_236, out s5_542, out s6, out s7_543, out s8_544, out s9, out s10, out s11_545);
						if ((word32) s3_235->bFFFFFC5C <= 0x02 && (word32) s4_236->bFFFFFD4B <= 0x02)
						{
							if (*((word32) s2 - 380) != 0x00)
							{
								word32 a5_501;
								xTaskGetTickCountFromISR(out a5_501);
							}
							else
							{
								word32 a5_500;
								xTaskGetTickCount(out a5_500);
							}
							word32 a0_526;
							word32 a1_527;
							word32 a2_528;
							word32 a3_529;
							word32 a4_530;
							word32 a5_531;
							word32 s5_532;
							word32 s7_533;
							word32 s8_534;
							word32 s11_535;
							struct Eq_181398 * s3_279;
							struct Eq_181296 * s4_280;
							ra = bl_printk(ra, &g_t23085B10, s1 + -0x05E0, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_526, out a1_527, out a2_528, out a3_529, out a4_530, out a5_531, out s2, out s3_279, out s4_280, out s5_532, out s6, out s7_533, out s8_534, out s9, out s10, out s11_535);
							if ((word32) s3_279->bFFFFFC5C <= 0x02 && (word32) s4_280->bFFFFFD4B <= 0x02)
							{
								if (*((word32) s2 - 380) != 0x00)
								{
									word32 a5_503;
									xTaskGetTickCountFromISR(out a5_503);
								}
								else
								{
									word32 a5_502;
									xTaskGetTickCount(out a5_502);
								}
								word32 s11_525;
								word32 s8_524;
								word32 s7_523;
								word32 s5_522;
								word32 s4_521;
								word32 s3_520;
								word32 a5_519;
								word32 a4_518;
								word32 a3_517;
								word32 a2_516;
								word32 a1_515;
								word32 a0_514;
								ra = bl_printk(ra, &g_t23085B38, s1 + -0x05E0, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1, out a0_514, out a1_515, out a2_516, out a3_517, out a4_518, out a5_519, out s2, out s3_520, out s4_521, out s5_522, out s6, out s7_523, out s8_524, out s9, out s10, out s11_525);
							}
						}
					}
				}
			}
		}
	}
	s1Out = s1;
	s2Out = s2;
	s4Out = dwArg04;
	s6Out = s6;
	s8Out = s4;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

// 23039428: void bl_wdt_feed()
// Called from:
//      cmd_wdt_feed
void bl_wdt_feed()
{
	WDT_ResetCounterValue();
}

// 2303942C: void bl_wdt_disable()
// Called from:
//      cmd_wdt_disable
void bl_wdt_disable()
{
	WDT_Disable();
}

// 23039430: void bl_wdt_init(Register Eq_2 a0)
// Called from:
//      cmd_wdt_init
void bl_wdt_init(Eq_2 a0)
{
	if (a0 > 0x00FFFFFE)
		return;
	WDT_Disable();
	WDT_Set_Clock(0x01, 0x01);
	WDT_SetCompValue(a0 << 0x14 >> 16);
	WDT_ResetCounterValue();
	WDT_IntMask(0x00, 0x01);
	WDT_Enable();
}

// 23039476: void httpc_tcp_sent()
void httpc_tcp_sent()
{
}

// 2303947A: Register Eq_2 httpc_get_internal_addr(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register out ptr32 a3Out, Register out ptr32 a5Out)
// Called from:
//      httpc_dns_found
//      httpc_get_file_dns
Eq_2 httpc_get_internal_addr(Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 & a3Out, ptr32 & a5Out)
{
	if ((word32) a0 + 4 != a1)
		*((word32) a4 + 4) = a0;
	word32 a0_13 = *a0;
	ptr32 a5_20;
	Eq_2 a0_18 = altcp_connect(a0_13, (word32) a0 + 4, out a5_20);
	a3Out = 0x23039820;
	a5Out = a5_20;
	return a0_18;
}

// 2303949A: Register word32 httpc_free_state(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out (ptr32 Eq_2) s6Out)
// Called from:
//      httpc_tcp_connected
//      httpc_init_connection_common.constprop.5
//      httpc_get_file_dns
word32 httpc_free_state(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, union Eq_2 & s6Out)
{
	Eq_2 s0_19;
	Eq_2 ra_41;
	Eq_2 a0_12 = *((word32) a0 + 16);
	ra_41 = ra;
	s0_19 = s0;
	if (a0_12 != 0x00)
	{
		struct Eq_181681 * s1_26;
		word32 s6_253;
		word32 a7_251;
		word32 s8_254;
		word32 s5_252;
		word32 a2_249;
		word32 a5_250;
		word32 a1_248;
		ra_41 = pbuf_free(ra, a0_12, a3, a4, s4, mstatus, dwArg0118, out s0_19, out s1_26, out a0_12, out a1_248, out a2_249, out a3, out a4, out a5_250, out a7_251, out s2, out s3, out s4, out s5_252, out s6_253, out s8_254, out mstatus);
		s1_26->dw0010 = 0x00;
	}
	if (a0_12 != 0x00)
	{
		struct Eq_181773 * s1_61;
		word32 a0_259;
		word32 a1_260;
		word32 a2_261;
		word32 a5_262;
		word32 a7_263;
		word32 s5_264;
		word32 s6_265;
		word32 s8_266;
		pbuf_free(ra_41, a0_12, a3, a4, s4, mstatus, dwArg0118, out s0_19, out s1_61, out a0_259, out a1_260, out a2_261, out a3, out a4, out a5_262, out a7_263, out s2, out s3, out s4, out s5_264, out s6_265, out s8_266, out mstatus);
		s1_61->dw0014 = 0x00;
	}
	ptr32 a4_98;
	struct Eq_456 ** a5_99;
	word32 s1_103;
	ptr32 s2_104;
	ptr32 s3_105;
	ptr32 s5_107;
	union Eq_2 * s6_108;
	word32 a3_255;
	word32 a7_256;
	word32 s4_257;
	word32 s8_258;
	struct Eq_456 * s0_102 = mem_free(*s0_19, a3, a4, s2, s3, s4, mstatus, s0, dwLoc08, dwArg14, ra, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out s1_103, out a3_255, out a4_98, out a5_99, out a7_256, out s2_104, out s3_105, out s4_257, out s5_107, out s6_108, out s8_258);
	if (s0_102 != null)
	{
		altcp_arg(s0_102, 0x00);
		altcp_recv(s0_102, null);
		altcp_err(s0_102, null);
		struct Eq_181822 * a5_130;
		altcp_poll(s0_102, null, 0x00, a5_99, out a5_130);
		altcp_sent(s0_102, null);
		struct Eq_181840 * a5_136;
		if (altcp_close(s0_102, a5_130, out a5_136) != 0x00)
		{
			altcp_abort(s0_102, a5_136);
l230394C8:
			a4Out = a4_98;
			s2Out = s2_104;
			s3Out = s3_105;
			s5Out = s5_107;
			s6Out = s6_108;
			return s1_103;
		}
	}
	goto l230394C8;
}

// 2303950E: void httpc_close(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a2, Register Eq_2 a3, Register (ptr32 Eq_181860) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
// Called from:
//      httpc_tcp_recv
//      httpc_dns_found
//      httpc_tcp_poll
//      httpc_tcp_err
//      httpc_tcp_connected
void httpc_close(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a2, Eq_2 a3, struct Eq_181860 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_10 = a5->t0020;
	Eq_2 a4_12 = a3;
	Eq_2 s0_13 = a0_10;
	Eq_2 a3_15 = a2;
	if (a5 != null)
	{
		<anonymous> * a5_16 = a5->ptr0014;
		if (a5_16 != null)
		{
			word32 a1_73;
			word32 a6_74;
			word32 a7_75;
			word32 s1_76;
			word32 s5_77;
			word32 s6_78;
			word32 s8_79;
			word32 t0_80;
			word32 t1_81;
			word32 t3_82;
			word32 t4_83;
			word32 t5_84;
			word32 t6_85;
			word32 tp_86;
			a5_16();
		}
	}
	word32 s6_155;
	word32 s5_154;
	word32 s3_153;
	word32 s2_152;
	word32 a4_151;
	httpc_free_state(ra, s0, s0_13, a3_15, a4_12, s2, s3, s4, mstatus, dwArg14, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, dwArg0188, out a4_151, out s2_152, out s3_153, out s5_154, out s6_155);
}

