pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23039538: void httpc_tcp_recv(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register word32 s7, Register word32 s8, Register word32 s9, Register ptr32 mstatus, Stack ptr32 dwArg14, Stack ptr32 dwArg34, Stack word32 dwArgC8, Stack word32 dwArgE8, Stack word32 dwArg0198)
void httpc_tcp_recv(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, word32 s7, word32 s8, word32 s9, ptr32 mstatus, ptr32 dwArg14, ptr32 dwArg34, word32 dwArgC8, word32 dwArgE8, word32 dwArg0198)
{
	Eq_2 a2_481;
	Eq_2 a3_283;
	*(union Eq_2 *) 0x2A = a0;
	struct Eq_181942 * sp_3 = fp + -64;
	Eq_2 s0_101 = a0;
	struct Eq_181860 * a5_265 = (word32) *((word32) a0 + 48);
	if (a2 == 0x00)
	{
		a2_481 = (word32) *((word32) a0 + 26);
		a3_283.u0 = 0x00;
		goto l2303957C;
	}
	Eq_2 s3_104 = a1;
	Eq_2 s1_102 = a2;
	Eq_2 s4_191 = a3;
	if (a5_265 == (struct Eq_181860 *) 0x02)
	{
l230395A8:
		Eq_2 a4_488 = (word32) *((word32) s1_102 + 8);
		word32 a5_491 = a5_265 + a4_488;
		a5_491->dw0028 = a5_265->dw0028;
		if (a5_491 != null)
		{
			word32 t0_600;
			word32 t1_601;
			word32 a7_602;
			word32 t4_603;
			word32 t5_604;
			word32 t6_605;
			word32 t2_606;
			a5_491();
			goto l23039582;
		}
		word32 a5_954;
		altcp_recved(s3_104, a5_491, out a5_954);
		word32 s4_966;
		word32 mstatus_970;
		word32 s8_969;
		word32 s5_967;
		word32 s6_968;
		word32 a1_958;
		word32 a4_961;
		word32 a5_962;
		word32 s2_964;
		word32 s3_965;
		word32 a7_963;
		word32 a2_959;
		word32 a3_960;
		word32 a0_957;
		word32 s0_955;
		word32 s1_956;
		pbuf_free(ra, s1_102, a3, a4_488, s4_191, mstatus, sp_3->t0128, out s0_955, out s1_956, out a0_957, out a1_958, out a2_959, out a3_960, out a4_961, out a5_962, out a7_963, out s2_964, out s3_965, out s4_966, out s5_967, out s6_968, out s8_969, out mstatus_970);
		goto l23039796;
	}
	a0 = *((word32) a0 + 20);
	if (a0 == 0x00)
		*((word32) a2 + 20) = a0;
	else
		pbuf_cat(a0, a2, 0x02);
	if ((word32) *((word32) a0 + 48) == 0x00)
	{
		s6 = *((word32) a0 + 20);
		word32 a5_973;
		word32 a2_971;
		word32 a4_972;
		s0_101 = pbuf_memfind(s6, 0x02, 0x00, dwArg14, dwArgC8, out s1_102, out a0, out a2_971, out a3, out a4_972, out a5_973, out s2, out s3_104, out s4_191, out s8);
		s7 = 0x0FFFFFFF;
		s5 = a0;
		if (a0 != 0x0FFFFFFF)
		{
			s9 = 0x23081000;
			word32 a2_974;
			word32 a5_976;
			word32 s2_977;
			word32 a4_975;
			s0_101 = pbuf_memfind(s6, 0x01, 0x00, dwArg14, dwArgC8, out s1_102, out a0, out a2_974, out a3, out a4_975, out a5_976, out s2_977, out s3_104, out s4_191, out s8);
			s2 = a0;
			if (a0 != 0x0FFFFFFF)
			{
				word32 a4_978;
				word32 a5_979;
				s0_101 = pbuf_memcmp(s6, 0x00, 0x05, dwArg34, dwArgE8, out s1_102, out a0, out a3, out a4_978, out a5_979, out s2, out s3_104);
				if (a0 == 0x00)
				{
					word32 a4_980;
					a0 = pbuf_get_at(s6, 0x06, out a3, out a4_980);
					if (a0 == 46)
					{
						ptr32 s2_161;
						word32 a4_982;
						word32 a3_983;
						word32 a4_984;
						word32 a3_981;
						*((word32) s0_101 + 24) = (word16) ((word32) pbuf_get_at(s6, 0x07, out a3_983, out a4_984) - 48 | (word32) ((word16) ((word32) pbuf_get_at(s6, 0x05, out a3_981, out a4_982) - 48)) << 8);
						word32 a0_146;
						Eq_2 s8_153;
						ui32 s2_158;
						word32 s3_990;
						word32 s4_991;
						word32 s1_985;
						word32 a2_986;
						word32 a4_988;
						word32 a5_989;
						word32 a3_987;
						pbuf_memfind(s6, 0x01, (word32) (word16) ((word32) s2 + 1), dwArg14, dwArgC8, out s1_985, out a0_146, out a2_986, out a3_987, out a4_988, out a5_989, out s2_158, out s3_990, out s4_991, out s8_153);
						if (a0_146 != 0x0FFFFFFF)
							s2_161 = a0_146 - s2_158;
						else
							s2_161 = a0 - s2_158;
						word32 a4_1014;
						word32 a5_1015;
						word32 t1_1009;
						word32 a0_1010;
						word32 a2_1012;
						word32 a3_1013;
						word32 a1_1011;
						ra = memset(ra, fp + -64, 0x00, 0x0A, out t1_1009, out a0_1010, out a1_1011, out a2_1012, out a3_1013, out a4_1014, out a5_1015);
						word32 a4_1018;
						word32 a5_1019;
						word32 a2_1017;
						word32 a1_1016;
						s0_101 = pbuf_copy_partial(s6, fp + -64, (word32) (word16) (s2_161 + ~0x00), s8_153, out s1_102, out a0, out a1_1016, out a2_1017, out a3, out a4_1018, out a5_1019, out s2, out s3_104, out s4_191, out s8);
						if (s2 == a0)
						{
							word32 a4_994;
							word32 a5_995;
							word32 a2_993;
							word32 a1_992;
							a0 = atoi(fp + -64, out a1_992, out a2_993, out a3, out a4_994, out a5_995);
							if (a0 <= 0xF0000001)
							{
								*((word32) s0_101 + 26) = (word16) a0;
								((word32) s0_101 + 48)->u1 = 0x01;
l230396B8:
								s6 = *((word32) s0_101 + 20);
								word32 a4_1021;
								word32 a5_1022;
								word32 s2_1023;
								word32 a2_1020;
								s0_101 = pbuf_memfind(s6, 0x04, 0x00, dwArg14, dwArgC8, out s1_102, out a0, out a2_1020, out a3, out a4_1021, out a5_1022, out s2_1023, out s3_104, out s4_191, out s8);
								s7 = 0x10000000;
								s2 = a0;
								if (a0 <= 0x0FFFFFFC)
								{
									*(union Eq_2 *) 0x2B = s0_101;
									Eq_2 a0_273;
									word32 s1_996;
									word32 s2_285;
									Eq_2 s3_286;
									struct Eq_415 * a5_276;
									word32 s8_280;
									Eq_2 a2_274;
									Eq_2 a4_275;
									pbuf_memfind(s6, 0x10, 0x00, dwArg14, dwArgC8, out s1_996, out a0_273, out a2_274, out a3_283, out a4_275, out a5_276, out s2_285, out s3_286, out s4, out s8_280);
									s7 = 0x0FFFFFFF;
									if (a0_273 != 0x0FFFFFFF)
									{
										word32 a0_295;
										word32 s1_997;
										pbuf_memfind(s6, 0x02, a0_273, dwArg14, dwArgC8, out s1_997, out a0_295, out a2_274, out a3_283, out a4_275, out a5_276, out s2_285, out s3_286, out s4, out s8_280);
										if (a0_295 != 0x0FFFFFFF)
										{
											word32 a3_1002;
											word32 a4_1003;
											word32 a5_1004;
											word32 t1_998;
											word32 a1_1000;
											word32 a2_1001;
											word32 a0_999;
											ra = memset(ra, fp + -64, 0x00, 0x10, out t1_998, out a0_999, out a1_1000, out a2_1001, out a3_1002, out a4_1003, out a5_1004);
											word32 a0_334;
											word32 s1_341;
											word32 a1_1005;
											Eq_2 s0_337 = pbuf_copy_partial(s6, fp + -64, (word32) (word16) (a0_295 - a0_273 + ~0x0F), (word32) (word16) ((word32) a0_273 + 16), out s1_341, out a0_334, out a1_1005, out a2_274, out a3_283, out a4_275, out a5_276, out s2_285, out s3_286, out s4, out s8_280);
											if (s1_341 == a0_334)
											{
												word32 a1_1006;
												Eq_2 a0_355 = atoi(fp + -64, out a1_1006, out a2_274, out a3_283, out a4_275, out a5_276);
												if (a0_355 >= 0x00)
													*((word32) a0_355 + 44) = s0_337;
											}
										}
									}
									Eq_2 s1_374 = (word32) (word16) (s2_285 + 4);
									struct Eq_182272 * a5_381;
									Eq_2 a0_379 = altcp_recved(s3_286, a5_276, out a5_381);
									if (a5_381 != null)
									{
										<anonymous> * a5_384 = a5_381->ptr0018;
										if (a5_384 != null)
										{
											Eq_2 s0_389 = *((word32) s1_374 + 36);
											word32 t0_425;
											word32 t1_426;
											word32 a7_427;
											word32 t4_428;
											word32 t5_429;
											word32 t6_430;
											word32 t2_431;
											a5_384();
											a3_283 = a0_379;
											if (a0_379 != 0x00)
											{
												a2_481 = (word32) *((word32) s0_101 + 26);
l2303957C:
												httpc_close(ra, s0_101, s0_101, a2_481, a3_283, a5_265, s2, s3, s4, mstatus, sp_3->t0014, sp_3->t0094, sp_3->t00C8, sp_3->t00E8, sp_3->t0108, sp_3->t0118, sp_3->t0128, sp_3->t0148, sp_3->t0168, sp_3->t0188);
l23039582:
												0x00 = dwArg0198;
												return;
											}
										}
									}
									struct Eq_182358 * s0_452;
									word32 s1_1007;
									word32 a4_1008;
									ra = pbuf_free_header(ra, s1_374, a0_379, s1_374, a2_274, a3_283, a4_275, s4, mstatus, sp_3->t0044, sp_3->t0108, out s0_452, out s1_1007, out a0, out a3, out a4_1008, out s2, out s3_104, out s4_191, out s5, out s6, out s8, out mstatus);
									s0_452->dw0014 = 0x00;
									s0_452->b0030 = 0x02;
									a5_265 = (struct Eq_181860 *) 0x02;
									s1_102 = a0;
									if (a0 == 0x00)
									{
l23039796:
										goto l23039582;
									}
									goto l230395A8;
								}
l2303978C:
								a5_265 = (struct Eq_181860 *) 0x02;
								if ((word32) *((word32) s0_101 + 48) != 0x02)
									goto l23039796;
								goto l230395A8;
							}
						}
					}
				}
			}
		}
	}
	if ((word32) *((word32) s0_101 + 48) != 0x01)
		goto l2303978C;
	goto l230396B8;
}

// 230397C4: void httpc_dns_found(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register (ptr32 Eq_181860) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void httpc_dns_found(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a2, Eq_2 a4, struct Eq_181860 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	Eq_2 a3_12;
	if (a1 != 0x00)
	{
		word32 a3_129;
		Eq_2 a0_15 = httpc_get_internal_addr(a2, a1, a4, out a3_129, out a5);
		a3_12 = a0_15;
		if (a0_15 == 0x00)
			return;
	}
	else
		a3_12.u0 = ~0x0F;
	httpc_close(ra, s0, a2, 0x00, a3_12, a5, s2, s3, s4, mstatus, dwArg14, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, dwArg0188);
}

