pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 230397F4: void httpc_tcp_poll(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register (ptr32 Eq_181860) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void httpc_tcp_poll(Eq_2 ra, Eq_2 s0, word32 a0, struct Eq_181860 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_6 = a5->t000C;
	if (a5 != null)
	{
		a5->t000B = a0_6;
		a5 = (struct Eq_181860 *) ((char *) a5 - 1);
		if (a5 != (struct Eq_181860 *) ~0x00)
			return;
	}
	httpc_close(ra, s0, a0_6, 0x00, 0x00, a5, s2, s3, s4, mstatus, dwArg14, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, dwArg0188);
}

// 2303980E: void httpc_tcp_err(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register (ptr32 Eq_181860) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void httpc_tcp_err(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, struct Eq_181860 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	if (a0 == 0x00)
		return;
	*a0 = 0x00;
	httpc_close(ra, s0, a0, 0x00, a1, a5, s2, s3, s4, mstatus, dwArg14, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, dwArg0188);
}

// 23039820: void httpc_tcp_connected(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_182647) a1, Register Eq_2 a4, Register (ptr32 Eq_182649) a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0188)
void httpc_tcp_connected(Eq_2 ra, Eq_2 s0, struct Eq_182647 * a1, Eq_2 a4, struct Eq_182649 * a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0168, Eq_2 dwArg0188)
{
	Eq_2 a0_9 = a5->t0010;
	struct Eq_181860 * a5_21;
	Eq_2 a0_19 = altcp_write(*a0_9, a1->ptr0004, out a5_21);
	if (a0_19 == 0x00)
	{
		struct Eq_182723 ** a0_26;
		struct Eq_182686 * a5_34;
		word32 s0_130;
		word32 s1_131;
		word32 a1_132;
		word32 a2_133;
		word32 a3_134;
		word32 a4_135;
		word32 a7_136;
		word32 s2_137;
		word32 s3_138;
		word32 s4_139;
		word32 s5_140;
		word32 s6_141;
		word32 s8_142;
		word32 mstatus_143;
		pbuf_free(ra, a0_19, 0x01, a4, s4, mstatus, dwArg0118, out s0_130, out s1_131, out a0_26, out a1_132, out a2_133, out a3_134, out a4_135, out a5_34, out a7_136, out s2_137, out s3_138, out s4_139, out s5_140, out s6_141, out s8_142, out mstatus_143);
		*((char *) *a0_26 + 16) = 0x00;
		altcp_output(a0_26, a5_34);
	}
	else
		httpc_close(ra, s0, a0_9, 0x00, a0_19, a5_21, s2, s3, s4, mstatus, dwArg14, dwArg94, dwArgC8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0148, dwArg0168, dwArg0188);
}

// 2303986C: Register Eq_2 httpc_create_request_string.constprop.6(Register Eq_2 ra, Register (ptr32 Eq_1275) a0, Register int32 a2, Register Eq_2 a4, Register Eq_7997 a5, Register Eq_2 s3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out)
// Called from:
//      httpc_init_connection_common.constprop.5
Eq_2 httpc_create_request_string.constprop.6(Eq_2 ra, struct Eq_1275 * a0, int32 a2, Eq_2 a4, Eq_7997 a5, Eq_2 s3, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgCC, Eq_2 dwArg0118, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out)
{
	if ((word32) a0->b0006 == 0x00)
	{
		if ((word32) a0->b0007 != 0x01)
		{
			ptr32 a0_38;
			ptr32 a3_41;
			ptr32 a4_42;
			ptr32 s0_46;
			ptr32 s1_47;
			ptr32 s2_50;
			ptr32 s3_51;
			Eq_2 s4_52;
			ptr32 s5_53;
			ptr32 s6_54;
			ptr32 s7_55;
			ptr32 s8_56;
			word32 a1_299;
			word32 a2_300;
			word32 a5_301;
			word32 a7_302;
			word32 s9_303;
			word32 s10_304;
			word32 s11_305;
			Eq_2 ra_45 = snprintf(ra, a4, a5, &g_t23085CDC, dwArg18, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgCC, out s0_46, out s1_47, out a0_38, out a1_299, out a2_300, out a3_41, out a4_42, out a5_301, out a7_302, out s2_50, out s3_51, out s4_52, out s5_53, out s6_54, out s7_55, out s8_56, out s9_303, out s10_304, out s11_305);
			s0Out = s0_46;
			s1Out = s1_47;
			a0Out = a0_38;
			a3Out = a3_41;
			a4Out = a4_42;
			s2Out = s2_50;
			s3Out = s3_51;
			s4Out = s4_52;
			s5Out = s5_53;
			s6Out = s6_54;
			s7Out = s7_55;
			s8Out = s8_56;
			return ra_45;
		}
		else
		{
			(word32) a0->b000C > 0x03;
			Eq_7997 a1_84;
			word32 a2_286;
			word32 a3_287;
			word32 a4_288;
			word32 a5_289;
			strlen(a4, out a1_84, out a2_286, out a3_287, out a4_288, out a5_289);
			ptr32 a0_99;
			ptr32 a3_102;
			ptr32 a4_103;
			ptr32 s0_107;
			ptr32 s1_108;
			ptr32 s2_111;
			ptr32 s3_112;
			ptr32 s5_114;
			ptr32 s6_115;
			ptr32 s7_116;
			word32 a1_290;
			word32 a2_291;
			word32 a5_292;
			word32 a7_293;
			word32 s4_294;
			word32 s8_295;
			word32 s9_296;
			word32 s10_297;
			word32 s11_298;
			Eq_2 ra_106 = snprintf(ra, a4, a1_84, &g_t23085C64, s3, dwLoc08, dwArg24, dwArg40, dwArg44, dwArg68, dwArg8C, out s0_107, out s1_108, out a0_99, out a1_290, out a2_291, out a3_102, out a4_103, out a5_292, out a7_293, out s2_111, out s3_112, out s4_294, out s5_114, out s6_115, out s7_116, out s8_295, out s9_296, out s10_297, out s11_298);
			s0Out = s0_107;
			s1Out = s1_108;
			a0Out = a0_99;
			a3Out = a3_102;
			a4Out = a4_103;
			s2Out = s2_111;
			s3Out = s3_112;
			s4Out = dwArg0118;
			s5Out = s5_114;
			s6Out = s6_115;
			s7Out = s7_116;
			s8Out = dwArgD4;
			return ra_106;
		}
	}
	else if (a2 == 80)
	{
		ptr32 a0_142;
		ptr32 a3_145;
		ptr32 a4_146;
		ptr32 s0_150;
		ptr32 s1_151;
		ptr32 s2_154;
		ptr32 s3_155;
		Eq_2 s4_156;
		ptr32 s5_157;
		ptr32 s6_158;
		ptr32 s7_159;
		ptr32 s8_160;
		word32 a1_306;
		word32 a2_307;
		word32 a5_308;
		word32 a7_309;
		word32 s9_310;
		word32 s10_311;
		word32 s11_312;
		Eq_2 ra_149 = snprintf(ra, a4, a5, &g_t23085C0C, dwArg18, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgCC, out s0_150, out s1_151, out a0_142, out a1_306, out a2_307, out a3_145, out a4_146, out a5_308, out a7_309, out s2_154, out s3_155, out s4_156, out s5_157, out s6_158, out s7_159, out s8_160, out s9_310, out s10_311, out s11_312);
		s0Out = s0_150;
		s1Out = s1_151;
		a0Out = a0_142;
		a3Out = a3_145;
		a4Out = a4_146;
		s2Out = s2_154;
		s3Out = s3_155;
		s4Out = s4_156;
		s5Out = s5_157;
		s6Out = s6_158;
		s7Out = s7_159;
		s8Out = s8_160;
		return ra_149;
	}
	else
	{
		ptr32 a0_177;
		ptr32 a3_180;
		ptr32 a4_181;
		ptr32 s0_185;
		ptr32 s1_186;
		ptr32 s2_189;
		ptr32 s3_190;
		Eq_2 s4_191;
		ptr32 s5_192;
		ptr32 s6_193;
		ptr32 s7_194;
		ptr32 s8_195;
		word32 a1_279;
		word32 a2_280;
		word32 a5_281;
		word32 a7_282;
		word32 s9_283;
		word32 s10_284;
		word32 s11_285;
		Eq_2 ra_184 = snprintf(ra, a4, a5, &g_t23085BB0, dwArg18, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgCC, out s0_185, out s1_186, out a0_177, out a1_279, out a2_280, out a3_180, out a4_181, out a5_281, out a7_282, out s2_189, out s3_190, out s4_191, out s5_192, out s6_193, out s7_194, out s8_195, out s9_283, out s10_284, out s11_285);
		s0Out = s0_185;
		s1Out = s1_186;
		a0Out = a0_177;
		a3Out = a3_180;
		a4Out = a4_181;
		s2Out = s2_189;
		s3Out = s3_190;
		s4Out = s4_191;
		s5Out = s5_192;
		s6Out = s6_193;
		s7Out = s7_194;
		s8Out = s8_195;
		return ra_184;
	}
}

// 2303995A: Register Eq_2 httpc_init_connection_common.constprop.5(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_1275) a1, Register int32 a3, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack word32 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_2) s6Out, Register out Eq_2 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      httpc_get_file_dns
Eq_2 httpc_init_connection_common.constprop.5(Eq_2 ra, Eq_2 s0, struct Eq_1275 * a1, int32 a3, Eq_2 s3, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, word32 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a4Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_2 & s8Out, ptr32 & mstatusOut)
{
	ptr32 a5_101;
	up32 a0_49;
	Eq_2 a3_52;
	Eq_2 s0_58;
	Eq_2 s7_67;
	word32 s8_509;
	word32 s4_508;
	union Eq_2 * s6_238;
	ptr32 s5_237;
	Eq_2 s3_235;
	Eq_2 s2_234;
	Eq_2 s1_231;
	Eq_2 a4_225;
	Eq_2 ra_137 = httpc_create_request_string.constprop.6(ra, a1, a3, 0x00, 0x00, s3, dwLoc18, dwLoc0C, dwArg08, dwArg10, dwArg14, dwArg34, dwArg38, s9, s7, s3, dwArg78, dwArg9C, dwArgE8, out s0_58, out s1_231, out a0_49, out a3_52, out a4_225, out s2_234, out s3_235, out s4_508, out s5_237, out s6_238, out s7_67, out s8_509);
	if (a0_49 > 0x0FFFFFFE)
	{
l23039A74:
		a5_101 = ~0x05;
		goto l230399DA;
	}
	else
	{
		Eq_2 a0_78;
		word32 s8_515;
		word32 s4_514;
		word32 a7_513;
		word32 a5_512;
		word32 a3_511;
		word32 a1_510;
		s1_231 = mem_malloc(ra_137, s0_58, 52, a3_52, a4_225, s2_234, mstatus, s0, dwArg04, ra, dwArgB8, dwArgD8, dwArgF8, dwArg0118, dwArg0158, out a0_78, out a1_510, out a3_511, out a4_225, out a5_512, out a7_513, out s2_234, out s3_235, out s4_514, out s5_237, out s6_238, out s8_515);
		a5_101 = ~0x00;
		if (a0_78 != 0x00)
		{
			Eq_2 a3_107;
			Eq_2 a4_108;
			word32 a5_520;
			word32 a2_519;
			word32 a1_518;
			word32 a0_517;
			word32 t1_516;
			Eq_2 ra_110 = memset(ra_137, a0_78, 0x00, 52, out t1_516, out a0_517, out a1_518, out a2_519, out a3_107, out a4_108, out a5_520);
			*(union Eq_2 *) 0x2A = a0_78;
			struct Eq_183132 * a0_120;
			struct Eq_183176 ** a5_124;
			Eq_2 s0_125;
			word32 a7_524;
			word32 a2_523;
			word32 a1_522;
			word32 s1_521;
			word32 s5_525;
			word32 s6_526;
			word32 s8_527;
			Eq_2 a4_123;
			Eq_2 a3_122;
			Eq_2 s4_133;
			Eq_2 s2_131;
			Eq_2 s3_132;
			ra_137 = pbuf_alloc(ra_110, a0_78, s1_231, 0x00, (word32) (word16) ((word32) s3_235 + 1), 640, a3_107, a4_108, mstatus, s8, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s0_125, out s1_521, out a0_120, out a1_522, out a2_523, out a3_122, out a4_123, out a5_124, out a7_524, out s2_131, out s3_132, out s4_133, out s5_525, out s6_526, out s8_527, out mstatus);
			a0_120->t0010 = s0_125;
			if (a0_120 == null)
			{
l230399D2:
				s1_231 = httpc_free_state(ra_137, s0_125, s0_125, a3_122, a4_123, s2_131, s3_132, s4_133, mstatus, s0, ra, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out a4_225, out s2_234, out s3_235, out s5_237, out s6_238);
				a5_101 = ~0x00;
				goto l230399DA;
			}
			struct Eq_183176 * a0_146 = *a5_124;
			if (a5_124 != null)
				goto l230399D2;
			*(union Eq_2 *) 0x2B = s0_125;
			struct Eq_456 * a0_150;
			struct Eq_1275 * s1_160;
			Eq_7997 s10_161;
			int32 s9_170;
			ra_137 = altcp_new(ra_137, a0_146->t0010, a0_146, a3_122, a4_123, s3_132, s4_133, s7_67, mstatus, s10, s6, dwLoc18, dwLoc08, dwArg08, dwArg14, dwArg18, dwArg28, dwArg38, dwArg3C, dwArg48, s5, s3, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgD8, out s1_160, out a0_150, out a3_122, out a4_123, out s2_131, out s3_132, out s4_133, out s9_170, out s10_161, out mstatus);
			a0_150->t0000 = (<anonymous>) s0_125;
			if (a0_150 == null)
				goto l230399D2;
			struct Eq_456 ** a5_179 = (word32) s1_160->b0006;
			if (a5_179 != null)
				s2_131 = (word32) s1_160->w0004;
			*((word32) s0_125 + 8) = (word16) s2_131;
			altcp_arg(a0_150, s0_125);
			altcp_recv(a0_150, &g_t23039538);
			altcp_err(a0_150, &g_t2303980E);
			word32 a5_528;
			altcp_sent(altcp_poll(a0_150, &g_t230397F4, 0x01, a5_179, out a5_528), &g_t23039476);
			Eq_2 a0_221;
			Eq_2 a3_224;
			Eq_2 s0_230;
			Eq_2 s4_236;
			Eq_2 s7_239;
			word32 s8_240;
			ra_137 = httpc_create_request_string.constprop.6(ra_137, s1_160, s9_170, *((word32) a4_123 + 4), s10_161, s3_132, dwLoc18, dwLoc0C, dwArg08, dwArg10, dwArg14, dwArg34, dwArg38, s9, s7, s3, dwArg78, dwArg9C, dwArgE8, out s0_230, out s1_231, out a0_221, out a3_224, out a4_225, out s2_234, out s3_235, out s4_236, out s5_237, out s6_238, out s7_239, out s8_240);
			if (s3_235 != a0_221)
			{
				s1_231 = httpc_free_state(ra_137, s0_230, s0_230, a3_224, a4_225, s2_234, s3_235, s4_236, mstatus, s0, ra, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out a4_225, out s2_234, out s3_235, out s5_237, out s6_238);
				goto l23039A74;
			}
			*((word32) s0_230 + 28) = s8_240;
			*((word32) s1_231 + 32) = s0_230;
			*((word32) s0_230 + 36) = s7_239;
			*s6_238 = (union Eq_2 *) s0_230;
			a5_101 = 0x00;
		}
l230399DA:
		0x00 = (uint16) dwArg0128;
		0x00 = dwArg1C;
		s1Out = s1_231;
		a0Out = a5_101;
		a4Out = a4_225;
		s2Out = s2_234;
		s3Out = s3_235;
		s4Out = dwArg78;
		s5Out = s5_237;
		s6Out = s6_238;
		s8Out = s5;
		mstatusOut = mstatus;
		return ra_137;
	}
}

