pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23039A8A: void httpc_get_file_dns(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register int32 a1, Register word32 a2, Register (ptr32 Eq_1275) a3, Register word32 a4, Register Eq_2 a6, Register Eq_2 s2, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s8, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      cmd_httpc_test
void httpc_get_file_dns(Eq_2 ra, Eq_2 s0, word32 a0, int32 a1, word32 a2, struct Eq_1275 * a3, word32 a4, Eq_2 a6, Eq_2 s2, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s8, Eq_2 s9, Eq_2 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	if (a0 == 0x00 || (a2 == 0x00 || a4 == 0x00))
	{
l23039AD8:
		0x00 = (uint16) dwArg0128;
		return;
	}
	word32 a0_41;
	Eq_2 s1_51;
	Eq_2 s5_57;
	Eq_2 s6_58;
	Eq_2 s8_60;
	ptr32 mstatus_139;
	Eq_2 a4_114;
	Eq_2 s4_112;
	Eq_2 s2_110;
	Eq_2 s3_122;
	Eq_2 ra_136 = httpc_init_connection_common.constprop.5(ra, ~0x0F, a3, a1, a6, s5, s6, s7, s8, s9, s10, mstatus, dwLoc2C, dwLoc28, s2, s0, dwLoc18, dwLoc14, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg18, dwArg38, dwArg3C, dwArg48, dwArg4C, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s1_51, out a0_41, out a4_114, out s2_110, out s3_122, out s4_112, out s5_57, out s6_58, out s8_60, out mstatus_139);
	if (a0_41 != 0x00)
		goto l23039AD8;
	Eq_2 a3_118;
	Eq_2 a0_115;
	Eq_2 s1_108;
	word32 a5_109;
	if ((word32) *((word32) s2_110 + 6) == 0x00)
	{
		word32 s0_343;
		word32 s1_344;
		ra_136 = dns_gethostbyname(ra_136, s1_51, (word32) s4_112 + 4, s4_112, (word32) s4_112 + 4, s5_57, s6_58, s8_60, mstatus_139, dwLoc28, dwLoc14, dwArg08, dwArg18, dwArg38, dwArg48, dwArg58, dwArg78, dwArg88, dwArgB8, dwArgF8, dwArg0138, out s0_343, out s1_344, out a0_115, out a3_118, out a4_114, out s2_110, out s3_122, out s4_112, out mstatus_139);
		s1_108 = a0_115;
		if (a0_115 != 0x00)
		{
			a5_109 = ~0x04;
			if (a0_115 != ~0x04)
			{
l23039AD0:
				word32 a4_345;
				word32 s2_346;
				word32 s3_347;
				word32 s5_348;
				word32 s6_349;
				httpc_free_state(ra_136, s1_108, a0_115, a3_118, a4_114, s2_110, s3_122, s4_112, mstatus_139, s0, ra, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out a4_345, out s2_346, out s3_347, out s5_348, out s6_349);
				goto l23039AD8;
			}
l23039B0A:
			if (s3_122 != 0x00)
				*s3_122 = a5_109;
			goto l23039AD8;
		}
	}
	a0_115 = httpc_get_internal_addr(s4_112, s2_110, a4_114, out a3_118, out a5_109);
	s1_108 = a0_115;
	if (a0_115 != 0x00)
		goto l23039AD0;
	goto l23039B0A;
}

// 23039B16: void proc_entry_looprt(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg5C, Stack word32 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138)
void proc_entry_looprt(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s5, Eq_2 s6, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg28, Eq_2 dwArg4C, Eq_2 dwArg5C, word32 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0138)
{
proc_entry_looprt_entry:
	bloop_run(ra, s1, 0x42014448, a1, a2, a3, a4, s5, s6, mstatus, dwArg00, dwArg04, dwArg10, dwArg14, dwArg28, dwArg4C, dwArg5C, dwArgC8, dwArgF8, dwArg0138)
l23039B16:
l23039B2C:
	Eq_2 a2_22
	Eq_2 a5_23
	Eq_2 a4_26
	word32 a0_65
	word32 a1_66
	word32 s4_67
	word32 s8_68
	puts((word32) s0_43 - 596, out a0_65, out a1_66, out a2_22, out a4_26, out a5_23, out s4_67, out s8_68)
	Eq_2 a3_39
	word32 s1_69
	word32 a0_70
	word32 a1_71
	word32 a2_72
	word32 a4_73
	word32 a5_74
	word32 s2_75
	word32 s3_76
	word32 s4_77
	word32 s8_78
	Eq_2 s0_43 = vTaskDelay(1000, a2_22, a3_39, a4_26, a5_23, mstatus, sp->t0024, sp->t0028, sp->t0138, sp->t0178, out s1_69, out a0_70, out a1_71, out a2_72, out a3_39, out a4_73, out a5_74, out s2_75, out s3_76, out s4_77, out s8_78)
	Eq_2 a2_22
	goto l23039B2C
proc_entry_looprt_exit:
}

// 23039B3E: Register Eq_2 looprt_evt_notify_async(Register Eq_2 ra, Register up32 a0, Register ui32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      cmd_looprt_test_evt
//      cmd_looprt_test_evt_dump
//      loopset_led_trigger
Eq_2 looprt_evt_notify_async(Eq_2 ra, up32 a0, ui32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	ptr32 mstatus_20;
	ptr32 s1_23;
	Eq_2 ra_21 = bloop_evt_set_async(ra, 0x42014448, a0, a1, a3, a4, mstatus, dwArg08, dwArg14, dwArg38, dwArg50, dwArg54, dwArg58, dwArg78, dwArg9C, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s1_23, out mstatus_20);
	s0Out = s0_22;
	s1Out = s1_23;
	a4Out = a4_18;
	a5Out = a5_19;
	s2Out = s2_24;
	s3Out = s3_25;
	mstatusOut = mstatus_20;
	return ra_21;
}

