pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23039B4E: void looprt_evt_status_dump()
// Called from:
//      looprt_start
//      cmd_looprt_test
//      cmd_looprt_test_status
void looprt_evt_status_dump()
{
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg32 = <invalid>;
	Eq_2 stackArg36 = <invalid>;
	Eq_2 stackArg108 = <invalid>;
	Eq_2 stackArg268 = <invalid>;
	word32 s0_12;
	word32 s1_13;
	word32 a3_14;
	word32 s5_15;
	bloop_status_dump(ra, a3, s5, stackArg32, stackArg36, stackArg108, stackArg268, out s0_12, out s1_13, out a3_14, out s5_15);
}

// 23039B5A: void looprt_evt_schedule(Register Eq_2 ra, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
// Called from:
//      cmd_looprt_test_schedule_evt1
//      cmd_looprt_test_schedule_evt2
void looprt_evt_schedule(Eq_2 ra, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg94, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	Eq_2 a0_25;
	struct Eq_183664 * s2_34;
	word32 a1_127;
	word32 s1_126;
	word32 a2_128;
	word32 a3_129;
	word32 a4_130;
	word32 a5_131;
	word32 a6_132;
	word32 s3_133;
	word32 s4_134;
	word32 s8_135;
	pvPortMalloc(ra, a2, 36, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_126, out a0_25, out a1_127, out a2_128, out a3_129, out a4_130, out a5_131, out a6_132, out s2_34, out s3_133, out s4_134, out s8_135);
	if (a0_25 == 0x00)
		return;
	Eq_2 s0_69 = bloop_timer_configure(a0_25, bloop_timer_init(ra, a0_25, 0x01), 0x00, s2_34, dwArg94);
	word32 a3_136;
	word32 a4_137;
	word32 a5_138;
	bloop_timer_register(0x42014448, s0_69, out a3_136, out a4_137, out a5_138);
}

// 23039BB6: Register Eq_2 looprt_start(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register Eq_2 a6, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0194, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      aos_loop_proc
Eq_2 looprt_start(Eq_2 ra, Eq_2 s1, Eq_2 a2, Eq_2 a6, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0194, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_2 s1_26;
	word32 s3_127;
	Eq_2 ra_25 = bloop_init(ra, 0x42014448, dwLoc08, dwArg18, dwArg40, dwArg44, s1, dwArg8C, out s1_26, out s3_127);
	Eq_2 a5_47 = bloop_handler_register(0x42014448, 0x4200D48C, 0x1F);
	looprt_evt_status_dump();
	Eq_2 a2_62;
	Eq_2 a5_63;
	ptr32 s0_65;
	Eq_2 a3_71;
	Eq_2 a4_72;
	word32 tp_128;
	word32 t0_129;
	word32 a0_130;
	word32 s2_131;
	Eq_2 ra_74 = xTaskCreateStatic(ra_25, &g_ptr23039B16, 587750816, s1_26, 0x00, 0x1A, a5_47, a6, mstatus, a2, dwArg04, dwArgC8, dwArg0194, out tp_128, out t0_129, out s0_65, out a0_130, out a2_62, out a3_71, out a4_72, out a5_63, out s2_131);
	ptr32 a3_87;
	ptr32 s2_92;
	ptr32 s3_93;
	ptr32 s1_91 = bloop_wait_startup(a2_62, a3_71, a4_72, a5_63, mstatus, dwLoc0C, dwLoc08, dwArg0108, dwArg0148, out a3_87, out s2_92, out s3_93);
	s0Out = s0_65;
	s1Out = s1_91;
	a3Out = a3_87;
	s2Out = s2_92;
	s3Out = s3_93;
	return ra_74;
}

// 23039C18: void looprt_start_auto(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
// Called from:
//      cmd_looprt_test
void looprt_start_auto(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	Eq_2 s1_18;
	Eq_2 s3_22;
	Eq_2 ra_17 = bloop_init(ra, 0x42014448, dwArg08, dwArg28, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_18, out s3_22);
	bloop_handler_register(0x42014448, 0x4200D48C, 0x1F);
	looprt_evt_status_dump();
	Eq_2 a2_53;
	Eq_2 a3_54;
	Eq_2 a4_55;
	Eq_2 a5_56;
	xTaskCreate(ra_17, s1_18, 0x01000000, 0x00, 0x1A, 0x00, s3_22, mstatus, dwArg00, dwArg04, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158, out a2_53, out a3_54, out a4_55, out a5_56);
	word32 a3_107;
	word32 s2_108;
	word32 s3_109;
	bloop_wait_startup(a2_53, a3_54, a4_55, a5_56, mstatus, dwArg04, dwArg08, dwArg0118, dwArg0158, out a3_107, out s2_108, out s3_109);
}

// 23039C6E: Register Eq_2 looprt_handler_register(Register int32 a0, Register uint32 a1, Register out Eq_2 a5Out)
// Called from:
//      loopset_led_hook_on_looprt
Eq_2 looprt_handler_register(int32 a0, uint32 a1, union Eq_2 & a5Out)
{
	if (g_dw42014448 == 0x00)
	{
		a5Out.u0 = 0x42014000;
		return <invalid>;
	}
	else
	{
		a5Out = bloop_handler_register(0x42014448, a0, a1);
		return <invalid>;
	}
}

// 23039C88: Register word32 looprt_timer_register(Register Eq_2 a0, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      _led_bloop_evt
word32 looprt_timer_register(Eq_2 a0, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 a3_11;
	ptr32 a4_12;
	ptr32 a5_13;
	bloop_timer_register(0x42014448, a0, out a3_11, out a4_12, out a5_13);
	a4Out = a4_12;
	a5Out = a5_13;
	return a3_11;
}

// 23039CA2: void cmd_looprt_test(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void cmd_looprt_test(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	word32 a0_118;
	word32 a1_119;
	word32 a2_120;
	word32 a4_121;
	word32 a5_122;
	word32 s4_123;
	word32 s8_124;
	puts(0x23085DD0, out a0_118, out a1_119, out a2_120, out a4_121, out a5_122, out s4_123, out s8_124);
	Eq_2 a3_27;
	word32 s1_125;
	word32 a0_126;
	word32 a1_127;
	word32 a2_128;
	word32 a4_129;
	word32 a5_130;
	word32 a7_131;
	word32 s2_132;
	word32 s3_133;
	word32 s4_134;
	word32 s5_135;
	word32 s6_136;
	word32 s7_137;
	word32 s8_138;
	word32 s9_139;
	word32 s10_140;
	word32 s11_141;
	word32 t4_142;
	word32 s1_143;
	word32 a0_144;
	word32 a1_145;
	word32 a2_146;
	word32 a3_147;
	word32 a4_148;
	word32 a5_149;
	word32 a7_150;
	word32 s2_151;
	word32 s3_152;
	word32 s4_153;
	word32 s5_154;
	word32 s6_155;
	word32 s7_156;
	word32 s8_157;
	word32 s9_158;
	word32 s10_159;
	word32 s11_160;
	word32 t4_161;
	Eq_2 ra_55 = printf(printf(ra, &g_t23085DEC, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_125, out a0_126, out a1_127, out a2_128, out a3_27, out a4_129, out a5_130, out a7_131, out s2_132, out s3_133, out s4_134, out s5_135, out s6_136, out s7_137, out s8_138, out s9_139, out s10_140, out s11_141, out t4_142), &g_t23085E0C, a3_27, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_143, out a0_144, out a1_145, out a2_146, out a3_147, out a4_148, out a5_149, out a7_150, out s2_151, out s3_152, out s4_153, out s5_154, out s6_155, out s7_156, out s8_157, out s9_158, out s10_159, out s11_160, out t4_161);
	looprt_start_auto(ra_55, mstatus, dwArg00, dwArg04, dwArg08, dwArg28, dwArg50, dwArg54, dwArg78, dwArg9C, dwArgE8, dwArgF8, dwArg0118, dwArg0138, dwArg0158);
}

