pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23039CD8: void cmd_looprt_test_status()
void cmd_looprt_test_status()
{
	word32 a0_23;
	word32 a1_24;
	word32 a2_25;
	word32 a4_26;
	word32 a5_27;
	word32 s4_28;
	word32 s8_29;
	puts(587751088, out a0_23, out a1_24, out a2_25, out a4_26, out a5_27, out s4_28, out s8_29);
	looprt_evt_status_dump();
}

// 23039CF0: void cmd_looprt_test_evt(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128)
void cmd_looprt_test_evt(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128)
{
	Eq_2 a4_13;
	word32 a0_54;
	word32 a1_55;
	word32 a2_56;
	word32 a5_57;
	word32 s4_58;
	word32 s8_59;
	puts(0x23085E20, out a0_54, out a1_55, out a2_56, out a4_13, out a5_57, out s4_58, out s8_59);
	word32 s0_60;
	word32 s1_61;
	word32 a4_62;
	word32 a5_63;
	word32 s2_64;
	word32 s3_65;
	word32 mstatus_66;
	looprt_evt_notify_async(ra, 0x1F, 0x00, a3, a4_13, mstatus, dwArg08, dwArg14, dwArg38, dwArg50, dwArg54, dwArg58, dwArg78, dwArg9C, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_60, out s1_61, out a4_62, out a5_63, out s2_64, out s3_65, out mstatus_66);
}

// 23039D0C: void cmd_looprt_test_evt_dump(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128)
void cmd_looprt_test_evt_dump(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128)
{
	Eq_2 a4_13;
	word32 a0_54;
	word32 a1_55;
	word32 a2_56;
	word32 a5_57;
	word32 s4_58;
	word32 s8_59;
	puts(587750972, out a0_54, out a1_55, out a2_56, out a4_13, out a5_57, out s4_58, out s8_59);
	word32 s0_60;
	word32 s1_61;
	word32 a4_62;
	word32 a5_63;
	word32 s2_64;
	word32 s3_65;
	word32 mstatus_66;
	looprt_evt_notify_async(ra, 0x1F, 0x01, a3, a4_13, mstatus, dwArg08, dwArg14, dwArg38, dwArg50, dwArg54, dwArg58, dwArg78, dwArg9C, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_60, out s1_61, out a4_62, out a5_63, out s2_64, out s3_65, out mstatus_66);
}

// 23039D28: void cmd_looprt_test_schedule_evt1(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void cmd_looprt_test_schedule_evt1(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg94, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	Eq_2 a5_10;
	Eq_2 a4_13;
	word32 a0_52;
	word32 a1_53;
	word32 a2_54;
	word32 s4_55;
	word32 s8_56;
	puts(587751008, out a0_52, out a1_53, out a2_54, out a4_13, out a5_10, out s4_55, out s8_56);
	looprt_evt_schedule(ra, 0x04FFFE20, a3, a4_13, a5_10, mstatus, dwArg20, dwArg24, dwArg94, dwArg0118, dwArg0158);
}

// 23039D4A: void cmd_looprt_test_schedule_evt2(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void cmd_looprt_test_schedule_evt2(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg94, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	Eq_2 a5_10;
	Eq_2 a4_13;
	word32 a0_52;
	word32 a1_53;
	word32 a2_54;
	word32 s4_55;
	word32 s8_56;
	puts(0x23085E88, out a0_52, out a1_53, out a2_54, out a4_13, out a5_10, out s4_55, out s8_56);
	looprt_evt_schedule(ra, 0x02000710, a3, a4_13, a5_10, mstatus, dwArg20, dwArg24, dwArg94, dwArg0118, dwArg0158);
}

// 23039D6C: void looprt_test_cli_init()
// Called from:
//      aos_loop_proc
void looprt_test_cli_init()
{
}

// 23039D70: void _cb_led_trigger(Register Eq_2 ra, Register (ptr32 Eq_184185) a1, Register (ptr32 word32) a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void _cb_led_trigger(Eq_2 ra, struct Eq_184185 * a1, word32 * a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	bl_gpio_output_set((word32) a1->ptr0038->b0030, (word32) (a1 != null), a3);
	struct Eq_184204 * a5_21 = (struct Eq_184204 *) 0x01;
	if ((word32) g_b4201FD4C <= 0x01)
	{
		up32 a4_23 = (word32) g_b4201FD4D;
		if (a4_23 <= 0x01)
		{
			if (g_t4200DE84 != 0x00)
			{
				word32 a5_151;
				xTaskGetTickCountFromISR(out a5_151);
			}
			else
			{
				word32 a5_150;
				xTaskGetTickCount(out a5_150);
			}
			word32 s1_152;
			word32 a0_153;
			word32 a1_154;
			word32 a2_155;
			word32 a3_156;
			word32 a4_157;
			word32 s2_158;
			word32 s3_159;
			word32 s4_160;
			word32 s5_161;
			word32 s6_162;
			word32 s7_163;
			word32 s8_164;
			word32 s9_165;
			word32 s10_166;
			word32 s11_167;
			bl_printk(ra, &g_t23085FB4, 587751332, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_152, out a0_153, out a1_154, out a2_155, out a3_156, out a4_157, out a5_21, out s2_158, out s3_159, out s4_160, out s5_161, out s6_162, out s7_163, out s8_164, out s9_165, out s10_166, out s11_167);
		}
	}
	((word32[]) 56)[(word32) (a5_21 < (struct Eq_184204 *) 1) / 4] = a5_21->dw0038;
}

// 23039DFE: void _led_bloop_msg(Register Eq_2 ra, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C)
void _led_bloop_msg(Eq_2 ra, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C)
{
	if ((word32) g_b4201FD4C > 0x01 || (word32) g_b4201FD4D > 0x01)
		return;
	if (g_t4200DE84 != 0x00)
	{
		word32 a5_158;
		xTaskGetTickCountFromISR(out a5_158);
	}
	else
	{
		word32 a5_157;
		xTaskGetTickCount(out a5_157);
	}
	word32 s11_175;
	word32 s10_174;
	word32 s9_173;
	word32 s8_172;
	word32 s7_171;
	word32 s6_170;
	word32 s5_169;
	word32 s4_168;
	word32 s3_167;
	word32 s2_166;
	word32 a5_165;
	word32 a4_164;
	word32 a3_163;
	word32 a2_162;
	word32 a1_161;
	word32 a0_160;
	word32 s1_159;
	bl_printk(ra, &g_t23086070, 587751332, dwLoc18, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_159, out a0_160, out a1_161, out a2_162, out a3_163, out a4_164, out a5_165, out s2_166, out s3_167, out s4_168, out s5_169, out s6_170, out s7_171, out s8_172, out s9_173, out s10_174, out s11_175);
}

// 23039E7E: void _led_bloop_evt(Register Eq_2 ra, Register (ptr32 Eq_2) s1, Register (ptr32 Eq_184347) a1, Register Eq_2 s6, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArg0128)
void _led_bloop_evt(Eq_2 ra, union Eq_2 * s1, struct Eq_184347 * a1, Eq_2 s6, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArg0128)
{
	Eq_2 a3_162 = *s1;
	struct Eq_184347 * s9_153 = a1;
	Eq_2 s8_152 = a3_162;
	do
	{
		if ((s1 & 1) != 0x00)
			s1 &= ~0x01;
		else
		{
			if ((s1 & 2) == 0x00)
			{
				if (s1 == null)
					break;
				word32 s5_525;
				word32 a7_521;
				word32 a0_515;
				word32 s1_514;
				word32 s8_528;
				word32 s9_529;
				word32 s10_530;
				word32 s11_531;
				word32 t4_532;
				word32 a2_517;
				word32 a1_516;
				word32 a4_519;
				word32 a3_518;
				word32 a5_520;
				word32 s4_524;
				word32 s3_523;
				word32 s2_522;
				word32 s6_526;
				word32 s7_527;
				printf(ra, &g_t23086048, a3_162, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_514, out a0_515, out a1_516, out a2_517, out a3_518, out a4_519, out a5_520, out a7_521, out s2_522, out s3_523, out s4_524, out s5_525, out s6_526, out s7_527, out s8_528, out s9_529, out s10_530, out s11_531, out t4_532);
				while (true)
					;
			}
			struct Eq_184377 * s2_146 = s9_153->ptr000C;
			struct Eq_184381 * s3_147 = null;
			struct Eq_184381 * s0_105 = s2_146->ptr000C;
			if (s0_105 != null)
				s3_147 = s0_105->ptr0004;
			while (s0_105 != (char *) (&s2_146->ptr0004) + 4)
			{
				if ((word32) g_b4201FD4C <= 0x02)
				{
					struct Eq_184482 * a4_85 = (word32) g_b4201FD4D;
					if (a4_85 <= (struct Eq_184482 *) 0x02)
					{
						if (g_t4200DE84 != 0x00)
						{
							word32 a5_534;
							xTaskGetTickCountFromISR(out a5_534);
						}
						else
						{
							word32 a5_533;
							xTaskGetTickCount(out a5_533);
						}
						s0_105 = a4_85->ptr002C;
						word32 s10_545;
						word32 s11_546;
						word32 a0_535;
						word32 a1_536;
						word32 a2_537;
						word32 a3_538;
						word32 s7_544;
						word32 a4_539;
						word32 a5_540;
						word32 s4_541;
						word32 s5_542;
						word32 s6_543;
						ra = bl_printk(ra, &g_t23085FFC, 587751332, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1, out a0_535, out a1_536, out a2_537, out a3_538, out a4_539, out a5_540, out s2_146, out s3_147, out s4_541, out s5_542, out s6_543, out s7_544, out s8_152, out s9_153, out s10_545, out s11_546);
					}
				}
				struct Eq_184377 * a4_163;
				struct Eq_184377 * a5_164;
				a3_162 = looprt_timer_register((char *) &s0_105->ptr0004 + 4, out a4_163, out a5_164);
				struct Eq_184377 * s0_169 = a4_163->ptr0000;
				a5_164->ptr0004 = a4_163;
				a4_163->ptr0000 = a5_164;
				struct Eq_184377 * a5_173 = s2_146->ptr0004;
				s0_169->ptr0000 = s2_146;
				a5_173->ptr0004 = s0_169;
				s2_146->ptr0004 = s0_169;
				s0_169->ptr0000 = a5_173;
				struct Eq_184381 * a5_178 = null;
				if (s3_147 != null)
					a5_178 = s3_147->ptr0004;
				s0_105 = s3_147;
				s3_147 = a5_178;
			}
			s1 &= ~0x02;
		}
	} while (s1 != null);
	*s8_152 = 0x00;
	0x00 = dwArg0128;
}

// 23039FB6: Register word32 loopset_led_hook_on_looprt(Register out ptr32 a5Out)
// Called from:
//      aos_loop_proc
word32 loopset_led_hook_on_looprt(ptr32 & a5Out)
{
	g_dw420148EC = 0x420148E8;
	g_dw420148E8 = 0x420148E8;
	g_dw420148FC = 0x420148E8;
	g_dw420148F8 = 0x420148E8;
	ptr32 a5_16;
	word32 a4_15 = looprt_handler_register(0x23086060, 0x01, out a5_16);
	a5Out = a5_16;
	return a4_15;
}

// 23039FD8: Register Eq_2 loopset_led_trigger(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg94, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Register out (ptr32 Eq_172433) s0Out, Register out Eq_172434 s1Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_172437) s2Out, Register out ptr32 s3Out, Register out ptr32 mstatusOut)
// Called from:
//      hal_gpio_init_from_dts
Eq_2 loopset_led_trigger(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg94, Eq_2 dwArg9C, Eq_2 dwArgE4, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, struct Eq_172433 & s0Out, union Eq_172434 & s1Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_172437 & s2Out, ptr32 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a0_23;
	Eq_2 s2_32;
	Eq_2 s3_33;
	word32 s1_209;
	word32 a1_210;
	word32 a2_211;
	word32 a3_212;
	word32 a4_213;
	word32 a5_214;
	word32 a6_215;
	word32 s4_216;
	word32 s8_217;
	pvPortMalloc(ra, s1, 60, a3, a4, a5, mstatus, dwArg20, dwArg24, ra, dwArg0118, dwArg0158, out s1_209, out a0_23, out a1_210, out a2_211, out a3_212, out a4_213, out a5_214, out a6_215, out s2_32, out s3_33, out s4_216, out s8_217);
	if (a0_23 != 0x00)
	{
		word32 t1_218;
		word32 a0_219;
		word32 a1_220;
		word32 a2_221;
		word32 a3_222;
		word32 a4_223;
		word32 a5_224;
		Eq_2 ra_47 = memset(ra, a0_23, 0x00, 60, out t1_218, out a0_219, out a1_220, out a2_221, out a3_222, out a4_223, out a5_224);
		*((word32) a0_23 + 48) = s2_32;
		Eq_2 s1_61 = bloop_timer_init(ra_47, (word32) a0_23 + 8, 0x00);
		bloop_timer_repeat_enable(s1_61);
		Eq_2 s0_78 = bloop_timer_configure(s1_61, s3_33, a0_23, (struct Eq_183664 *) 0x01, dwArg94);
		Eq_2 ra_89 = bl_gpio_enable_output(0x00, 0x00);
		word32 a5_225;
		Eq_2 a4_92 = vTaskEnterCritical(0x01, mstatus, out a5_225);
		struct Eq_184643 * a5_94 = *((word32) a4_92 + 0x0C);
		a5_94->t0008 = s0_78;
		*((word32) a4_92 + 4) = s0_78;
		*((word32) s0_78 + 0x0C) = a5_94;
		*s0_78 = a4_92;
		Eq_2 a4_102;
		word32 a5_226;
		Eq_2 a3_101 = vTaskExitCritical(&a5_94->t0008, mstatus, out a4_102, out a5_226);
		ptr32 a4_115;
		ptr32 a5_116;
		ptr32 mstatus_117;
		struct Eq_172433 * s0_119;
		Eq_172434 s1_120;
		struct Eq_172437 * s2_121;
		ptr32 s3_122;
		Eq_2 ra_118 = looprt_evt_notify_async(ra_89, 0x01, 0x02, a3_101, a4_102, mstatus, dwArg08, dwArg14, dwArg38, dwArg50, dwArg54, dwArg58, dwArg78, dwArg9C, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_119, out s1_120, out a4_115, out a5_116, out s2_121, out s3_122, out mstatus_117);
		s0Out = s0_119;
		s1Out = s1_120;
		a4Out = a4_115;
		a5Out = a5_116;
		s2Out = s2_121;
		s3Out = s3_122;
		mstatusOut = mstatus_117;
		return ra_118;
	}
	else
	{
		if (g_t4200DE84 != 0x00)
		{
			word32 a5_228;
			xTaskGetTickCountFromISR(out a5_228);
		}
		else
		{
			word32 a5_227;
			xTaskGetTickCount(out a5_227);
		}
		word32 s1_229;
		word32 a0_230;
		word32 a1_231;
		word32 a2_232;
		word32 a3_233;
		word32 a4_234;
		word32 a5_235;
		word32 s2_236;
		word32 s3_237;
		word32 s4_238;
		word32 s5_239;
		word32 s6_240;
		word32 s7_241;
		word32 s8_242;
		word32 s9_243;
		word32 s10_244;
		word32 s11_245;
		bl_printk(ra, &g_t2307C074, 587751332, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_229, out a0_230, out a1_231, out a2_232, out a3_233, out a4_234, out a5_235, out s2_236, out s3_237, out s4_238, out s5_239, out s6_240, out s7_241, out s8_242, out s9_243, out s10_244, out s11_245);
		while (true)
			;
	}
}

// 2303A0A8: Register word32 sys_mbox_new(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out (ptr32 Eq_184746) a0Out, Register out Eq_2 a2Out, Register out Eq_184748 a3Out, Register out ptr32 a4Out, Register out Eq_184750 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      tcpip_init
//      netconn_alloc
//      lwip_netconn_do_listen
word32 sys_mbox_new(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg0108, Eq_2 dwArg0148, struct Eq_184746 & a0Out, union Eq_2 & a2Out, union Eq_184748 & a3Out, ptr32 & a4Out, union Eq_184750 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	struct Eq_151392 ** a0_17;
	word32 s1_25;
	ptr32 s2_26;
	ptr32 s3_27;
	ptr32 s4_28;
	word32 a3_81;
	word32 a4_82;
	word32 a2_80;
	word32 a1_79;
	word32 a5_83;
	*a0_17 = (struct Eq_151392 **) xQueueGenericCreate(ra, 50, 0x04, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s1_25, out a0_17, out a1_79, out a2_80, out a3_81, out a4_82, out a5_83, out s2_26, out s3_27, out s4_28);
	uint32 a5_38 = (word32) g_w4201FE98 + 0x01 << 16;
	Eq_184748 a3_36 = (word32) g_w4201FE9A;
	g_w4201FE98 = (word16) (a5_38 >> 16);
	if (a3_36 < a5_38 >> 16)
		g_w4201FE9A = (word16) (a5_38 >> 16);
	a0Out = 0x00 - (word32) (a0_17 < (struct Eq_151392 **) 1);
	a2Out = dwArg10;
	a3Out = a3_36;
	a4Out = 1107426712;
	a5Out = a5_38 >> 16;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = s4_28;
	return s1_25;
}

// 2303A0F2: Register word32 sys_mbox_free(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_184821 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      netconn_new_with_proto_and_callback
//      netconn_alloc
//      netconn_drain
//      accept_function
//      lwip_netconn_do_listen
word32 sys_mbox_free(Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_184821 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	Eq_2 a3_20;
	Eq_2 a4_21;
	Eq_2 a0_18 = uxQueueMessagesWaiting(*a0, a3, a4, mstatus, out a3_20, out a4_21);
	if (a0_18 != 0x00)
		g_w4201FE9C = (word16) ((word32) g_w4201FE9C + 0x01);
	ptr32 a0_33;
	ptr32 a3_36;
	Eq_184821 a4_37;
	word32 s1_41;
	ptr32 s4_42;
	word32 a1_70;
	word32 a2_71;
	word32 a5_72;
	struct Eq_184845 * s0_40 = vQueueDelete(a0_18, a3_20, a4_21, mstatus, dwArg0148, dwArg0188, out s1_41, out a0_33, out a1_70, out a2_71, out a3_36, out a4_37, out a5_72, out s4_42);
	word32 a5_45 = (word32) s0_40->w0100;
	s0_40->w0100 = (word16) (a5_45 + ~0x00);
	a0Out = a0_33;
	a2Out = dwArg10;
	a3Out = a3_36;
	a4Out = a4_37;
	a5Out = a5_45 + ~0x00;
	s4Out = s4_42;
	return s1_41;
}

