pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303A132: Register Eq_2 sys_mbox_post(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out (ptr32 Eq_184888) s1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      tcpip_send_msg_wait_sem
//      tcpip_api_call
//      cmd_sntp_start
Eq_2 sys_mbox_post(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, struct Eq_184888 & s1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out)
{
	do
	{
		ptr32 a3_28;
		Eq_2 s0_33;
		struct Eq_184888 * s1_34;
		ptr32 s2_35;
		ptr32 s3_36;
		ptr32 s5_38;
		ptr32 s6_39;
		word32 a1_82;
		word32 a2_83;
		word32 a7_84;
		word32 s4_85;
		word32 s8_86;
		xQueueGenericSend(a0, fp + ~0x13, 0x00, a4, a5, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_33, out s1_34, out a0, out a1_82, out a2_83, out a3_28, out a4, out a5, out a7_84, out s2_35, out s3_36, out s4_85, out s5_38, out s6_39, out s8_86);
	} while (a0 != s0_33);
	s1Out = s1_34;
	a3Out = a3_28;
	a4Out = a4;
	s2Out = s2_35;
	s3Out = s3_36;
	s5Out = s5_38;
	s6Out = s6_39;
	return s0_33;
}

// 2303A15A: Register word32 sys_mbox_trypost(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 Eq_184942) a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_184945) a5Out, Register out ptr32 a7Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      tcpip_input
//      tcpip_try_callback
//      recv_udp
//      err_tcp
//      recv_raw
//      recv_tcp
//      accept_function
word32 sys_mbox_trypost(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178, ptr32 & s1Out, ptr32 & a0Out, struct Eq_184942 & a1Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_184945 & a5Out, ptr32 & a7Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_40;
	word32 a0_16;
	struct Eq_184942 * a1_17;
	ptr32 a3_19;
	ptr32 a7_23;
	word32 s0_24;
	ptr32 s1_25;
	ptr32 s2_26;
	ptr32 s3_27;
	ptr32 s4_28;
	ptr32 s5_29;
	ptr32 s6_30;
	word32 s8_97;
	word32 a5_96;
	word32 a2_95;
	ptr32 a4_20;
	xQueueGenericSend(*a0, fp + ~0x13, 0x00, a4, a5, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s0_24, out s1_25, out a0_16, out a1_17, out a2_95, out a3_19, out a4_20, out a5_96, out a7_23, out s2_26, out s3_27, out s4_28, out s5_29, out s6_30, out s8_97);
	struct Eq_184945 * a5_39 = (struct Eq_184945 *) 0x01;
	if (a0_16 != 0x01)
	{
		word32 a4_43 = (word32) g_w4201FE9C;
		g_w4201FE9C = (word16) (a4_43 + 0x01);
		a5_39 = (struct Eq_184945 *) &g_t4201FD98;
		a0_40 = ~0x00;
		a4_20 = a4_43 + 0x01;
	}
	else
		a0_40 = 0x00;
	s1Out = s1_25;
	a0Out = a0_40;
	a1Out = a1_17;
	a3Out = a3_19;
	a4Out = a4_20;
	a5Out = a5_39;
	a7Out = a7_23;
	s2Out = s2_26;
	s3Out = s3_27;
	s4Out = s4_28;
	s5Out = s5_29;
	s6Out = s6_30;
	return s0_24;
}

// 2303A190: Register word32 sys_arch_mbox_fetch(Register (ptr32 Eq_2) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg64, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out (ptr32 (ptr32 Eq_186830)) a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 code) a5Out, Register out (ptr32 Eq_2) s2Out, Register out (ptr32 (ptr32 Eq_186830)) s3Out, Register out ptr32 s4Out)
// Called from:
//      tcpip_thread
//      netconn_accept
//      netconn_recv_data
word32 sys_arch_mbox_fetch(union Eq_2 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg64, Eq_2 dwArgD8, Eq_2 dwArg0118, union Eq_2 & s1Out, ptr32 & a0Out, struct Eq_186830 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, <anonymous> & a5Out, union Eq_2 & s2Out, struct Eq_186830 & s3Out, ptr32 & s4Out)
{
	Eq_2 a5_21;
	xTaskGetTickCount(out a5_21);
	union Eq_2 * s2_166 = a0;
	Eq_2 s1_164 = a1;
	if (a1 == 0x00)
		s1_164 = fp + -36;
	word32 s0_163;
	<anonymous> * a5_160;
	struct Eq_186830 ** s3_168;
	struct Eq_186830 ** a1_154;
	ptr32 a0_153;
	if (a2 != 0x00)
	{
		word32 a0_72;
		word32 a2_193;
		word32 a5_194;
		word32 s4_195;
		s0_163 = xQueueReceive(*a0, s1_164, a2, a3, a4, a5_21, mstatus, dwLoc38, dwLoc1C, dwArg64, dwArgD8, dwArg0118, out s1_164, out a0_72, out a1_154, out a2_193, out a3, out a4, out a5_194, out s2_166, out s3_168, out s4_195);
		a5_160 = (<anonymous> *) 0x01;
		if (a0_72 != 0x01)
		{
			*s1_164 = 0x00;
			a0_153 = ~0x00;
			goto l2303A1D0;
		}
	}
	else
	{
		do
		{
			struct Eq_186830 ** a0_38;
			word32 a2_191;
			word32 s4_192;
			s0_163 = xQueueReceive(*s2_166, s1_164, ~0x00, a3, a4, a5_21, mstatus, dwLoc38, dwLoc1C, dwArg64, dwArgD8, dwArg0118, out s1_164, out a0_38, out a1_154, out a2_191, out a3, out a4, out a5_21, out s2_166, out s3_168, out s4_192);
		} while (a0_38 != s3_168);
	}
	a0_153 = xTaskGetTickCount(out a5_160) - s0_163;
l2303A1D0:
	s1Out = s1_164;
	a0Out = a0_153;
	a1Out = a1_154;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_160;
	s2Out = s2_166;
	s3Out = s3_168;
	s4Out = dwArgF4;
	return s0_163;
}

// 2303A1F0: Register word32 sys_arch_mbox_tryfetch(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out (ptr32 (ptr32 Eq_186830)) a1Out, Register out ptr32 a3Out, Register out Eq_185116 a4Out, Register out ptr32 s2Out, Register out (ptr32 (ptr32 Eq_186830)) s3Out, Register out ptr32 s4Out)
// Called from:
//      netconn_accept
//      netconn_recv_data
//      netconn_drain
word32 sys_arch_mbox_tryfetch(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a0Out, struct Eq_186830 & a1Out, ptr32 & a3Out, union Eq_185116 & a4Out, ptr32 & s2Out, struct Eq_186830 & s3Out, ptr32 & s4Out)
{
	if (a1 == 0x00)
		a1 = fp + ~0x13;
	word32 a0_23;
	struct Eq_186830 ** a1_24;
	ptr32 a3_26;
	Eq_185116 a4_27;
	ptr32 s1_32;
	ptr32 s2_33;
	struct Eq_186830 ** s3_34;
	ptr32 s4_35;
	word32 a2_70;
	word32 a5_71;
	word32 s0_31 = xQueueReceive(*a0, a1, 0x00, a3, a4, a5, mstatus, dwLoc18, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_32, out a0_23, out a1_24, out a2_70, out a3_26, out a4_27, out a5_71, out s2_33, out s3_34, out s4_35);
	s1Out = s1_32;
	a0Out = 0x00 - (word32) (a0_23 != ~0x00);
	a1Out = a1_24;
	a3Out = a3_26;
	a4Out = a4_27;
	s2Out = s2_33;
	s3Out = s3_34;
	s4Out = s4_35;
	return s0_31;
}

// 2303A210: Register Eq_2 sys_mbox_valid(Register Eq_2 a0)
// Called from:
//      tcpip_input
//      tcpip_try_callback
//      tcpip_send_msg_wait_sem
//      tcpip_api_call
//      netconn_new_with_proto_and_callback
//      netconn_accept
//      netconn_recv_data
//      netconn_recv_tcp_pbuf_flags
//      recv_udp
//      err_tcp
//      recv_raw
//      recv_tcp
//      netconn_free
//      netconn_drain
//      accept_function
//      lwip_netconn_do_listen
//      cmd_sntp_start
Eq_2 sys_mbox_valid(Eq_2 a0)
{
	return (word32) (*a0 != 0x00);
}

