pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303A218: void sys_mbox_set_invalid(Register Eq_2 a0)
// Called from:
//      netconn_alloc
//      netconn_drain
//      accept_function
//      lwip_netconn_do_listen
void sys_mbox_set_invalid(Eq_2 a0)
{
	*a0 = 0x00;
}

// 2303A21E: Register word32 sys_sem_new(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg94, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a0Out, Register out (ptr32 Eq_185183) a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_185187 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      lwip_select
//      tcpip_api_call
//      netconn_gethostbyname
//      netconn_alloc
word32 sys_sem_new(Eq_2 ra, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg94, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a0Out, struct Eq_185183 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_185187 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 a0_21;
	Eq_2 a5_26;
	Eq_2 a2_23;
	Eq_2 a4_141;
	Eq_2 a3_139;
	struct Eq_185183 * a1_136;
	word32 s1_150;
	ptr32 s2_152;
	ptr32 s3_155;
	ptr32 s4_158;
	*a0_21 = xQueueGenericCreate(ra, 0x01, 0x00, a3, a4, a5, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148, out s1_150, out a0_21, out a1_136, out a2_23, out a3_139, out a4_141, out a5_26, out s2_152, out s3_155, out s4_158);
	if (a0_21 != 0x00)
	{
		word32 s6_207;
		word32 s8_208;
		word32 a7_205;
		word32 s5_206;
		word32 s0_204;
		xQueueGenericSend(a0_21, 0x00, 0x00, a4_141, a5_26, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s0_204, out s1_150, out a0_21, out a1_136, out a2_23, out a3_139, out a4_141, out a5_26, out a7_205, out s2_152, out s3_155, out s4_158, out s5_206, out s6_207, out s8_208);
	}
	ptr32 a0_102;
	Eq_185187 a5_103;
	Eq_2 s0_67 = 1107426712;
	if (a0_21 == 0x00)
	{
		word32 a5_101 = (word32) g_w4201FE90;
		g_w4201FE90 = (word16) (a5_101 + 0x01);
		a0_102 = ~0x00;
		a5_103 = a5_101 + 0x01;
	}
	else
	{
		if (s1_150 == 0x00)
		{
			word32 a0_209;
			word32 a2_210;
			word32 a4_211;
			word32 a5_212;
			s0_67 = xQueueSemaphoreTake(a0_21, 0x01, a2_23, a3_139, a4_141, a5_26, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, out s1_150, out a0_209, out a1_136, out a2_210, out a3_139, out a4_211, out a5_212, out s2_152, out s3_155, out s4_158);
		}
		uint32 a5_97 = (word32) *((word32) s0_67 + 244) + 0x01 << 16;
		a4_141 = (word32) *((word32) s0_67 + 0x00F6);
		*((word32) s0_67 + 244) = (word16) (a5_97 >> 16);
		a0_102 = 0x00;
		a5_103 = a5_97 >> 16;
		if (a4_141 < a5_97 >> 16)
			((word32) s0_67 + 0x00F6)->u0 = (word16) (a5_97 >> 16);
	}
	a0Out = a0_102;
	a1Out = a1_136;
	a2Out = dwArg10;
	a3Out = a3_139;
	a4Out = a4_141;
	a5Out = a5_103;
	s2Out = s2_152;
	s3Out = s3_155;
	s4Out = s4_158;
	return s1_150;
}

// 2303A28A: Register Eq_2 sys_arch_sem_wait(Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg44, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out)
// Called from:
//      sys_mutex_lock
//      lwip_select
//      lwip_setsockopt
//      tcpip_send_msg_wait_sem
//      tcpip_api_call
Eq_2 sys_arch_sem_wait(Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg44, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out)
{
	ptr32 s1_120;
	Eq_2 s0_119;
	Eq_2 s2_122;
	ptr32 s3_124;
	ptr32 a1_111;
	ptr32 a5_66;
	Eq_2 a5_17;
	Eq_2 a0_16 = xTaskGetTickCount(out a5_17);
	Eq_2 a2_18 = dwArg44;
	if (a1 != 0x00)
	{
		word32 a0_50;
		word32 a2_138;
		word32 a4_139;
		word32 a5_140;
		word32 s4_141;
		s0_119 = xQueueSemaphoreTake(a0_16, a1, dwArg44, a3, a4, a5_17, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_120, out a0_50, out a1_111, out a2_138, out a3, out a4_139, out a5_140, out s2_122, out s3_124, out s4_141);
		a4.u0 = 0x01;
		a5_66 = ~0x00;
		if (a0_50 != 0x01)
			goto l2303A2BA;
	}
	else
	{
		do
		{
			word32 s4_137;
			s0_119 = xQueueSemaphoreTake(a0_16, ~0x00, a2_18, a3, a4, a5_17, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, out s1_120, out a0_16, out a1_111, out a2_18, out a3, out a4, out a5_17, out s2_122, out s3_124, out s4_137);
		} while (a0_16 != s2_122);
	}
	word32 a5_142;
	a5_66 = xTaskGetTickCount(out a5_142) - s0_119;
l2303A2BA:
	s1Out = s1_120;
	a0Out = a5_66;
	a1Out = a1_111;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5_66;
	s2Out = s2_122;
	s3Out = s3_124;
	s4Out = dwArg04;
	return s0_119;
}

// 2303A2D6: Register (ptr32 Eq_184845) sys_sem_free(Register (ptr32 Eq_2) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_185394 a4Out, Register out Eq_185395 a5Out, Register out ptr32 s4Out)
// Called from:
//      lwip_select
//      tcpip_api_call
//      netconn_new_with_proto_and_callback
//      netconn_gethostbyname
//      netconn_free
struct Eq_184845 * sys_sem_free(union Eq_2 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg0158, Eq_2 dwArg0198, ptr32 & s1Out, ptr32 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_185394 & a4Out, union Eq_185395 & a5Out, ptr32 & s4Out)
{
	word32 a4_6 = (word32) g_w4201FE8C;
	g_w4201FE8C = (word16) (a4_6 + ~0x00);
	Eq_2 a0_10 = *a0;
	ptr32 a1_14;
	ptr32 a2_15;
	ptr32 a3_16;
	Eq_185394 a4_17;
	Eq_185395 a5_18;
	ptr32 s1_21;
	ptr32 s4_22;
	word32 a0_34;
	struct Eq_184845 * s0_20 = vQueueDelete(a0_10, a3, a4_6 + ~0x00, mstatus, dwArg0158, dwArg0198, out s1_21, out a0_34, out a1_14, out a2_15, out a3_16, out a4_17, out a5_18, out s4_22);
	s1Out = s1_21;
	a1Out = a1_14;
	a2Out = a2_15;
	a3Out = a3_16;
	a4Out = a4_17;
	a5Out = a5_18;
	s4Out = s4_22;
	return s0_20;
}

// 2303A2EE: Register Eq_2 sys_sem_valid(Register Eq_2 a0)
// Called from:
//      tcpip_send_msg_wait_sem
//      netconn_new_with_proto_and_callback
//      err_tcp
//      lwip_netconn_do_delconn
Eq_2 sys_sem_valid(Eq_2 a0)
{
	return (word32) (*a0 != 0x00);
}

// 2303A2F6: void sys_sem_set_invalid(Register (ptr32 word32) a0)
// Called from:
//      netconn_free
void sys_sem_set_invalid(word32 * a0)
{
	*a0 = 0x00;
}

// 2303A2FC: void sys_init()
// Called from:
//      lwip_init
void sys_init()
{
	g_w4200EED0 = 0x00;
}

// 2303A306: void sys_mutex_new(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
// Called from:
//      mem_init
void sys_mutex_new(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	word32 * a0_28;
	word32 s6_97;
	word32 s5_96;
	word32 s4_95;
	word32 s3_94;
	word32 s2_93;
	word32 a5_92;
	word32 a4_91;
	word32 a3_90;
	word32 a1_89;
	xQueueCreateMutex(ra, a3, a4, a5, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out a0_28, out a1_89, out a3_90, out a4_91, out a5_92, out s2_93, out s3_94, out s4_95, out s5_96, out s6_97);
	*a0_28 = a0;
	if (a0_28 == null)
		g_w4201FE96 = (word16) ((word32) g_w4201FE96 + 0x01);
	else
	{
		uint32 a3_41 = (word32) g_w4201FE94;
		uint32 a4_44 = (word32) g_w4201FE92 + 0x01 << 16;
		g_w4201FE92 = (word16) (a4_44 >> 16);
		if (a3_41 < a4_44 >> 16)
			g_w4201FE94 = (word16) (a4_44 >> 16);
	}
}

