pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303A352: Register word32 sys_mutex_lock(Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg44, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Register out ptr32 s1Out, Register out ptr32 a1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      mem_free
//      mem_trim
//      mem_malloc
word32 sys_mutex_lock(Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg44, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, ptr32 & s1Out, ptr32 & a1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	ptr32 a1_10;
	ptr32 a4_13;
	ptr32 s1_17;
	ptr32 s2_18;
	ptr32 s3_19;
	ptr32 s4_20;
	word32 a0_35;
	word32 a3_36;
	word32 a5_37;
	word32 s0_16 = sys_arch_sem_wait(0x00, a3, a4, s2, mstatus, dwArg04, dwArg44, dwArg84, dwArgF8, dwArg0138, out s1_17, out a0_35, out a1_10, out a3_36, out a4_13, out a5_37, out s2_18, out s3_19, out s4_20);
	s1Out = s1_17;
	a1Out = a1_10;
	a4Out = a4_13;
	s2Out = s2_18;
	s3Out = s3_19;
	s4Out = s4_20;
	return s0_16;
}

// 2303A358: Register word32 sys_mutex_unlock(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out Eq_185565 s1Out, Register out ptr32 a1Out, Register out Eq_185567 a3Out, Register out Eq_185568 a4Out, Register out ptr32 a5Out, Register out ptr32 a7Out, Register out (ptr32 Eq_185571) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      mem_free
//      mem_trim
//      mem_malloc
//      lwip_netconn_do_gethostbyname
word32 sys_mutex_unlock(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198, union Eq_185565 & s1Out, ptr32 & a1Out, union Eq_185567 & a3Out, union Eq_185568 & a4Out, ptr32 & a5Out, ptr32 & a7Out, struct Eq_185571 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	Eq_2 a0_5 = *a0;
	ptr32 a1_13;
	Eq_185567 a3_15;
	Eq_185568 a4_16;
	ptr32 a5_17;
	ptr32 a7_19;
	word32 s0_20;
	Eq_185565 s1_21;
	struct Eq_185571 * s2_22;
	ptr32 s3_23;
	ptr32 s4_24;
	ptr32 s5_25;
	ptr32 s6_26;
	ptr32 s8_27;
	word32 a0_53;
	word32 a2_54;
	xQueueGenericSend(a0_5, 0x00, 0x00, a4, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s0_20, out s1_21, out a0_53, out a1_13, out a2_54, out a3_15, out a4_16, out a5_17, out a7_19, out s2_22, out s3_23, out s4_24, out s5_25, out s6_26, out s8_27);
	s1Out = s1_21;
	a1Out = a1_13;
	a3Out = a3_15;
	a4Out = a4_16;
	a5Out = a5_17;
	a7Out = a7_19;
	s2Out = s2_22;
	s3Out = s3_23;
	s4Out = s4_24;
	s5Out = s5_25;
	s6Out = s6_26;
	s8Out = s8_27;
	return s0_20;
}

// 2303A364: Register Eq_181744 sys_sem_signal(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArgA4, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_185626) s1Out, Register out (ptr32 Eq_185627) a1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out Eq_185630 s3Out, Register out ptr32 s4Out, Register out Eq_185632 s5Out, Register out ptr32 s6Out, Register out (ptr32 Eq_185634) s8Out)
// Called from:
//      lwip_setsockopt_callback
//      event_callback
//      lwip_netconn_do_dns_found
//      lwip_netconn_do_connected
//      err_tcp
//      lwip_netconn_do_newconn
//      lwip_netconn_do_delconn
//      lwip_netconn_do_bind
//      lwip_netconn_do_connect
//      lwip_netconn_do_disconnect
//      lwip_netconn_do_listen
//      lwip_netconn_do_send
//      lwip_netconn_do_recv
//      lwip_netconn_do_write
//      lwip_netconn_do_getaddr
//      lwip_netconn_do_close
//      lwip_netconn_do_join_leave_group
//      lwip_netconn_do_gethostbyname
Eq_181744 sys_sem_signal(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArgA4, Eq_2 dwArg0118, Eq_2 dwArg0158, Eq_2 dwArg0198, struct Eq_185626 & s1Out, struct Eq_185627 & a1Out, ptr32 & a3Out, ptr32 & s2Out, union Eq_185630 & s3Out, ptr32 & s4Out, union Eq_185632 & s5Out, ptr32 & s6Out, struct Eq_185634 & s8Out)
{
	struct Eq_185627 * a1_9;
	ptr32 a3_11;
	struct Eq_185626 * s1_17;
	ptr32 s2_18;
	Eq_185630 s3_19;
	ptr32 s4_20;
	Eq_185632 s5_21;
	ptr32 s6_22;
	struct Eq_185634 * s8_23;
	word32 a4_46;
	word32 a5_47;
	word32 a7_48;
	Eq_181744 s0_16 = sys_mutex_unlock(a0, a4, a5, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_17, out a1_9, out a3_11, out a4_46, out a5_47, out a7_48, out s2_18, out s3_19, out s4_20, out s5_21, out s6_22, out s8_23);
	s1Out = s1_17;
	a1Out = a1_9;
	a3Out = a3_11;
	s2Out = s2_18;
	s3Out = s3_19;
	s4Out = s4_20;
	s5Out = s5_21;
	s6Out = s6_22;
	s8Out = s8_23;
	return s0_16;
}

// 2303A368: Register Eq_2 sys_thread_new(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a2, Register word32 a3, Register Eq_2 a4, Register Eq_2 s3, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a6Out)
// Called from:
//      tcpip_init
Eq_2 sys_thread_new(Eq_2 ra, Eq_2 s1, Eq_2 a2, word32 a3, Eq_2 a4, Eq_2 s3, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a6Out)
{
	ptr32 a6_5 = (word32) g_w4200DED0;
	if (a6_5 <= 0x05)
	{
		word32 a5_126;
		word32 a4_125;
		word32 a3_124;
		word32 a2_123;
		xTaskCreate(ra, s1, (word32) (word16) a3, a2, a4, fp + ~0x13, s3, mstatus, dwLoc10, dwLoc0C, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out a2_123, out a3_124, out a4_125, out a5_126) != 0x01;
		a6Out = a6_32;
		return ra_44;
	}
	else
	{
		a6Out = a6_5;
		return ra;
	}
}

// 2303A3A6: Register word32 sys_arch_protect(Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a2Out, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      alloc_socket
//      lwip_link_select_cb
//      lwip_unlink_select_cb
//      lwip_selscan
//      free_socket
//      event_callback
//      lwip_accept
//      lwip_select
//      lwip_fcntl
//      mem_free
//      mem_trim
//      memp_malloc
//      memp_free
//      pbuf_free_ooseq_callback
//      pbuf_free
//      pbuf_alloc
//      pbuf_chain
//      netconn_err
//      err_tcp
word32 sys_arch_protect(Eq_2 a4, ptr32 mstatus, ptr32 & a2Out, union Eq_2 & a4Out, ptr32 & a5Out)
{
	ptr32 a5_8;
	Eq_2 a4_9 = vTaskEnterCritical(a4, mstatus, out a5_8);
	a2Out = dwArg10;
	a4Out = a4_9;
	a5Out = a5_8;
	return 0x01;
}

// 2303A3B6: Register Eq_2 sys_arch_unprotect(Register Eq_2 a3, Register ptr32 mstatus, Register out Eq_185718 a4Out, Register out Eq_185719 a5Out)
// Called from:
//      alloc_socket
//      lwip_link_select_cb
//      lwip_unlink_select_cb
//      lwip_selscan
//      free_socket
//      event_callback
//      lwip_accept
//      lwip_select
//      lwip_fcntl
//      mem_free
//      mem_trim
//      memp_malloc
//      memp_free
//      pbuf_free_ooseq_callback
//      pbuf_free
//      pbuf_alloc
//      pbuf_chain
//      netconn_err
//      err_tcp
Eq_2 sys_arch_unprotect(Eq_2 a3, ptr32 mstatus, union Eq_185718 & a4Out, union Eq_185719 & a5Out)
{
	Eq_185719 a5_5;
	Eq_185718 a4_7;
	Eq_2 a3_6 = vTaskExitCritical(a3, mstatus, out a4_7, out a5_5);
	a4Out = a4_7;
	a5Out = a5_5;
	return a3_6;
}

