pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303A3BA: Register Eq_2 sys_now(Register out Eq_185728 a5Out)
// Called from:
//      lwip_cyclic_timer
//      sys_timeout
//      sys_check_timeouts
//      sys_timeouts_sleeptime
//      netconn_prepare_delete
//      netconn_write_vectors_partly
//      netconn_shutdown
//      lwip_netconn_do_write
//      lwip_netconn_do_close
//      ping_timeout
//      ping_recv
Eq_2 sys_now(union Eq_185728 & a5Out)
{
	Eq_185728 a5_4;
	Eq_2 a0_3 = xTaskGetTickCount(out a5_4);
	a5Out = a5_4;
	return a0_3;
}

// 2303A3BE: Register Eq_2 lwip_gethostbyname(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_1459 a4Out, Register out ptr32 a5Out, Register out Eq_2 s2Out, Register out ptr32 s3Out)
// Called from:
//      http_test_cmd
//      ota_tcp_cmd
//      ping_cmd
Eq_2 lwip_gethostbyname(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgB8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, Eq_2 dwArg0148, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_1459 & a4Out, ptr32 & a5Out, union Eq_2 & s2Out, ptr32 & s3Out)
{
	ptr32 a5_111;
	Eq_1459 a4_110;
	ptr32 a0_106;
	word32 a0_17;
	word32 * a4_22;
	Eq_2 s2_26;
	ptr32 s3_27;
	word32 s4_133;
	word32 a1_132;
	ptr32 a3_109;
	ptr32 s1_114;
	Eq_2 s0_113 = netconn_gethostbyname(ra, s0, a0, fp + ~0x13, a3, mstatus, dwArg78, dwArgB8, dwArgF8, dwArg0108, dwArg0138, dwArg0148, out s1_114, out a0_17, out a1_132, out a3_109, out a4_22, out s2_26, out s3_27, out s4_133);
	if (a0_17 != 0x00)
	{
		g_dw42020D54 = 0x00D2;
		a5_111 = 0x42020000;
		a4_110.u0 = 0x00D2;
		a0_106 = 0x00;
	}
	else
	{
		*a4_22 = 0x4200DED8;
		g_dw4200DED8 = 0x4200DEDC;
		g_dw4200DEE0 = 0x00;
		word32 a4_134;
		word32 a5_135;
		strncpy(0x4201490C, s2_26, 0x0100, out a3_109, out a4_134, out a5_135);
		g_dw4200DED4 = 0x00;
		g_dw4200DED8 = 0x420148F8;
		((union Eq_2 *) 0x0A)->u0 = 0x420148F8;
		g_b42014A0C = 0x00;
		g_dw4201490C = 0x420148F8;
		((union Eq_2 *) 0x10)->u0 = 0x420148F8;
		g_ptr4200DEEC = (<anonymous> *) &g_dw420148F8;
		s0_113.u0 = 0x4200DEDC;
		s1_114 = 0x4201490C;
		a5_111 = 0x420148F8;
		a4_110.u0 = 0x04;
		a0_106 = 0x420148F8;
	}
	s1Out = s1_114;
	a0Out = a0_106;
	a3Out = a3_109;
	a4Out = a4_110;
	a5Out = a5_111;
	s2Out = s2_26;
	s3Out = s3_27;
	return s0_113;
}

// 2303A448: Register Eq_2 lwip_freeaddrinfo(Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      mbedtls_net_connect
Eq_2 lwip_freeaddrinfo(Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	if (a0 == 0x00)
		return s1;
	do
	{
		word32 a0_51;
		word32 a2_52;
		word32 a5_53;
		Eq_2 s1_22 = memp_free(0x0C, *((word32) s0 + 28), a3, a4, mstatus, out a0_51, out a2_52, out a3, out a4, out a5_53);
	} while (s0 != 0x00);
	return s1_22;
}

// 2303A468: Register Eq_2 lwip_getaddrinfo(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0198, Register out Eq_2 s0Out, Register out (ptr32 Eq_2) a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out)
// Called from:
//      mbedtls_net_connect
Eq_2 lwip_getaddrinfo(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg98, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0198, union Eq_2 & s0Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out)
{
	if (a3 == 0x00)
	{
		s0Out = s0;
		a0Out = (union Eq_2 *) 202;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		return ra;
	}
	union Eq_2 * a5_190;
	Eq_2 s5_156;
	Eq_2 s3_115;
	Eq_2 a2_157;
	a3->u0 = 0x00;
	Eq_2 s4_116 = a3;
	Eq_2 s1_113 = a2;
	Eq_2 s2_114 = a0;
	if (a0 == 0x00)
	{
		if (a1 == 0x00)
			goto l2303A492;
		if (a2 == 0x00)
			goto l2303A4AC;
	}
	else if (a2 == 0x00)
	{
		if (a1 == 0x00)
			goto l2303A502;
		goto l2303A4AC;
	}
	int32 s3_31 = *((word32) a2 + 4);
	a5_190 = (union Eq_2 *) 0x00CC;
	s3_115 = s3_31 & -3;
	if ((s3_31 & -3) != 0x00)
		goto l2303A510;
	if (a1 == 0x00)
	{
		if (a0 != 0x00)
			goto l2303A4CA;
		goto l2303A52A;
	}
l2303A4AC:
	word32 a5_642;
	word32 a4_641;
	word32 a3_640;
	word32 a2_639;
	Eq_2 a0_38 = atoi(a1, out a1, out a2_639, out a3_640, out a4_641, out a5_642);
	a3 = (word32) a0_38 - 1;
	a4.u0 = 0x0FFFFFFE;
	s3_115 = a0_38;
	a5_190 = (union Eq_2 *) 0x00C9;
	if (a0_38 > 0xF0000001)
		goto l2303A510;
	if (a0 != 0x00)
	{
		if (a2 == 0x00)
			goto l2303A502;
l2303A4CA:
		s1_113 = *a5_190;
		if ((a5_190 & 0x04) != 0x00)
		{
			word32 a0_130;
			word32 a5_643;
			ip4addr_aton(a0, fp + -36, out a0_130, out a3, out a4, out a5_643, out s4_116);
			a1 = fp + -36;
			if (a0_130 == 0x00)
			{
l2303A492:
				a5_190 = (union Eq_2 *) 200;
				goto l2303A510;
			}
l2303A4DA:
			word32 a5_645;
			word32 a2_644;
			Eq_2 a0_149 = strlen(s2_114, out a1, out a2_644, out a3, out a4, out a5_645);
			s5_156 = a0_149;
			a2_157 = (word32) a0_149 + 49;
			if (a0_149 > 0x0100)
			{
l2303A50C:
				a5_190 = (union Eq_2 *) 202;
l2303A510:
				0x00 = (uint16) dwArg0198;
				s0Out = dwArg0158;
				a0Out = a5_190;
				a1Out = a1;
				a2Out = dwArg0138;
				a3Out = a3;
				a4Out = a4;
				return ra;
			}
			goto l2303A53C;
		}
l2303A502:
		word32 a0_105;
		netconn_gethostbyname(ra, s0, a0, fp + -36, a3, mstatus, s1, dwArg98, dwArgD8, dwArgE8, dwArg0118, dwArg0128, out s1_113, out a0_105, out a1, out a3, out a4, out s2_114, out s3_115, out s4_116);
		if (a0_105 != 0x00)
			goto l2303A50C;
		goto l2303A4DA;
	}
l2303A52A:
	if (a2 != 0x00)
	{
		s1_113 = *a5_190;
		if ((a5_190 & 0x01) != 0x00)
		{
l2303A534:
			s5_156.u0 = 0x00;
			a2_157.u0 = 48;
l2303A53C:
			word32 a5_647;
			Eq_2 a0_182;
			word32 a2_646;
			Eq_2 s1_187 = memp_malloc(s1_113, 0x0C, a3, a4, mstatus, out a0_182, out a2_646, out a3, out a4, out a5_647);
			Eq_2 s0_189 = a0_182;
			a5_190 = (union Eq_2 *) 0x00CB;
			if (a0_182 != 0x00)
			{
				word32 a2_650;
				word32 a0_649;
				word32 t1_648;
				struct Eq_186053 * a5_204;
				ra = memset(ra, a0_182, 0x00, a2_157, out t1_648, out a0_649, out a1, out a2_650, out a3, out a4, out a5_204);
				a5_204->t0024 = a0_182;
				((word32) a0_182 + 32)->u0 = 0x0210;
				word32 a5_651;
				*((word32) a0_182 + 0x0022) = (word16) lwip_htons((word32) (word16) s3_115, out a5_651);
				*(union Eq_2 *) 0x06 = a0_182;
				if (s1_187 != 0x00)
				{
					*(union Eq_2 *) 0x0A = a0_182;
					*(union Eq_2 *) 0x0E = a0_182;
				}
				if (s2_114 != 0x00)
				{
					*((word32) a0_182 + 72) = a0_182;
					word32 a7_654;
					word32 a6_653;
					word32 a2_652;
					struct Eq_186110 * a5_242;
					memcpy((word32) a0_182 + 48, s2_114, s5_156, out a1, out a2_652, out a3, out a4, out a5_242, out a6_653, out a7_654);
					s0_189 = a5_242->t0018;
					Mem256[s5_156 + a5_242:byte] = 0x00;
				}
				*(union Eq_2 *) 0x20 = s0_189;
				*((word32) s0_189 + 20) = (word32) a0_182 + 32;
				*s4_116 = s0_189;
				a5_190 = null;
			}
			goto l2303A510;
		}
	}
	goto l2303A534;
}

