pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303A5AA: void netifapi_do_netif_add(Register Eq_2 ra, Register (ptr32 Eq_186129) a0, Register (ptr32 Eq_186130) a1, Register word32 a2, Register word32 a3, Register word32 a5, Register word32 s4, Register word32 s7, Register word32 mstatus, Stack word32 dwArg04, Stack word32 dwArg08, Stack word32 dwArg18, Stack word32 dwArg28, Stack word32 dwArg2C, Stack word32 dwArg34, Stack word32 dwArg38, Stack word32 dwArg48, Stack word32 dwArg58, Stack word32 dwArg64, Stack word32 dwArg78, Stack word32 dwArgA4, Stack word32 dwArgE8, Stack word32 dwArgF8, Stack word32 dwArg0118)
void netifapi_do_netif_add(Eq_2 ra, struct Eq_186129 * a0, struct Eq_186130 * a1, word32 a2, word32 a3, word32 a5, word32 s4, word32 s7, word32 mstatus, word32 dwArg04, word32 dwArg08, word32 dwArg18, word32 dwArg28, word32 dwArg2C, word32 dwArg34, word32 dwArg38, word32 dwArg48, word32 dwArg58, word32 dwArg64, word32 dwArg78, word32 dwArgA4, word32 dwArgE8, word32 dwArgF8, word32 dwArg0118)
{
	netif_add(ra, a1->ptr000C->t0008, a1, a2, a3, a5, a0->dw0020, s4, s7, mstatus, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg48, dwArg58, dwArg64, dwArg78, dwArgA4, dwArgE8, dwArgF8, dwArg0118) == 0x00;
}

// 2303A5D0: void netifapi_do_netif_set_addr(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_186193) a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128)
void netifapi_do_netif_set_addr(Eq_2 ra, Eq_2 s1, struct Eq_186193 * a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArg0118, Eq_2 dwArg0128)
{
	word32 s0_71;
	word32 s1_72;
	word32 a1_73;
	word32 a2_74;
	word32 a3_75;
	word32 a4_76;
	word32 a5_77;
	word32 s2_78;
	word32 s3_79;
	word32 s4_80;
	word32 s5_81;
	word32 s6_82;
	word32 s7_83;
	word32 mstatus_84;
	netif_set_addr(ra, s1, a1->ptr000C->t0008, a1, a2, a3, a4, a5, s3, s4, s7, mstatus, dwLoc0C, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg34, dwArg38, dwArg48, dwArg58, dwArg5C, dwArg64, dwArg68, dwArg78, dwArg88, dwArgA8, dwArg0118, dwArg0128, out s0_71, out s1_72, out a1_73, out a2_74, out a3_75, out a4_76, out a5_77, out s2_78, out s3_79, out s4_80, out s5_81, out s6_82, out s7_83, out mstatus_84);
}

// 2303A5E8: void netifapi_do_netif_common(Register word32 ra, Register (ptr32 Eq_186300) a0, Stack word32 dwArg10)
void netifapi_do_netif_common(word32 ra, struct Eq_186300 * a0, word32 dwArg10)
{
	<anonymous> * t1_5 = a0->ptr0010;
	word32 a0_7 = a0->dw0008;
	if (t1_5 == null)
		a0->ptr000C();
	else
		t1_5();
}

// 2303A606: Register Eq_2 netifapi_netif_add(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 a1, Register ptr32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s1Out)
// Called from:
//      wifi_mgmr_sta_enable
//      wifi_mgmr_ap_enable
Eq_2 netifapi_netif_add(Eq_2 ra, Eq_2 s0, ptr32 a1, ptr32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s1Out)
{
	if (a3 == 0x00)
		a3.u0 = 587783820;
	ptr32 s1_76;
	word32 a5_140;
	word32 s2_141;
	word32 s3_142;
	word32 a3_138;
	word32 a4_139;
	Eq_2 s0_75 = tcpip_api_call(ra, s0, fp + -52, a3, a4, a5, s2, mstatus, a5, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, out s1_76, out a3_138, out a4_139, out a5_140, out s2_141, out s3_142);
	s1Out = s1_76;
	return s0_75;
}

// 2303A64A: Register Eq_2 netifapi_netif_set_addr(Register Eq_2 ra, Register Eq_2 s0, Register ptr32 a1, Register ptr32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 a4Out, Register out ptr32 s3Out)
// Called from:
//      bl_rx_sm_disconnect_ind
//      stateConnectedIPNoEnter
//      stateConnectedIPYes_exit
Eq_2 netifapi_netif_set_addr(Eq_2 ra, Eq_2 s0, ptr32 a1, ptr32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & a4Out, ptr32 & s3Out)
{
	if (a3 == 0x00)
		a3.u0 = 587783820;
	Eq_2 a3_64;
	ptr32 a4_65;
	ptr32 s3_71;
	word32 a5_134;
	word32 s2_135;
	word32 s1_133;
	tcpip_api_call(ra, s0, fp + -52, a3, a4, a5, s2, mstatus, dwLoc2C, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, out s1_133, out a3_64, out a4_65, out a5_134, out s2_135, out s3_71);
	a4Out = a4_65;
	s3Out = s3_71;
	return a3_64;
}

// 2303A688: Register Eq_2 netifapi_netif_common(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out)
// Called from:
//      bl_rx_sm_connect_ind
//      bl_rx_sm_disconnect_ind
//      stateConnectedIPNoEnter
//      stateGlobalGuard_AP
//      stateConnectedIPYes_exit
//      stateGlobalGuard_stop
//      wifi_netif_dhcp_start
Eq_2 netifapi_netif_common(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out)
{
	ptr32 a3_24;
	ptr32 a4_25;
	ptr32 a5_26;
	ptr32 s2_30;
	word32 s1_64;
	word32 s3_65;
	Eq_2 s0_28 = tcpip_api_call(ra, s0, fp + -52, a3, a4, a5, s2, mstatus, dwLoc2C, dwArg88, dwArg98, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, out s1_64, out a3_24, out a4_25, out a5_26, out s2_30, out s3_65);
	a3Out = a3_24;
	a4Out = a4_25;
	a5Out = a5_26;
	s2Out = s2_30;
	return s0_28;
}

// 2303A6A6: Register word32 alloc_socket(Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_186414 s1Out, Register out Eq_186414 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_186418) s2Out, Register out Eq_2 s3Out, Register out (ptr32 Eq_186420) s5Out)
// Called from:
//      lwip_accept
//      lwip_socket
word32 alloc_socket(Eq_2 a0, word32 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_186414 & s1Out, union Eq_186414 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_186418 & s2Out, union Eq_2 & s3Out, struct Eq_186420 & s5Out)
{
	struct Eq_186418 * s2_123 = &g_t42014B0C;
	word32 s4_23 = a1;
	Eq_186414 s1_24 = 0x00;
	struct Eq_186420 * s5_127 = (struct Eq_186420 *) 0x15;
	do
	{
		word32 a2_138;
		word32 a5_140;
		word32 a4_139;
		sys_arch_protect(a4, mstatus, out a2_138, out a4_139, out a5_140);
		if (s2_123->dw0000 == 0x00)
		{
			s5_127 = s1_24 << 0x04;
			s5_127->t42014B0C = a0;
			word32 a5_137;
			word32 a4_136;
			a3 = sys_arch_unprotect(a3, mstatus, out a4_136, out a5_137);
			s5_127->dw42014B10 = 0x00;
			s5_127->w42014B14 = 0x00;
			s2_123 = (struct Eq_186418 *) &s5_127->t42014B0C;
			a4.u0 = 0x10;
			if (((word32) *a0 & 0x00F0) != 0x10)
				s4_23 = 0x01;
			s5_127->w42014B16 = (word16) s4_23;
			s5_127->w42014B18 = 0x00;
			goto l2303A706;
		}
		s1_24 = (word32) s1_24.u0 + 1;
		word32 a5_135;
		a3 = sys_arch_unprotect(a3, mstatus, out a4, out a5_135);
		++s2_123;
	} while (s1_24 != 0x15);
	s1_24.u0 = ~0x00;
l2303A706:
	s1Out = s1_24;
	a0Out = s1_24;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2_123;
	s3Out = a0;
	s5Out = s5_127;
	return s1;
}

