pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303A72A: Register Eq_2 lwip_link_select_cb(Register (ptr32 Eq_186495) a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      lwip_select
Eq_2 lwip_link_select_cb(struct Eq_186495 * a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	word32 a5_47;
	word32 a2_45;
	word32 a4_46;
	sys_arch_protect(a4, mstatus, out a2_45, out a4_46, out a5_47);
	struct Eq_186506 * a4_17 = g_ptr4200DEE8;
	a4_17->ptr0000 = a0;
	if (a4_17 != null)
		a0->ptr0004 = a4_17;
	a0->dw0000 = 0x4200DEE8;
	a4_17->ptr0001 = a4_17->ptr0000;
	word32 a4_48;
	word32 a5_49;
	return sys_arch_unprotect(a3, mstatus, out a4_48, out a5_49);
}

// 2303A762: Register Eq_2 lwip_unlink_select_cb(Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      lwip_select
Eq_2 lwip_unlink_select_cb(Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	struct Eq_186536 * a4_14;
	word32 a5_15;
	word32 a2_54;
	sys_arch_protect(a4, mstatus, out a2_54, out a4_14, out a5_15);
	if (a5_15 != 0x00)
		a4_14->dw0004 = a5_15;
	Eq_2 a5_23 = *a3;
	a3 != a4_14->t0000;
	a4_14->t0000 = a5_23;
	a4_14->t0001 = a4_14->t0000;
	word32 a4_55;
	word32 a5_56;
	return sys_arch_unprotect(a3, mstatus, out a4_55, out a5_56);
}

// 2303A7A4: Register word32 lwip_selscan(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register (ptr32 Eq_186577) a5, Register (ptr32 Eq_186578) a6, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack Eq_2 dwArg0184, Register out Eq_2 s0Out, Register out Eq_186583 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_186583 a5Out, Register out (ptr32 Eq_186589) s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_186578) s4Out, Register out ptr32 s7Out, Register out Eq_2 s8Out)
// Called from:
//      lwip_select
word32 lwip_selscan(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, struct Eq_186577 * a5, struct Eq_186578 * a6, ptr32 mstatus, Eq_2 dwArg74, Eq_2 dwArg0184, union Eq_2 & s0Out, union Eq_186583 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_186583 & a5Out, struct Eq_186589 & s2Out, ptr32 & s3Out, struct Eq_186578 & s4Out, ptr32 & s7Out, union Eq_2 & s8Out)
{
	Eq_2 s8_168 = a4;
	int32 a5_44;
	for (a5_44 = 0x00; a5_44 != 0x08; ++a5_44)
		fp + -88 + a5_44 = (byte *) 0x00;
	int32 a5_53;
	for (a5_53 = 0x00; a5_53 != 0x08; ++a5_53)
		fp + -80 + a5_53 = (byte *) 0x00;
	Eq_186583 a5_107 = 0x00;
	Eq_2 a4_115 = 0x08;
	do
	{
		Eq_2 a3_129 = (word32) a5_107.u0 + (fp + -72);
		a3_129->u1 = 0x00;
		a5_107 = (word32) a5_107.u0 + 1;
	} while (a5_107 != 0x08);
	struct Eq_186589 * s2_137 = &g_t42014B0C;
	Eq_2 s0_165 = 0x00;
	while (true)
	{
		Eq_2 a2_120;
		if (s0_165 >= a0)
			break;
		if (a1 != 0x00)
		{
			a4_115 = *((word32) a1 + (s0_165 >> 0x05) * 0x04);
			a5_107 = 0x01 << s0_165 & a4_115;
			if (a5_107 == 0x00)
				goto l2303A854;
			goto l2303A882;
		}
l2303A854:
		if (a2 != 0x00)
		{
			a4_115 = *((word32) a2 + (s0_165 >> 0x05) * 0x04);
			a5_107 = 0x01 << s0_165 & a4_115;
			if (a5_107 == 0x00)
				goto l2303A86A;
			goto l2303A882;
		}
l2303A86A:
		if (a3 != 0x00)
		{
			a5_107 = *((word32) a3 + (s0_165 >> 0x05) * 0x04);
			if ((0x01 << s0_165 & a5_107) != 0x00)
			{
l2303A882:
				word32 a4_632;
				word32 a5_633;
				sys_arch_protect(a4_115, mstatus, out a2_120, out a4_632, out a5_633);
				if (s0_165 > 0x14)
				{
					sys_arch_unprotect(a3_129, mstatus, out a4_115, out a5_107);
					goto l2303A90E;
				}
				word32 a1_141 = (word32) s2_137->w000A;
				word32 a2_142 = (word32) s2_137->w000C;
				int32 a6_143 = s2_137->dw0004;
				a3_129 = sys_arch_unprotect(a3_129, mstatus, out a4_115, out a5_107);
				0x00 = a6_143;
				if (a1 != 0x00)
				{
					a3_129 = 0x01 << s0_165;
					a4_115 = *a1 & a3_129;
					if (a4_115 != 0x00)
					{
						a2_142 = dwLoc68;
						s0_165 = dwArg74;
						if (a6_143 != 0x00 || a5_107 > 0x00)
						{
							a5_107 |= a3_129;
							s8_168 = dwArg74;
							dwLoc64 = a5_107;
						}
					}
				}
				if (a2 != 0x00)
				{
					a3_129 = 0x01 << s0_165;
					a4_115 = *a2 & a3_129;
					if (a4_115 != 0x00 && a1_141 != 0x00)
					{
						0x00 = (uint16) dwArg0184;
						a5_107 |= a3_129;
					}
				}
				if (a3 != 0x00)
				{
					a3_129 = 0x01 << s0_165;
					a4_115 = *a3 & a3_129;
					if (a4_115 != 0x00 && a2_142 != 0x00)
					{
						s0_165 = dwArg0184;
						a5_107 |= a3_129;
					}
				}
			}
		}
		s0_165 = (word32) s0_165 + 1;
		++s2_137;
	}
	*dwArg74 = a5_107;
	*((word32) dwArg74 + 4) = a5_107;
	0x00 = (uint16) dwArg0184;
	a5->t0000 = a5_107;
	a5->t0004 = a5_107;
	a6->t0000 = a5_107;
	a6->t0004 = a5_107;
	s8_168 = dwArg74;
	s0_165 = dwArg0184;
	a2_120 = dwArg0184;
l2303A90E:
	s0Out = s0_165;
	s1Out = dwLoc64;
	a0Out = dwArgA4;
	a2Out = a2_120;
	a3Out = dwArg78;
	a4Out = a4_115;
	a5Out = a5_107;
	s2Out = s2_137;
	s3Out = 0x01;
	s4Out = a6;
	s7Out = 0x14;
	s8Out = s8_168;
	return dwLoc24;
}

// 2303A92E: Register Eq_2 lwip_recv_tcp(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0198, Register out Eq_2 s1Out, Register out Eq_2 a4Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_read
Eq_2 lwip_recv_tcp(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0198, union Eq_2 & s1Out, union Eq_2 & a4Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & mstatusOut)
{
	Eq_2 s3_124 = a0;
	Eq_2 s5_102 = a1;
	Eq_2 s1_117 = a2;
	if (a2 < 0x00)
		s1_117.u0 = 0x7FFFFFFF;
	Eq_2 a2_199 = 0x08;
	if ((a3 & 8) != 0x00)
		a2_199.u0 = 0x0C;
	word32 s0_105 = 0x00;
	ui32 s6_131 = a3 & 1;
	do
	{
		Eq_2 a4_121;
		if (*((word32) s3_124 + 4) == 0x00)
		{
			Eq_2 a5_51;
			ui32 s4_63;
			ra = netconn_recv_tcp_pbuf_flags(ra, *s3_124, fp + -52, a2_199, a3, mstatus, dwArg18, dwArg24, dwArg28, dwArg38, s1, dwArg68, dwArg78, dwArg98, dwArgA8, out s0_105, out s1_117, out a0, out a2_199, out a4_121, out a5_51, out s3_124, out s4_63, out s5_102, out s6_131, out mstatus);
			if (a0 != 0x00)
			{
				if (s0_105 == 0x00)
				{
					word32 a5_557;
					Eq_2 a0_77 = err_to_errno(a0, out a4_121, out a5_557);
					if (a0_77 != 0x00)
						g_t42020D50 = a0_77;
					goto l2303A9E0;
				}
				else
				{
					if ((s4_63 & 1) != 0x00)
						goto l2303A9E0;
					goto l2303A9BC;
				}
			}
			*((word32) s3_124 + 4) = a5_51;
		}
		Eq_2 s2_93 = (word32) *((word32) a0 + 8);
		if (s2_93 >= s1_117)
			s2_93 = (word32) (word16) s1_117;
		Eq_2 a0_110;
		Eq_2 s4_114;
		Eq_2 s2_118;
		Eq_2 a3_120;
		word32 a2_554;
		word32 a1_553;
		word32 s8_556;
		word32 a5_555;
		pbuf_copy_partial(a0, (word32) s5_102 + s0_105, s2_93, 0x00, out s1_117, out a0_110, out a1_553, out a2_554, out a3_120, out a4_121, out a5_555, out s2_118, out s3_124, out s4_114, out s8_556);
		word32 s7_108 = (word32) s2_93 + s0_105;
		if (s6_131 != 0x00)
		{
			if (s7_108 == 0x00)
				goto l2303AA2C;
			goto l2303A9E0;
		}
		word32 s2_154;
		word32 s1_153;
		if ((word32) *((word32) a0_110 + 8) - s2_118 > 0x00)
		{
			word32 s8_567;
			word32 s0_565;
			word32 s4_566;
			ra = pbuf_free_header(ra, s1_117, a0_110, s2_118, dwArg04, a3_120, a4_121, s4_114, mstatus, dwArg04, dwArgC8, out s0_565, out s1_153, out a0, out a3, out a4_121, out s2_154, out s3_124, out s4_566, out s5_102, out s6_131, out s8_567, out mstatus);
			*((word32) s3_124 + 4) = a0;
		}
		else
		{
			((word32) s3_124 + 4)->u0 = 0x00;
			word32 a7_562;
			word32 s4_563;
			word32 a1_559;
			word32 s0_558;
			word32 a2_560;
			word32 a5_561;
			word32 s8_564;
			ra = pbuf_free(ra, a0_110, a3_120, a4_121, s4_114, mstatus, dwArgE8, out s0_558, out s1_153, out a0, out a1_559, out a2_560, out a3, out a4_121, out a5_561, out a7_562, out s2_154, out s3_124, out s4_563, out s5_102, out s6_131, out s8_564, out mstatus);
		}
		s1_117 = s1_153 - s2_154;
		a2_199.u0 = 0x1C;
		s0_105 = s7_108;
	} while (s1_117 > 0x00);
	if (s7_108 != 0x00)
	{
l2303A9BC:
		s1_117 = netconn_tcp_recvd(*s3_124, a2_199, mstatus, dwArg38, dwArg78, dwArgB8, out a4_121, out s3_124);
	}
	else
	{
l2303AA2C:
	}
l2303A9E0:
	0x00 = (uint16) dwArg0198;
	s1Out = s1_117;
	a4Out = a4_121;
	s3Out = s3_124;
	s4Out = dwArgF4;
	mstatusOut = mstatus;
	return ra;
}

// 2303AA30: Register Eq_2 lwip_sock_make_addr.isra.3(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Stack Eq_2 dwArg74, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_187030) a5Out)
// Called from:
//      lwip_recvfrom_udp_raw.isra.6
//      lwip_read
Eq_2 lwip_sock_make_addr.isra.3(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 dwArg74, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_187030 & a5Out)
{
	word32 a5_90;
	lwip_htons(a1, out a5_90);
	union Eq_2 * a4_32;
	word32 t1_91;
	word32 a0_92;
	word32 a1_93;
	word32 a2_94;
	word32 a3_95;
	word32 a5_96;
	Eq_2 ra_34 = memset(ra, fp + -24, 0x00, 0x08, out t1_91, out a0_92, out a1_93, out a2_94, out a3_95, out a4_32, out a5_96);
	ptr32 s0_39 = 0x01;
	Eq_2 a3_40 = *a4_32;
	if (a4_32 >= (union Eq_2 *) 0x10)
	{
		s0_39 = 0x00;
		if (a4_32 > (union Eq_2 *) 0x10)
			*(union Eq_2 *) 0x10 = a3_40;
	}
	ptr32 a4_50;
	struct Eq_187030 * a5_51;
	ptr32 a3_55;
	word32 a1_97;
	word32 a2_98;
	word32 a6_99;
	word32 a7_100;
	memcpy(a2, fp + -32, dwArg74, out a1_97, out a2_98, out a3_55, out a4_50, out a5_51, out a6_99, out a7_100);
	s1Out = a2;
	a0Out = s0_39;
	a3Out = a3_55;
	a4Out = a4_50;
	a5Out = a5_51;
	return ra_34;
}

