pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303AA8A: Register Eq_2 free_socket(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s4Out)
// Called from:
//      lwip_accept
//      lwip_close
Eq_2 free_socket(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArgE8, Eq_2 dwArg0108, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s4Out)
{
	word32 a5_163;
	word32 a4_162;
	word32 a2_161;
	sys_arch_protect(a4, mstatus, out a2_161, out a4_162, out a5_163);
	struct Eq_187110 * s0_22 = *((word32) s1 + 4);
	Eq_2 s2_23 = s0_22->t0000;
	s0_22->dw0004 = 0x00;
	s0_22->t0000.u0 = 0x00;
	Eq_2 a4_28;
	word32 a5_29;
	Eq_2 a3_27 = sys_arch_unprotect(a3, mstatus, out a4_28, out a5_29);
	if (s1 != 0x00)
	{
		if (a1 != 0x00)
		{
			word32 a3_47;
			word32 a4_48;
			word32 a5_49;
			word32 s6_172;
			word32 s5_171;
			word32 s4_170;
			word32 s3_169;
			word32 a7_168;
			word32 a2_167;
			word32 a1_166;
			word32 a0_165;
			word32 s0_164;
			word32 s8_173;
			word32 mstatus_174;
			pbuf_free(ra, s1, a3_27, a4_28, s4, mstatus, dwArg0108, out s0_164, out s1, out a0_165, out a1_166, out a2_167, out a3_47, out a4_48, out a5_49, out a7_168, out s2_23, out s3_169, out s4_170, out s5_171, out s6_172, out s8_173, out mstatus_174);
		}
		else
		{
			word32 a3_36;
			word32 a4_37;
			word32 a5_38;
			s1 = netbuf_delete(ra, s1, a3_27, a4_28, s4, mstatus, dwArgE8, out a3_36, out a4_37, out a5_38);
		}
	}
	if (s2_23 == 0x00)
	{
		a3Out.u0 = <invalid>;
		a4Out.u0 = <invalid>;
		a5Out.u0 = <invalid>;
		s2Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		return s1;
	}
	else
	{
		Eq_2 s1_82 = netconn_delete(s2_23);
		a3Out.u0 = <invalid>;
		a4Out.u0 = <invalid>;
		a5Out.u0 = <invalid>;
		s2Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		return s1_82;
	}
}

// 2303AAE0: Register Eq_2 lwip_recvfrom_udp_raw.isra.6(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg34, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0198, Register out Eq_2 a0Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out)
// Called from:
//      lwip_read
Eq_2 lwip_recvfrom_udp_raw.isra.6(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg34, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0198, union Eq_2 & a0Out, union Eq_2 & a5Out, union Eq_2 & s2Out)
{
	Eq_2 a0_109;
	a0_109 = a0;
	if (a5 == 0x00)
	{
		a0_109.u0 = ~0x0F;
		if (a5 > 0x00)
			goto l2303AB7E;
	}
	Eq_2 a3_123;
	a5 = *((word32) a0 + 4);
	ui32 a2_36 = (word32) ((a1 & 8) != 0x00);
	s2 = a1;
	a3_123 = a3;
	if (a5 == 0x00)
	{
		ra = netconn_recv_udp_raw_netbuf_flags(ra, *a0, fp + -52, a2_36 << 2, a3, mstatus, s4, dwLoc0C, dwArg68, dwArg74, dwArg88, dwArgA8, dwArgC8, dwArgE8, out s1, out a0_109, out a1, out a3_123, out a4, out a5, out s2, out mstatus);
		if (a0_109 != 0x00)
			goto l2303AB7E;
		*((word32) a0 + 4) = a5;
	}
	a5 = *a5;
	Eq_2 a2_114 = dwArgA4;
	Eq_2 s4_134 = 0x00;
	s1.u0 = 0x00;
	Eq_2 s6_81 = (word32) *((word32) a5 + 8);
	while (s4_134 < a5 && s1 < s6_81)
	{
		Eq_2 s3_106 = (word32) (word16) (s6_81 - s1);
		if (s3_106 >= a4)
			s3_106 = (word32) (word16) a4;
		word32 s8_485;
		word32 s4_117;
		uint32 s1_120;
		word32 s3_484;
		pbuf_copy_partial(a0_109, a1, s3_106, s1, out s1_120, out a0_109, out a1, out a2_114, out a3_123, out a4, out a5, out s2, out s3_484, out s4_117, out s8_485);
		s1 = s1_120 >> 16;
		s4_134 = s4_117 + 0x01;
	}
	if (a2_114 != 0x00 && a5 != 0x00)
		ra = lwip_sock_make_addr.isra.3(ra, (word32) *((word16) a0_109.u0 + 0x0C), dwArg04, dwArg34, out s1, out a0_109, out a3_123, out a4, out a5);
	struct Eq_187304 * s0_171 = *((word32) a5 + 16);
	s0_171->dw0018 = 0x00;
	if (a5 != 0x00)
		s0_171->dw0014 = 0x00;
	s2 &= 1;
	if (s2 == 0x00)
	{
		((word32) a0 + 4)->u0 = 0x00;
		word32 a4_487;
		word32 a3_486;
		s1 = netbuf_delete(ra, a0_109, a3_123, a4, s4_134, mstatus, dwArgC8, out a3_486, out a4_487, out a5);
	}
	*a3 = (word16) s6_81;
	a0_109.u0 = 0x00;
l2303AB7E:
	0x00 = (uint16) dwArg0198;
	a0Out = a0_109;
	a5Out = a5;
	s2Out = s2;
	return s1;
}

// 2303ABCC: Register Eq_2 get_socket(Register Eq_2 a0, Register out ptr32 a4Out, Register out Eq_187378 a5Out)
// Called from:
//      event_callback
//      lwip_accept
//      lwip_bind
//      lwip_close
//      lwip_connect
//      lwip_listen
//      lwip_read
//      lwip_sendto
//      lwip_write
//      lwip_shutdown
//      lwip_setsockopt
//      lwip_fcntl
Eq_2 get_socket(Eq_2 a0, ptr32 & a4Out, union Eq_187378 & a5Out)
{
	Eq_187378 a5_10;
	Eq_2 a0_13;
	if (a0 <= 0x14)
	{
		a5_10 = a0 << 0x04;
		a0_13 = null[a0].t0000;
		if (a0 << 0x04 != 0x00)
		{
l2303ABF0:
			a4Out = a4;
			a5Out = a5_10;
			return a0_13;
		}
	}
	g_t42020D50.u0 = 0x09;
	a5_10.u0 = 0x42020000;
	a4 = 0x09;
	a0_13.u0 = 0x00;
	goto l2303ABF0;
}

// 2303ABF2: void lwip_setsockopt_callback(Register word32 ra, Register word32 s0, Register (ptr32 Eq_187415) a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack word32 dwArg38, Stack word32 dwArg58, Stack Eq_2 dwArg74, Stack word32 dwArgE4, Stack Eq_2 dwArgE8, Stack word32 dwArg0100, Stack word32 dwArg0104, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void lwip_setsockopt_callback(word32 ra, word32 s0, union Eq_187415 * a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, word32 dwArg38, word32 dwArg58, Eq_2 dwArg74, word32 dwArgE4, Eq_2 dwArgE8, word32 dwArg0100, word32 dwArg0104, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	struct Eq_187414 * s0_116;
	Eq_187415 s3_17 = *a0;
	Eq_187419 s1_23 = *((word32) a4 + 16);
	Eq_2 a0_100 = *((word32) *((word32) a5 + 8) + 0x0C);
	if (s3_17 <= 0x14)
	{
		Eq_2 a2_29 = (&g_t42014B0C)[s3_17];
		if (a2_29 != 0x00)
		{
			if (s0 == 0x06)
			{
				s0_116 = (struct Eq_187414 *) 22;
				if (a4 > 0x03)
				{
					byte * a2_35 = *((word32) a4 + 4);
					if (a4 != 0x00)
					{
						s0_116 = (struct Eq_187414 *) 92;
						if (((word32) *a2_35 & 0x00F0) == 0x10)
						{
							s0_116 = (struct Eq_187414 *) 22;
							if ((word32) *((word32) a4 + 20) != 0x01)
							{
								a5 += ~0x00;
								s0_116 = (struct Eq_187414 *) 92;
								if (a5 <= ~0x04)
								{
									word32 a5_50 = 587751740[(a5 + ~0x00) * 0x04];
									word32 t2_255;
									a5_50();
									return;
								}
							}
						}
					}
				}
				goto l2303AC7E;
			}
			if (s0 != 0x00FFFFFF)
			{
				if (s0 == 0x00 && a5 <= ~0x06)
					;
				goto l2303AC40;
			}
			if (a5 != 0x01000005)
			{
				if (a5 <= 0x01000005)
				{
					if (a5 != 0x08 && (a5 != 32 && a5 != 0x04))
						goto l2303AC40;
					if (a5 == 32)
					{
						s0_116 = (struct Eq_187414 *) 92;
						if (((word32) *a2_29 & 0x00F0) != a5)
							goto l2303AC7E;
					}
					else if (a5 != 0x04 && a5 != 0x08)
						a5.u0 = 0x00;
					s0_116 = (struct Eq_187414 *) 22;
					if (a4 > 0x03 && true)
					{
						int32 a5_165 = a5 << 24;
						a0_100 = *(union Eq_2 *) 22;
						int32 a4_166 = (int32) *(union Eq_69455 *) 0x0C;
						a5 = a5_165 >> 24;
						if (false)
						{
							a5 = ~(a5_165 >> 24);
							a4 = a4_166 & a5;
							*(union Eq_69455 *) 0x0C = (byte) a4;
							goto l2303AC7E;
						}
						a4 = a4_166 | a5_165 >> 24;
						*(union Eq_69455 *) 0x0C = (byte) a4;
						goto l2303ACFA;
					}
				}
				else if (a5 != 0x0100000A)
				{
					if (a5 != 0x0100000B)
					{
						if (a5 != 0x01000006)
						{
l2303AC40:
							s0_116 = (struct Eq_187414 *) 92;
							goto l2303AC7E;
						}
						a5.u0 = 0x0F;
						s0_116 = (struct Eq_187414 *) 22;
						if (a4 > 0x0F)
						{
							a0_100 = *(union Eq_2 *) 0x0F;
							a4 = a4 ^ 1000;
							a5 = (a4 ^ 1000) + 1015;
							if (a5 < 0x00)
								goto l2303AC7E;
							*((word16) a5.u0 + 32) = a2_29;
l2303ACFA:
							s0_116 = null;
							goto l2303AC7E;
						}
					}
					else
					{
						a5.u0 = 0x05;
						s0_116 = (struct Eq_187414 *) 22;
						if (a4 <= 0x05)
							goto l2303AC7E;
						Eq_2 a1_115 = 0x00;
						if ((word32) *a0_100 != 0x00)
						{
							a0_100 = netif_find(a0_100, out a4, out a5);
							a1_115 = a0_100;
							s0_116 = (struct Eq_187414 *) 0x13;
							if (a0_100 == 0x00)
								goto l2303AC7E;
						}
						ui32 a5_121 = (word32) *a4;
						a5 = a5_121 & 0x00F0;
						if ((a5_121 & 0x00F0) == 32)
						{
							a4 = *((word32) a0_100 + 4);
							a5 = udp_bind_netif(a0_100, a1_115);
							goto l2303ACFA;
						}
						if ((a5_121 & 0x00F0) == 64)
						{
							a4 = *((word32) a0_100 + 4);
							a5 = raw_bind_netif(a0_100, a1_115);
							goto l2303ACFA;
						}
						s0_116 = null;
						if ((a5_121 & 0x00F0) == 0x10)
						{
							a4 = *((word32) a0_100 + 4);
							a5 = tcp_bind_netif(a0_100, a1_115);
						}
					}
				}
				else
				{
					a5.u0 = 0x03;
					s0_116 = (struct Eq_187414 *) 22;
					if (a4 <= 0x03)
						goto l2303AC7E;
					byte * a2_84 = *((word32) a4 + 4);
					if (a4 != 0x00)
					{
						ui32 a5_85 = (word32) *a2_84;
						s0_116 = (struct Eq_187414 *) 92;
						a5 = a5_85 & 0x00F0;
						if ((a5_85 & 0x00F0) == 32)
						{
							a0_100 = *(union Eq_2 *) 92;
							ui32 a5_90 = (word32) *((word32) a4 + 16);
							if (true)
							{
								*((word32) a4 + 16) = (byte) (a5_90 | 1);
								a5 = a5_90 | 1;
								goto l2303ACFA;
							}
							*((word32) a4 + 16) = (byte) (a5_90 & ~0x01);
							a5 = a5_90 & ~0x01;
						}
					}
				}
			}
			else
			{
				a5.u0 = 0x0F;
				s0_116 = (struct Eq_187414 *) 22;
				if (a4 <= 0x0F)
					goto l2303AC7E;
				a0_100 = *(union Eq_2 *) 0x0F;
				a4 = a4 ^ 1000;
				a5 = (a4 ^ 1000) + 1015;
				if (a5 >= 0x00)
				{
					*((word16) a5.u0 + 28) = a2_29;
					goto l2303ACFA;
				}
			}
l2303AC7E:
			s0_116->dw0014 = (word32) *((word32) a0_100 + 24);
			word32 s1_393;
			word32 a1_394;
			word32 a3_395;
			word32 s5_399;
			word32 s3_397;
			word32 s4_398;
			word32 s6_400;
			word32 s8_401;
			word32 s2_396;
			sys_sem_signal(a0_100, a4, a5, mstatus, dwLoc28, dwLoc0C, dwArg74, dwArgE8, dwArg0128, dwArg0168, out s1_393, out a1_394, out a3_395, out s2_396, out s3_397, out s4_398, out s5_399, out s6_400, out s8_401);
			0x00 = (uint16) dwArg0128;
			return;
		}
	}
	s0_116 = (struct Eq_187414 *) 0x09;
	goto l2303AC7E;
}

// 2303AFD8: void event_callback(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack word32 dwArg010C, Stack Eq_2 dwArg0148)
void event_callback(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArgC8, Eq_2 dwArg0108, word32 dwArg010C, Eq_2 dwArg0148)
{
	if (a0 == 0x00)
		return;
	if (s1 < 0x00)
	{
		word32 a4_802;
		word32 a5_803;
		word32 a2_801;
		sys_arch_protect(a4, mstatus, out a2_801, out a4_802, out a5_803);
		word32 s0_41 = *((word32) s1 + 24);
		if (s1 < 0x00)
		{
			if (a1 == 0x00)
				*((word32) s1 + 23) = s0_41;
			goto l2303B018;
		}
		word32 a4_804;
		word32 a5_805;
		a3 = sys_arch_unprotect(a3, mstatus, out a4_804, out a5_805);
	}
	Eq_2 a4_50;
	word32 a5_800;
	Eq_2 a0_49 = get_socket(s1, out a4_50, out a5_800);
	if (a0_49 == 0x00)
	{
		0x00 = dwArg010C;
		return;
	}
	word32 a4_809;
	word32 a5_810;
	word32 a2_808;
	sys_arch_protect(a4_50, mstatus, out a2_808, out a4_809, out a5_810);
	word32 a5_74 = 0x01;
	if (a1 <= 0x04)
	{
		a1.u0 = 587751760;
		switch (a1 << 2)
		{
		case 3707215536:
			int32 a5_87 = (word32) *((word32) a0_49 + 8) + 0x01 << 16;
			*((word32) a0_49 + 8) = (word16) (a5_87 >> 16);
			a5_74 = (word32) (a5_87 >> 16 < 2);
			break;
		case 3707215537:
			*((word32) a0_49 + 8) = (word16) ((word32) *((word32) a0_49 + 8) + ~0x00);
			a5_74 = 0x00;
			break;
		}
	}
	if ((word32) *((word32) a0_49 + 0x0E) != 0x00 && a5_74 != 0x00)
	{
		int32 s3_129 = (int32) *((word32) a0_49 + 8);
		word32 s4_137 = (word32) *((word32) a0_49 + 0x0A);
		word32 s2_148 = (word32) *((word32) a0_49 + 0x0C);
		Eq_2 a4_102;
		word32 a5_811;
		Eq_2 a3_101 = sys_arch_unprotect(a3, mstatus, out a4_102, out a5_811);
		word32 a4_813;
		word32 a5_814;
		word32 a2_812;
		Eq_2 a4_111 = sys_arch_protect(a4_102, mstatus, out a2_812, out a4_813, out a5_814);
		ui32 s11_112 = 0x01 << s1;
		word32 s6_113 = 0x4200E000;
		struct Eq_187865 * s8_114 = &g_t4200E000;
		int32 s10_116 = s1 >> 0x05 << 2;
l2303B0AC:
		Eq_2 a5_118 = s6_113 + -0x011C;
		Eq_2 s5_120 = *a5_118;
		int32 s0_122 = s8_114->dwFFFFFEE8;
		union Eq_2 * s7_123 = s6_113 + -0x011C;
		while (s0_122 != 0x00)
		{
			struct Eq_187482 * s0_127 = *((word32) a5_118 + 28);
			if (a5_118 == 0x00)
			{
				s0_127 = (struct Eq_187482 *) *((word32) a5_118 + 20);
				if (a5_118 != 0x00)
				{
					s0_127 = (struct Eq_187482 *) *((word16) a1.u0 + 24);
					a5_118 = (word32) a5_118 + 4;
					a3_101.u0 = 0x00;
					while (a3_101 != a1)
					{
						if (s1 == *((word32) a5_118 - 4) && (s3_129 > 0x00 && ((word32) (*a5_118) & 0x01) != 0x00 || (s4_137 != 0x00 && ((word32) (*a5_118) & 0x02) != 0x00 || s2_148 != 0x00)))
							goto l2303B17C;
						a3_101 = (word16) a3_101.u0 + 1;
						a5_118 = (word32) a5_118 + 8;
					}
					goto l2303B100;
				}
				if (s3_129 > 0x00)
				{
					s0_127 = (struct Eq_187482 *) *((word32) a5_118 + 8);
					if (a5_118 == 0x00)
						goto l2303B158;
					a5_118 = s11_112 & *((word32) a5_118 + s10_116);
					if (a5_118 == 0x00)
						goto l2303B158;
					goto l2303B17C;
				}
l2303B158:
				if (s4_137 != 0x00)
				{
					s0_127 = (struct Eq_187482 *) *((word32) a5_118 + 0x0C);
					if (a5_118 == 0x00)
						goto l2303B16A;
					a5_118 = s11_112 & *((word32) a5_118 + s10_116);
					if (a5_118 == 0x00)
						goto l2303B16A;
					goto l2303B17C;
				}
l2303B16A:
				if (s2_148 != 0x00)
				{
					s0_127 = (struct Eq_187482 *) *((word32) a5_118 + 16);
					if (a5_118 != 0x00)
					{
						a5_118 = s11_112 & *((word32) a5_118 + s10_116);
						if (a5_118 != 0x00)
						{
l2303B17C:
							s0_127->dw001C = 0x01;
							s0_127 = sys_sem_signal(s0_127 + 4, a4_111, a5_118, mstatus, dwLoc48, s0, ra, dwArgC8, dwArg0108, dwArg0148, out s1, out a1, out a3_101, out s2_148, out s3_129, out s4_137, out s5_120, out s6_113, out s8_114);
						}
					}
				}
			}
l2303B100:
			Eq_2 a4_254;
			word32 a5_815;
			a3_101 = sys_arch_unprotect(a3_101, mstatus, out a4_254, out a5_815);
			word32 a5_818;
			word32 a2_816;
			word32 a4_817;
			Eq_2 a0_256 = sys_arch_protect(a4_254, mstatus, out a2_816, out a4_817, out a5_818);
			a5_118 = *s7_123;
			a4_111 = a0_256;
			if (a5_118 != s5_120)
				goto l2303B0AC;
			s5_120 = *s7_123;
			s0_122 = s0_127->dw0000;
		}
	}
l2303B018:
	0x00 = dwArg010C;
	word32 a4_806;
	word32 a5_807;
	sys_arch_unprotect(s2, mstatus, out a4_806, out a5_807);
}

// 2303B1AE: Register Eq_2 lwip_accept(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out ptr32 mstatusOut)
// Called from:
//      TCP_Server
//      iperf_server
Eq_2 lwip_accept(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, union Eq_2 & a0Out, union Eq_2 & a3Out, ptr32 & mstatusOut)
{
	Eq_2 s0_103;
	struct Eq_188031 * sp_126 = fp + -64;
	Eq_2 a4_21;
	word32 a5_447;
	Eq_2 a0_20 = get_socket(a0, out a4_21, out a5_447);
	if (a0_20 == 0x00)
	{
l2303B1C8:
		s0_103.u0 = ~0x00;
		goto l2303B1CA;
	}
	Eq_2 a3_29;
	Eq_2 a4_30;
	byte * a5_31;
	Eq_2 a0_227;
	ra = netconn_accept(ra, *a0_20, fp + -56, a3, a4_21, mstatus, dwLoc0C, dwArg14, dwArg68, dwArg88, dwArgA8, dwArgC8, dwArgE8, out a0_227, out a3_29, out a4_30, out a5_31, out mstatus);
	if (a0_227 == 0x00)
	{
		Eq_2 a0_53;
		Eq_2 a4_56;
		struct Eq_188085 * s1_60;
		word32 s5_448;
		word32 s3_101;
		word32 s2_100;
		alloc_socket(a0_227, 0x01, a3_29, a4_30, mstatus, out s1_60, out a0_53, out a3, out a4_56, out s2_100, out s3_101, out s5_448);
		if (a0_53 == ~0x00)
		{
			netconn_delete(a0_53);
			g_t42020D50.u0 = 0x17;
			s0_103 = dwArg04;
		}
		else
		{
			word32 a5_451;
			word32 a4_450;
			word32 a2_449;
			Eq_2 a0_107 = sys_arch_protect(a4_56, mstatus, out a2_449, out a4_450, out a5_451);
			*((word32) dwArgA4 + 24) = s1_60->dw0018;
			struct Eq_188130 * a5_79;
			Eq_2 a4_114;
			a3 = sys_arch_unprotect(a3, mstatus, out a4_114, out a5_79);
			s0_103 = dwArgA4;
			<anonymous> * a5_112 = a5_79->ptr002C;
			if (a5_112 != null)
			{
				int32 s1_104 = (int32) (word16) ~s1_60;
				while (s1_104 > 0x00)
				{
					word32 tp_116;
					word32 a7_117;
					word32 t0_118;
					word32 t1_119;
					word32 t4_120;
					word32 t5_121;
					word32 t6_122;
					word32 s5_123;
					word32 s6_297;
					a5_112();
				}
			}
			if (s3_101 != 0x00 && s2_100 != 0x00)
			{
				s0_103 = sp_126->t0044;
				Eq_2 a3_140;
				Eq_2 a4_141;
				union Eq_2 * s2_146;
				Eq_2 s3_147;
				Eq_2 s4_148;
				Eq_2 a0_137 = netconn_getaddr(a0_107, &sp_126->w0006 + 3, &sp_126->w0006, a4_114, mstatus, sp_126->t0078, sp_126->t00B8, sp_126->t00F8, out a3_140, out a4_141, out s2_146, out s3_147, out s4_148);
				if (a0_137 != 0x00)
				{
					word32 a4_461;
					word32 a5_462;
					word32 s4_464;
					word32 s2_463;
					a0_227 = free_socket(ra, netconn_delete(a0_137), 0x01, a3_140, a4_141, s4_148, mstatus, sp_126->t00E8, sp_126->t0108, out a3, out a4_461, out a5_462, out s2_463, out s4_464);
					goto l2303B27E;
				}
				Eq_2 a0_160 = (word32) sp_126->w0006;
				sp_126->t0010.u1 = 0x0210;
				word32 a5_164;
				sp_126->w0012 = (word16) lwip_htons(a0_160, out a5_164);
				sp_126->dw0088 = a5_164;
				word32 a5_460;
				word32 a3_458;
				word32 a4_459;
				word32 a2_457;
				word32 t1_454;
				word32 a0_455;
				word32 a1_456;
				ra = memset(ra, &sp_126->w0012 + 3, 0x00, 0x08, out t1_454, out a0_455, out a1_456, out a2_457, out a3_458, out a4_459, out a5_460);
				Eq_2 a5_181 = (word32) sp_126->t0010;
				if (a5_181 < *s2_146)
					*s2_146 = (union Eq_2 *) a5_181;
				word32 a2_466;
				word32 a7_470;
				word32 a6_469;
				word32 a5_468;
				word32 a4_467;
				word32 a1_465;
				memcpy(s3_147, &sp_126->t0010, *s2_146, out a1_465, out a2_466, out a3, out a4_467, out a5_468, out a6_469, out a7_470);
			}
		}
l2303B1CA:
		a0Out = s0_103;
		a3Out = a3;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		Eq_2 a4_248;
		a3.u0 = 0x10;
		if (((word32) *a5_31 & 0x00F0) != 0x10)
		{
			a4_248.u0 = 95;
			goto l2303B1FE;
		}
		if (a0_227 == ~0x0E)
		{
			a4_248.u0 = 22;
l2303B1FE:
			g_t42020D50 = a4_248;
			goto l2303B1C8;
		}
l2303B27E:
		word32 a5_453;
		word32 a4_452;
		Eq_2 a0_242 = err_to_errno(a0_227, out a4_452, out a5_453);
		if (a0_242 != 0x00)
			g_t42020D50 = a0_242;
		goto l2303B1C8;
	}
}

// 2303B2E8: Register word32 lwip_bind(Register Eq_2 a0, Register (ptr32 Eq_188320) a1, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg88, Stack Eq_2 dwArgC8, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s3Out)
// Called from:
//      TCP_Server
//      iperf_client_udp
//      iperf_server
word32 lwip_bind(Eq_2 a0, struct Eq_188320 * a1, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg88, Eq_2 dwArgC8, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s3Out)
{
	ptr32 a5_54;
	word32 a5_190;
	word32 a4_189;
	if (get_socket(a0, out a4_189, out a5_190) == 0x00)
	{
l2303B2FC:
		a5_54 = ~0x00;
		goto l2303B344;
	}
	Eq_2 a0_32;
	if (dwArg34 == 0x10)
	{
		Eq_2 a4_19 = (word32) a1->b0001;
		if (a4_19 == 0x02 && (a1 & 3) == 0x00)
		{
			Eq_2 a5_27;
			Eq_2 a0_26 = lwip_htons((word32) (a1 & 3)->ptr0004->w0002, out a5_27);
			a0_32 = netconn_bind(a0_26, fp + -20, a0_26, a4_19, a5_27, mstatus, dwArg48, dwArg88, dwArgC8, out a3, out s3);
			a5_54 = 0x00;
			if (a0_32 == 0x00)
			{
l2303B344:
				a0Out = a5_54;
				a3Out = a3;
				s3Out = s3;
				return dwArgE4;
			}
l2303B318:
			word32 a5_192;
			word32 a4_191;
			Eq_2 a0_57 = err_to_errno(a0_32, out a4_191, out a5_192);
			if (a0_57 != 0x00)
				g_t42020D50 = a0_57;
			goto l2303B2FC;
		}
	}
	a0_32.u0 = ~0x0F;
	goto l2303B318;
}

