pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303B34E: Register word32 lwip_close(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a2, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out (ptr32 Eq_1999) a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 (ptr32 Eq_2)) a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_2006) s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      http_test_cmd
//      ota_tcp_cmd
//      tcpc_entry
//      TCP_Server
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      mbedtls_net_connect
//      mbedtls_net_free
word32 lwip_close(Eq_2 ra, Eq_2 a0, Eq_2 a2, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0128, union Eq_2 & s1Out, struct Eq_1999 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & s2Out, struct Eq_2006 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	struct Eq_1999 * a0_144;
	ptr32 a4_134;
	union Eq_2 ** a5_135;
	if (get_socket(a0, out a4_134, out a5_135) != 0x00)
	{
		union Eq_2 * s2_22 = *a5_135;
		Eq_2 a4_31;
		Eq_2 a5_161;
		Eq_2 a0_30 = get_socket(a0, out a4_31, out a5_161);
		Eq_2 s3_162 = a0_30;
		if (a0_30 != 0x00)
		{
			word32 s4_36 = 0x42014B0C;
			do
			{
				struct Eq_188475 * s0_39 = *a5_161;
				if (s3_162 == a5_161)
				{
					struct Eq_188479 * s0_41 = *((word32) a5_161 + 8);
					s0_41->dw0000 = 0x00;
					s0_41->dw0008 = 0x00;
					s0_39 = (struct Eq_188475 *) *((word32) a5_161 + 4);
					s0_39->dw0004 = 0x00;
					a2 = netconn_join_leave_group(*s3_162, fp + -40, fp + -36, a4_31, a5_161, mstatus, dwArg48, dwArg88, dwArgC8, out a4_31, out a5_161, out s2_22, out s3_162, out s4_36);
				}
			} while (&s0_39->dw0004 + 2 != s4_36);
		}
		Eq_2 a0_103;
		Eq_2 a4_107;
		s1 = netconn_prepare_delete(*s2_22, a2, a4_31, mstatus, dwArg48, dwArg88, dwArgC8, out a0_103, out a1, out a3, out a4_107, out s2, out s3, out s4, out s5, out s6);
		if (a0_103 == 0x00)
		{
			a1 = s1;
			s1 = free_socket(ra, s1, s1, a3, a4_107, s4, mstatus, dwArgB8, dwArgD8, out a3, out a4_134, out a5_135, out s2, out s4);
			a0_144 = null;
l2303B366:
			0x00 = (uint16) dwArg0128;
			s1Out = s1;
			a0Out = a0_144;
			a1Out = a1;
			a2Out = dwArg0100;
			a3Out = a3;
			a4Out = a4_134;
			a5Out = a5_135;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			return dwArgE4;
		}
		Eq_2 a0_145 = err_to_errno(a0_103, out a4_134, out a5_135);
		if (a0_145 != 0x00)
		{
			g_t42020D50 = a0_145;
			a5_135 = (union Eq_2 **) &g_t42020000;
		}
	}
	a0_144 = (struct Eq_1999 *) ~0x00;
	goto l2303B366;
}

// 2303B3F6: Register word32 lwip_connect(Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg48, Stack Eq_2 dwArg88, Stack Eq_2 dwArgC8, Register out (ptr32 Eq_1674) a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      http_test_cmd
//      ota_tcp_cmd
//      tcpc_entry
//      iperf_client_tcp
//      mbedtls_net_connect
word32 lwip_connect(Eq_2 a0, Eq_2 a1, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg48, Eq_2 dwArg88, Eq_2 dwArgC8, struct Eq_1674 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	struct Eq_1674 * a5_78;
	word32 a5_241;
	Eq_2 a4_134;
	Eq_2 a0_13 = get_socket(a0, out a4_134, out a5_241);
	if (a0_13 == 0x00)
	{
l2303B40A:
		a5_78 = (struct Eq_1674 *) ~0x00;
		goto l2303B420;
	}
	Eq_2 a0_32;
	Eq_2 a5_18 = (word32) *((word32) a1 + 1);
	if (a5_18 == 0x00)
		a0_32 = netconn_disconnect(*a0_13, dwArg34, a4_134, a5_18, mstatus, dwArg48, dwArg88, dwArgC8, out a1, out a3, out a4_134, out s2, out s3, out s4);
	else
	{
		if (dwArg34 != 0x10 || (a5_18 != 0x02 || (a1 & 3) != 0x00))
		{
			a0_32.u0 = ~0x0F;
			goto l2303B43E;
		}
		Eq_2 a5_27;
		Eq_2 a0_26 = lwip_htons((word32) (a1 & 3)->ptr0004->w0002, out a5_27);
		a0_32 = netconn_connect(a0_26, fp + -20, a0_26, 0x02, a5_27, mstatus, dwArg48, dwArg88, dwArgC8, out a1, out a3, out a4_134, out s2, out s3, out s4);
	}
	a5_78 = null;
	if (a0_32 == 0x00)
	{
l2303B420:
		a0Out = a5_78;
		a1Out = a1;
		a2Out = dwArg0100;
		a3Out = a3;
		a4Out = a4_134;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		return dwArgE4;
	}
l2303B43E:
	word32 a5_242;
	Eq_2 a0_81 = err_to_errno(a0_32, out a4_134, out a5_242);
	if (a0_81 != 0x00)
		g_t42020D50 = a0_81;
	goto l2303B40A;
}

// 2303B466: Register Eq_2 lwip_listen(Register Eq_2 a0, Register int32 a1, Register ptr32 mstatus, Stack Eq_2 dwArg44, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out)
// Called from:
//      TCP_Server
//      iperf_server
Eq_2 lwip_listen(Eq_2 a0, int32 a1, ptr32 mstatus, Eq_2 dwArg44, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgD8, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out)
{
	ptr32 a5_59;
	Eq_2 a4_12;
	word32 a5_161;
	Eq_2 a0_11 = get_socket(a0, out a4_12, out a5_161);
	if (a0_11 != 0x00)
	{
		if (a1 < 0x00)
			a1 = 0x00;
		s0 = *a0_11;
		Eq_2 a0_37 = netconn_listen_with_backlog(a0_11, dwArg44, a4_12, 0x00FF, mstatus, dwArg58, dwArg98, dwArgD8, out a3, out s2);
		a5_59 = 0x00;
		if (a0_37 == 0x00)
		{
l2303B478:
			a0Out = a5_59;
			a3Out = a3;
			s2Out = s2;
			return s0;
		}
		s0 = null;
		if (((word32) null & 0x00F0) != 0x10)
			g_t42020D50.u0 = 95;
		else
		{
			word32 a4_162;
			word32 a5_163;
			Eq_2 a0_64 = err_to_errno(a0_37, out a4_162, out a5_163);
			if (a0_64 != 0x00)
				g_t42020D50 = a0_64;
		}
	}
	a5_59 = ~0x00;
	goto l2303B478;
}

// 2303B4D2: Register Eq_2 lwip_recvfrom(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out Eq_2 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_read
//      lwip_recv
Eq_2 lwip_recvfrom(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & s8Out, union Eq_2 & s9Out, ptr32 & mstatusOut)
{
	Eq_2 s0_102;
	Eq_2 s2_117 = a2;
	Eq_2 s4_119 = a4;
	union Eq_2 * a5_29;
	word32 a4_343;
	if (get_socket(a0, out a4_343, out a5_29) != 0x00)
	{
		Eq_2 a0_30 = *a5_29;
		if (((word32) *a5_29 & 0x00F0) == 0x10)
		{
			Eq_2 a4_109;
			word32 s1_116;
			ra = lwip_recv_tcp(ra, a5, a0_30, a1, a2, a3, mstatus, dwLoc5C, dwLoc48, s4, s2, dwLoc28, dwArg08, dwArg18, dwArg38, s1, dwArg58, dwArg68, dwArg88, dwArg0138, out s1_116, out a4_109, out s3, out s4_119, out mstatus);
			s0_102 = a0_105;
			if (s4_119 != 0x00 && s1_116 != 0x00)
			{
				word32 a3_344;
				word32 a4_345;
				netconn_getaddr(*s3, fp + -60, fp + -0x0044, a4_109, mstatus, dwArg18, dwArg58, dwArg98, out a3_344, out a4_345, out s2_117, out s3, out s4_119);
				word32 s1_346;
				word32 a0_347;
				word32 a3_348;
				word32 a4_349;
				word32 a5_350;
				ra = lwip_sock_make_addr.isra.3(ra, (word32) wLoc44, s4_119, dwArg14, out s1_346, out a0_347, out a3_348, out a4_349, out a5_350);
			}
			goto l2303B530;
		}
		Eq_2 a0_63;
		word32 * a5_65;
		word32 s1_68 = lwip_recvfrom_udp_raw.isra.6(ra, a0_30, a3, fp + -70, 0x10, 0x00, a4, mstatus, dwLoc5C, dwLoc2C, dwArg08, dwArg14, dwArg28, s3, s1, dwArg68, dwArg88, dwArg0138, out a0_63, out a5_65, out s2_117);
		if (a0_63 == 0x00)
		{
			s0_102.u0 = 0x00;
			if (s2_117 < 0x00)
				s0_102 = s2_117;
			if (s1_68 != 0x00)
			{
				*a5_65 = s1_68;
				s0_102 = dwArg0194;
			}
l2303B530:
			s0Out = s0_102;
			s1Out = dwArg28;
			a0Out = s0_102;
			a2Out = a2;
			a3Out = dwArg08;
			s2Out = s2_117;
			s3Out = s3;
			s4Out = s4_119;
			s5Out = s4;
			s6Out = s6;
			s8Out = s8;
			s9Out = dwLoc5C;
			mstatusOut = mstatus;
			return ra;
		}
		word32 a4_351;
		word32 a5_352;
		Eq_2 a0_97 = err_to_errno(a0_63, out a4_351, out a5_352);
		if (a0_97 != 0x00)
			g_t42020D50 = a0_97;
	}
	s0_102.u0 = ~0x00;
	goto l2303B530;
}

