pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303B596: Register Eq_2 lwip_read(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      http_test_cmd
//      ota_tcp_cmd
//      tcpc_entry
//      mbedtls_net_recv
Eq_2 lwip_read(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg0138, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	ptr32 a0_16;
	ptr32 a3_17;
	ptr32 s0_21;
	ptr32 mstatus_31;
	ptr32 s6_34;
	word32 s1_58;
	word32 a2_59;
	word32 s2_60;
	word32 s3_61;
	word32 s4_62;
	word32 s5_63;
	word32 s8_64;
	word32 s9_65;
	Eq_2 ra_32 = lwip_recvfrom(ra, s1, a0, a1, a2, 0x00, 0x00, 0x00, s2, s3, s4, mstatus, dwArg08, dwArg14, dwArg18, dwArg28, dwArg38, dwArg58, dwArg68, dwArg88, dwArg98, dwArg0138, out s0_21, out s1_58, out a0_16, out a2_59, out a3_17, out s2_60, out s3_61, out s4_62, out s5_63, out s6_34, out s8_64, out s9_65, out mstatus_31);
	s0Out = s0_21;
	a0Out = a0_16;
	a3Out = a3_17;
	s6Out = s6_34;
	mstatusOut = mstatus_31;
	return ra_32;
}

// 2303B5A0: Register Eq_2 lwip_recv(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg0138, Register out ptr32 s0Out, Register out Eq_188945 s1Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 s9Out, Register out ptr32 mstatusOut)
// Called from:
//      TCP_Server
//      iperf_server
Eq_2 lwip_recv(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg0138, ptr32 & s0Out, union Eq_188945 & s1Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & s9Out, ptr32 & mstatusOut)
{
	ptr32 a0_16;
	ptr32 a3_17;
	ptr32 s0_21;
	Eq_188945 s1_22;
	ptr32 s2_23;
	ptr32 s4_24;
	ptr32 s5_25;
	ptr32 s9_26;
	ptr32 a2_29;
	ptr32 mstatus_31;
	ptr32 s3_33;
	ptr32 s6_34;
	ptr32 s8_36;
	Eq_2 ra_32 = lwip_recvfrom(ra, s1, a0, a1, a2, a3, 0x00, 0x00, s2, s3, s4, mstatus, dwArg08, dwArg14, dwArg18, dwArg28, dwArg38, dwArg58, dwArg68, dwArg88, dwArg98, dwArg0138, out s0_21, out s1_22, out a0_16, out a2_29, out a3_17, out s2_23, out s3_33, out s4_24, out s5_25, out s6_34, out s8_36, out s9_26, out mstatus_31);
	s0Out = s0_21;
	s1Out = s1_22;
	a0Out = a0_16;
	a2Out = a2_29;
	a3Out = a3_17;
	s2Out = s2_23;
	s3Out = s3_33;
	s4Out = s4_24;
	s5Out = s5_25;
	s6Out = s6_34;
	s8Out = s8_36;
	s9Out = s9_26;
	mstatusOut = mstatus_31;
	return ra_32;
}

// 2303B5A8: Register Eq_2 lwip_sendto(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_send
//      iperf_client_udp
Eq_2 lwip_sendto(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_2 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Eq_2 a0_217;
	Eq_2 s3_196 = a0;
	ptr32 s2_195 = a1;
	Eq_2 s0_232 = dwArg74;
	Eq_2 a2_185 = ra;
	struct Eq_189020 * a5_30;
	Eq_2 a4_29;
	if (get_socket(a0, out a4_29, out a5_30) == 0x00)
	{
l2303B5CE:
		a0_217.u0 = ~0x00;
		goto l2303B5EC;
	}
	ui32 a2_37 = (word32) *ra;
	Eq_2 a0_34 = *ra;
	a2_185 = a2_37 & 0x00F0;
	if ((a2_37 & 0x00F0) == 0x10)
	{
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 stackArg40 = <invalid>;
		Eq_2 stackArg104 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		word32 a3_487;
		word32 s8_488;
		s0_232 = lwip_send(a0, a3, mstatus, stackArg40, stackArg104, stackArg168, out a0_217, out a2_185, out a3_487, out s2_195, out s3_196, out s4, out s5, out s8_488, out mstatus);
		goto l2303B5EC;
	}
	Eq_2 a3_39 = 0x10000000;
	if (dwArg74 >= 0x10000000)
	{
		g_t42020D50.u0 = 90;
		goto l2303B5CE;
	}
	s4 = (word32) (word16) dwArg74;
	if (a4_29 != 0x00)
	{
		if (a5_30 != (struct Eq_189020 *) 0x10)
			goto l2303B61C;
		a3_39 = (word32) *((word32) a4_29 + 1);
		if (a3_39 != 0x02)
		{
l2303B61C:
			word32 a4_489;
			word32 a5_490;
			Eq_2 a0_220 = err_to_errno(~0x0F, out a4_489, out a5_490);
			if (a0_220 != 0x00)
				g_t42020D50 = a0_220;
			goto l2303B5CE;
		}
		a5_30 = a4_29 & 3;
	}
	if (a5_30 == null)
	{
		if (a4_29 != 0x00)
		{
			a4_29 = a5_30->t0004;
			word32 a5_491;
			lwip_htons((word32) *((word32) a4_29 + 2), out a5_491);
		}
		ptr32 mstatus_83;
		Eq_2 s2_87;
		Eq_2 a0_124;
		Eq_2 a4_156;
		Eq_2 a3_155;
		Eq_2 s4_163;
		Eq_2 ra_84 = netbuf_alloc(ra, a0_34, fp + -52, s4, a3_39, a4_29, s4, mstatus, s0, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out s0_232, out a0_124, out a3_155, out a4_156, out s2_87, out s4_163, out mstatus_83);
		if (a0_124 != 0x00)
		{
			Eq_2 a5_110;
			Eq_2 a4_109;
			Eq_2 a2_113;
			if (((word32) **((word32) a0_124 + 4) & 0x00F0) != 64)
			{
				lwip_chksum_copy(a0_124, s2_87, s4_163, out a0_124, out a2_113, out a4_109);
				a5_110.u0 = 0x02;
			}
			else
			{
				word32 a1_494;
				word32 a3_495;
				word32 a6_496;
				word32 a7_497;
				memcpy(a0_124, s2_87, s0_232, out a1_494, out a2_113, out a3_495, out a4_109, out a5_110, out a6_496, out a7_497);
			}
			a3_155 = netconn_send(a0_124, a2_113, a4_109, a5_110, mstatus_83, dwArg28, dwArg68, dwArgA8, out a4_156, out s4_163);
		}
		a2_185 = netbuf_free(ra_84, fp + -52, a3_155, a4_156, s4_163, mstatus_83, dwArgC8, out s2_195, out s3_196, out s4, out s5, out mstatus);
		word32 a5_493;
		word32 a4_492;
		Eq_2 a0_209 = err_to_errno(s3_196, out a4_492, out a5_493);
		if (a0_209 != 0x00)
			g_t42020D50 = a0_209;
		a0_217 = s0_232;
		if (s3_196 != 0x00)
			goto l2303B5CE;
l2303B5EC:
		s0Out = s0_232;
		s1Out = a4;
		a0Out = a0_217;
		a2Out = a2_185;
		a3Out = s2;
		s2Out = s2_195;
		s3Out = s3_196;
		s4Out = s4;
		s5Out = s5;
		s8Out = dwArg0148;
		mstatusOut = mstatus;
		return dwLoc08;
	}
	goto l2303B61C;
}

// 2303B6C8: Register word32 lwip_send(Register Eq_2 a0, Register Eq_189061 a3, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArgA8, Register out Eq_2 a0Out, Register out Eq_189067 a2Out, Register out Eq_189061 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out, Register out Eq_2 mstatusOut)
// Called from:
//      lwip_sendto
//      lwip_write
//      TCP_Server
//      iperf_client_tcp
word32 lwip_send(Eq_2 a0, Eq_189061 a3, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArgA8, union Eq_2 & a0Out, union Eq_189067 & a2Out, union Eq_189061 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out, union Eq_2 & mstatusOut)
{
	Eq_2 a0_103;
	union Eq_189277 * a5_18;
	word32 a4_232;
	if (get_socket(a0, out a4_232, out a5_18) != 0x00)
	{
		Eq_189277 a0_22 = *a5_18;
		if (((word32) *a5_18 & 0x00F0) != 0x10)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg40 = <invalid>;
			Eq_2 stackArg56 = <invalid>;
			Eq_2 stackArg72 = <invalid>;
			Eq_2 stackArg104 = <invalid>;
			Eq_2 stackArg116 = <invalid>;
			Eq_2 stackArg120 = <invalid>;
			Eq_2 stackArg136 = <invalid>;
			Eq_2 stackArg168 = <invalid>;
			Eq_2 stackArg184 = <invalid>;
			Eq_2 stackArg200 = <invalid>;
			Eq_2 stackArg232 = <invalid>;
			word32 s0_244;
			word32 s1_245;
			word32 a2_246;
			word32 mstatus_247;
			lwip_sendto(ra, a1, a1, mstatus, stackArg40, stackArg56, stackArg72, stackArg104, stackArg116, stackArg120, stackArg136, stackArg168, stackArg184, stackArg200, stackArg232, out s0_244, out s1_245, out a0_103, out a2_246, out a3, out s2, out s3, out s4, out s5, out s8, out mstatus_247);
		}
		else
		{
			ui32 a6_27 = 0x03;
			if ((a3 & 16) == 0x00)
				a6_27 = 0x01;
			Eq_2 a0_41 = netconn_write_partly(*a0_22, a6_27 | a3 >> 1 & 0x04, fp + -20, mstatus, dwArg28, dwArg68, dwArgA8, out a3, out s2, out s3, out s4, out s5, out s8);
			word32 a4_248;
			word32 a5_249;
			a0_103 = err_to_errno(a0_41, out a4_248, out a5_249);
			if (a0_103 != 0x00)
				g_t42020D50 = a0_103;
			if (a0_41 != 0x00)
				goto l2303B6E2;
		}
l2303B6E4:
		a0Out = a0_103;
		a2Out = dwArg0100;
		a3Out = a3;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s8Out = s8;
		mstatusOut.u0 = <invalid>;
		return dwArgE4;
	}
	else
	{
l2303B6E2:
		a0_103.u0 = ~0x00;
		goto l2303B6E4;
	}
}

// 2303B73A: Register Eq_2 lwip_socket(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg34, Stack Eq_2 dwArg68, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out)
// Called from:
//      http_test_cmd
//      ota_tcp_cmd
//      tcpc_entry
//      TCP_Server
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      mbedtls_net_connect
Eq_2 lwip_socket(Eq_2 ra, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg34, Eq_2 dwArg68, Eq_2 dwArgA8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, union Eq_2 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out)
{
	Eq_2 a4_100;
	Eq_2 s1_104;
	Eq_2 a4_14;
	Eq_2 a0_15;
	if (a1 != 0x02)
	{
		a4_14.u0 = 0x03;
		if (a1 != 0x03)
		{
			if (a1 != 0x01)
			{
				a4_100.u0 = 22;
				goto l2303B7A8;
			}
			a0_15.u0 = 0x10;
		}
		else
			a0_15.u0 = 64;
	}
	else
	{
		a4_14.u0 = 0x0088;
		a0_15.u0 = 33;
		if (a2 != 0x0088)
			a0_15.u0 = 32;
	}
	Eq_2 a4_51;
	Eq_2 a0_70 = netconn_new_with_proto_and_callback(ra, a0_15, a3, a4_14, mstatus, dwArg34, dwArg68, dwArgA8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, dwArg0138, dwArg0148, out a1, out a3, out a4_51, out s2, out s3, out s5);
	if (a0_70 != 0x00)
	{
		a1.u0 = 0x00;
		Eq_2 a0_73;
		word32 s1_213;
		Eq_2 s0_79 = alloc_socket(a0_70, 0x00, a3, a4_51, mstatus, out s1_213, out a0_73, out a3, out a4_100, out s2, out s3, out s5);
		s1_104 = a0_73;
		if (a0_73 == ~0x00)
		{
			s1_104 = netconn_delete(s0_79);
			g_t42020D50.u0 = 0x17;
			a4_100.u0 = 0x17;
		}
		else
			*((word32) a0_73 + 24) = s0_79;
l2303B7AE:
		a1Out = a1;
		a2Out = dwArg10;
		a3Out = a3;
		a4Out = a4_100;
		s2Out = s2;
		s3Out = s3;
		s5Out = s5;
		return s1_104;
	}
	a4_100.u0 = 0x0069;
l2303B7A8:
	g_t42020D50 = a4_100;
	s1_104.u0 = ~0x00;
	goto l2303B7AE;
}

// 2303B7DE: Register Eq_2 lwip_write(Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg68, Stack Eq_2 dwArgA8, Register out ptr32 a3Out, Register out ptr32 s8Out)
// Called from:
//      http_test_cmd
//      tcpc_entry
//      mbedtls_net_send
Eq_2 lwip_write(Eq_2 a0, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg68, Eq_2 dwArgA8, ptr32 & a3Out, ptr32 & s8Out)
{
	Eq_2 a0_7;
	ptr32 a3_10;
	ptr32 s8_22;
	word32 a2_35;
	word32 s2_36;
	word32 s3_37;
	word32 s4_38;
	word32 s5_39;
	word32 mstatus_40;
	lwip_send(a0, 0x00, mstatus, dwArg28, dwArg68, dwArgA8, out a0_7, out a2_35, out a3_10, out s2_36, out s3_37, out s4_38, out s5_39, out s8_22, out mstatus_40);
	a3Out = a3_10;
	s8Out = s8_22;
	return a0_7;
}

// 2303B7E4: Register word32 lwip_select(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a2Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out Eq_189508 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out)
// Called from:
//      TCP_Server
//      mbedtls_net_recv_timeout
word32 lwip_select(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_2 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a2Out, ptr32 & a3Out, union Eq_2 & a4Out, union Eq_189508 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out)
{
	Eq_2 a4_1008;
	Eq_189508 a5_1010;
	if (a0 > 64)
	{
		a4_1008.u0 = 22;
		goto l2303B80E;
	}
	int32 a0_45;
	struct Eq_189517 * s8_61;
	word32 a3_1121;
	word32 s1_1120;
	word32 s7_1122;
	Eq_2 ra_51 = lwip_selscan(a0, a1, a2, a3, fp + -116, fp + -0x006C, mstatus, dwLoc0C, dwArg0104, out s0, out s1_1120, out a0_45, out a2, out a3_1121, out a4_1008, out a5_1010, out s2, out s3, out s4, out s7_1122, out s8_61);
	if (a0_45 < 0x00)
	{
		a4_1008.u0 = 0x09;
		goto l2303B80E;
	}
	if (a0_45 == 0x00)
	{
		if (s8_61 != null)
		{
			a4_1008 = s8_61->t0004;
			a5_1010 = s8_61->dw0000 | a4_1008;
			if (a5_1010 == 0x00 && s8_61->dw0008 == 0x00)
				goto l2303B9B6;
		}
		Eq_2 a3_83;
		Eq_2 a4_84;
		Eq_2 a5_85;
		word32 a0_98;
		Eq_2 a3_101;
		Eq_2 a4_102;
		word32 a5_1128;
		word32 a2_1126;
		word32 t1_1123;
		word32 a0_1124;
		word32 a1_1125;
		word32 a1_1127;
		Eq_2 s1_105 = sys_sem_new(memset(ra_51, fp + -100, 0x00, 36, out t1_1123, out a0_1124, out a1_1125, out a2_1126, out a3_83, out a4_84, out a5_85), a3_83, a4_84, a5_85, mstatus, dwLoc70, s3, s2, dwArg88, dwArgC8, dwArg0108, out a0_98, out a1_1127, out a2, out a3_101, out a4_102, out a5_1128, out s2, out s3, out s4);
		if (a0_98 != 0x00)
		{
			a4_1008.u0 = 0x0C;
l2303B80E:
			g_t42020D50 = a4_1008;
			a5_1010.u0 = 0x42020000;
			goto l2303B812;
		}
		struct Eq_189615 * s7_114 = &g_t42014B0C;
		struct Eq_189617 * s10_115 = &g_t42014B0C;
		Eq_2 a3_118 = lwip_link_select_cb(fp + -100, a3_101, a4_102, mstatus);
		Eq_2 s0_121 = 0x00;
		while (true)
		{
			word32 s6_216;
			int32 s9_215;
			Eq_2 a3_177;
			Eq_2 a4_181;
			if (s0_121 == a0)
				break;
			Eq_2 a4_132;
			if (s4 != 0x00)
			{
				a4_132 = *((word32) s4 + (s0_121 >> 0x05) * 0x04);
				if ((0x01 << s0_121 & a4_132) == 0x00)
					goto l2303B91C;
				goto l2303B948;
			}
l2303B91C:
			if (s3 != 0x00)
			{
				a4_132 = *((word32) s3 + (s0_121 >> 0x05) * 0x04);
				if ((0x01 << s0_121 & a4_132) == 0x00)
					goto l2303B932;
				goto l2303B948;
			}
l2303B932:
			if (s2 != 0x00)
			{
				a4_132 = *((word32) s2 + (s0_121 >> 0x05) * 0x04);
				if ((0x01 << s0_121 & a4_132) == 0x00)
					goto l2303B9EC;
l2303B948:
				word32 a2_1146;
				word32 a4_1147;
				word32 a5_1148;
				sys_arch_protect(a4_132, mstatus, out a2_1146, out a4_1147, out a5_1148);
				if (s0_121 <= 0x14)
				{
					ui32 a5_189 = (word32) s10_115->b000E + 0x01 & 0x00FF;
					s10_115->b000E = (byte) a5_189;
					if (a5_189 != 0x00)
					{
						word32 a4_1151;
						word32 a5_1152;
						a3_118 = sys_arch_unprotect(a3_118, mstatus, out a4_1151, out a5_1152);
						goto l2303B9EC;
					}
					g_a42014B1A[s0_121] = (struct Eq_363282) ~0x00;
					word32 a5_1154;
					word32 a4_1153;
					a3_177 = sys_arch_unprotect(a3_118, mstatus, out a4_1153, out a5_1154);
					a4_181.u0 = 0x10;
				}
				else
				{
					word32 a5_1150;
					word32 a4_1149;
					a3_177 = sys_arch_unprotect(a3_118, mstatus, out a4_1149, out a5_1150);
					a4_181.u0 = 0x09;
				}
				g_t42020D50 = a4_181;
				s9_215 = ~0x00;
				s6_216 = 0x00;
				goto l2303B97E;
			}
l2303B9EC:
			s0_121 = (word32) s0_121 + 1;
			++s10_115;
		}
		int32 a0_229;
		struct Eq_189632 * s8_245;
		word32 a5_1130;
		word32 a2_1129;
		lwip_selscan(a0, s4, s3, s2, fp + -116, fp + -0x006C, mstatus, dwLoc0C, dwArg0104, out s0_121, out s1_105, out a0_229, out a2_1129, out a3_177, out a4_181, out a5_1130, out s2, out s3, out s4, out s7_114, out s8_245);
		s9_215 = a0_229;
		s6_216 = 0x00;
		if (a0_229 == 0x00)
		{
			Eq_2 a1_255 = 0x00;
			if (s8_245 != null)
			{
				a4_181 = s8_245->dw0008 + 500 ^ 1000;
				a3_177.u0 = 1000;
				a1_255 = (word32) a4_181 + (s8_245->dw0000 + 1000);
				if (a1_255 <= 0x00)
					a1_255.u0 = 0x01;
			}
			word32 a0_272;
			word32 a1_1131;
			word32 a5_1132;
			sys_arch_sem_wait(a1_255, a3_177, a4_181, s2, mstatus, dwLoc7C, dwLoc3C, dwArg04, dwArg78, dwArgB8, out s1_105, out a0_272, out a1_1131, out a3_177, out a4_181, out a5_1132, out s2, out s3, out s4);
			s6_216 = a0_272;
			s0_121 = a0;
		}
l2303B97E:
		while (s1_105 != s0_121)
		{
			if (s4 != 0x00)
			{
				a3_177 = *((word32) s4 + (s1_105 >> 0x05) * 0x04);
				a4_181 = 0x01 << s1_105 & a3_177;
				if (a4_181 == 0x00)
					goto l2303BA14;
				goto l2303BA40;
			}
l2303BA14:
			if (s3 != 0x00)
			{
				a3_177 = *((word32) s3 + (s1_105 >> 0x05) * 0x04);
				a4_181 = 0x01 << s1_105 & a3_177;
				if (a4_181 == 0x00)
					goto l2303BA2A;
				goto l2303BA40;
			}
l2303BA2A:
			if (s2 != 0x00)
			{
				a3_177 = *((word32) s2 + (s1_105 >> 0x05) * 0x04);
				a4_181 = 0x01 << s1_105 & a3_177;
				if (a4_181 != 0x00)
				{
l2303BA40:
					word32 a4_1142;
					word32 a2_1141;
					word32 a5_1143;
					Eq_2 a0_332 = sys_arch_protect(a4_181, mstatus, out a2_1141, out a4_1142, out a5_1143);
					if (s1_105 <= 0x14)
					{
						word32 a4_357 = (word32) s7_114->b000E;
						if (a4_357 != 0x00)
							s7_114->b000E = (byte) (a4_357 + ~0x00);
						word32 a5_1145;
						a3_177 = sys_arch_unprotect(a0_332, mstatus, out a4_181, out a5_1145);
					}
					else
					{
						word32 a5_1144;
						a3_177 = sys_arch_unprotect(a0_332, mstatus, out a4_181, out a5_1144);
						g_t42020D50.u0 = 0x09;
						s9_215 = ~0x00;
					}
				}
			}
			s1_105 = (word32) s1_105 + 1;
			++s7_114;
		}
		word32 a1_1134;
		word32 s1_1133;
		word32 a3_1135;
		s0 = sys_sem_free(fp + -0x0044, lwip_unlink_select_cb(a3_177, a4_181, mstatus), mstatus, dwArgD8, dwArg0118, out s1_1133, out a1_1134, out a2, out a3_1135, out a4_1008, out a5_1010, out s4);
		if (s9_215 < 0x00)
		{
l2303B812:
			goto l2303B814;
		}
		a4_1008.u0 = ~0x00;
		if (s6_216 != ~0x00)
		{
			word32 s1_1136;
			word32 s7_1139;
			word32 a0_1137;
			word32 a3_1138;
			word32 s8_1140;
			lwip_selscan(a0, s4, s3, s2, fp + -116, fp + -0x006C, mstatus, dwLoc0C, dwArg0104, out s0, out s1_1136, out a0_1137, out a2, out a3_1138, out a4_1008, out a5_1010, out s2, out s3, out s4, out s7_1139, out s8_1140);
		}
	}
l2303B9B6:
	if (s4 != 0x00)
	{
		*s4 = a4_1008;
		*((word32) s4 + 4) = a4_1008;
		s0 = dwArg44;
	}
	if (s3 != 0x00)
	{
		*s3 = a4_1008;
		*((word32) s3 + 4) = a4_1008;
		a2 = dwArg44;
	}
	if (s2 != 0x00)
	{
		*s2 = a4_1008;
		*((word32) s2 + 4) = a4_1008;
		s4 = dwArg44;
	}
l2303B814:
	s0Out = s0;
	s1Out = dwArg0118;
	a0Out = dwArg94;
	a2Out = a2;
	a3Out = dwLoc14;
	a4Out = a4_1008;
	a5Out = a5_1010;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	return dwArg0158;
}

// 2303BA70: Register Eq_2 lwip_shutdown(Register Eq_2 a0, Register word32 a1, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg98, Stack Eq_2 dwArgD8, Register out ptr32 a2Out)
// Called from:
//      mbedtls_net_free
Eq_2 lwip_shutdown(Eq_2 a0, word32 a1, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg98, Eq_2 dwArgD8, ptr32 & a2Out)
{
	Eq_2 a0_108;
	word32 a4_203;
	word32 a5_204;
	Eq_2 a0_11 = get_socket(a0, out a4_203, out a5_204);
	if (a0_11 == 0x00)
	{
l2303BA9E:
		a0_108.u0 = ~0x00;
		goto l2303BAE6;
	}
	Eq_2 a4_16;
	Eq_2 a0_14 = *a0_11;
	if (a0_14 == 0x00)
	{
		a4_16.u0 = 0x006B;
		goto l2303BA9A;
	}
	Eq_2 a4_18 = 0x10;
	a2 = dwArg44;
	if (((word32) *a0_14 & 0x00F0) == 0x10)
	{
		if (a1 != 0x00)
		{
			if (a1 != 0x01)
			{
				a4_18.u0 = 0x02;
				a2 = 0x01;
				if (a1 != 0x02)
				{
					a4_16.u0 = 22;
l2303BA9A:
					g_t42020D50 = a4_16;
					goto l2303BA9E;
				}
			}
			else
				a2 = 0x01;
		}
		else
			a2 = 0x00;
		Eq_2 a0_37 = netconn_shutdown(a0_14, a2, a4_18, mstatus, dwArg58, dwArg98, dwArgD8, out a2);
		word32 a5_206;
		word32 a4_205;
		Eq_2 a0_60 = err_to_errno(a0_37, out a4_205, out a5_206);
		if (a0_60 != 0x00)
			g_t42020D50 = a0_60;
		a0_108 = 0x00 - (word32) (a0_37 != 0x00);
l2303BAE6:
		a2Out = a2;
		return a0_108;
	}
	else
	{
		a4_16.u0 = 95;
		goto l2303BA9A;
	}
}

