pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303BAF4: Register Eq_2 lwip_setsockopt(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out Eq_190035 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      tcpc_entry
//      TCP_Server
//      iperf_server
//      iperf_client_tcp
Eq_2 lwip_setsockopt(Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, union Eq_190035 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out)
{
	Eq_2 a0_127;
	Eq_2 a4_19;
	word32 a5_207;
	Eq_2 a0_18 = get_socket(a0, out a4_19, out a5_207);
	0x00 = (uint16) dwArg84;
	Eq_2 s0_150 = a1;
	if (a0_18 != 0x00)
	{
		if (a3 == 0x00)
		{
			g_t42020D50.u0 = 0x0E;
			goto l2303BB12;
		}
		Eq_2 a0_37;
		Eq_2 a4_40;
		s0_150 = tcpip_callback(0x2303ABF2, fp + -44, a3, a4_19, mstatus, dwArg98, dwArgD8, dwArg0118, out s1, out a0_37, out a3, out a4_40, out s2, out s3, out s4, out s6);
		if (a0_37 != 0x00)
		{
			word32 a4_211;
			word32 a5_212;
			a0_127 = err_to_errno(a0_37, out a4_211, out a5_212);
			if (a0_127 == 0x00)
				goto l2303BB12;
		}
		else
		{
			word32 a1_208;
			word32 a4_209;
			word32 a5_210;
			sys_arch_sem_wait(0x00, a3, a4_40, s2, mstatus, a2, dwArg04, a1, dwArgB8, dwArgF8, out s1, out a0_127, out a1_208, out a3, out a4_209, out a5_210, out s2, out s3, out s4);
			s0_150 = dwArg0114;
			if (a0_127 == 0x00)
			{
l2303BB60:
				s1Out = s1;
				a0Out = a0_127;
				a3Out = a3;
				s2Out = s2;
				s3Out = s3;
				s4Out = s4;
				s6Out = s6;
				return s0_150;
			}
		}
		g_t42020D50 = a0_127;
	}
l2303BB12:
	a0_127.u0 = ~0x00;
	goto l2303BB60;
}

// 2303BB68: Register ui32 lwip_fcntl(Register Eq_2 a0, Register ui32 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg44, Register out Eq_190134 a0Out, Register out Eq_2 a3Out)
// Called from:
//      net_would_block.isra.0
//      mbedtls_net_set_block
ui32 lwip_fcntl(Eq_2 a0, ui32 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg44, union Eq_190134 & a0Out, union Eq_2 & a3Out)
{
	Eq_190134 a0_120;
	word32 a5_156;
	word32 a4_155;
	Eq_2 a0_17 = get_socket(a0, out a4_155, out a5_156);
	if (a0_17 == 0x00)
	{
l2303BB9A:
		a0_120.u0 = ~0x00;
		goto l2303BBE8;
	}
	if (a1 != 0x03)
	{
		s0 = a1;
		if (a1 != 0x04)
		{
l2303BB8E:
			g_t42020D50.u0 = 38;
			goto l2303BB9A;
		}
		a0_120 = dwArg44 & -8;
		if ((dwArg44 & -8) != 0x00)
			goto l2303BB8E;
		ui32 a5_62;
		struct Eq_190176 * a4_59 = *a0_17;
		ui32 a5_61 = (word32) a4_59->b0024;
		if ((dwArg44 & 0x01) != 0x00)
			a5_62 = a5_61 | 2;
		else
			a5_62 = a5_61 & ~0x02;
		a4_59->b0024 = (byte) a5_62;
	}
	else
	{
		s0 = 0x06;
		ui32 s1_30 = (word32) *(union Eq_2 *) 0x27 >> 1 & 1;
		if (((word32) *(union Eq_2 *) 0x03 & 0x00F0) == 0x10)
		{
			word32 a4_158;
			word32 a5_159;
			word32 a2_157;
			sys_arch_protect(0x10, mstatus, out a2_157, out a4_158, out a5_159);
			s0 = 0x00;
			struct Eq_190204 * a5_38 = *((word32) *a0_17 + 4);
			if (a5_38 != null)
			{
				ui32 a5_39 = (word32) a5_38->w001A;
				ui32 s0_41 = (word32) ((a5_39 & 16) < 1);
				s0 = s0_41 << 1;
				if ((a5_39 & 32) == 0x00)
					s0 = s0_41 << 1 | 4;
			}
			word32 a5_161;
			word32 a4_160;
			a3 = sys_arch_unprotect(a3, mstatus, out a4_160, out a5_161);
		}
		a0_120 = s0 | s1_30;
	}
l2303BBE8:
	a0Out = a0_120;
	a3Out = a3;
	return s0;
}

// 2303BC14: void tcpip_thread(Register word32 ra, Register Eq_2 s0, Register word32 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register word32 s2, Register word32 s3, Register word32 s4, Register word32 s5, Register ptr32 mstatus)
void tcpip_thread(word32 ra, Eq_2 s0, word32 s1, Eq_2 a1, Eq_2 a3, Eq_2 a4, word32 s2, word32 s3, word32 s4, word32 s5, ptr32 mstatus)
{
	<anonymous> * a5_106 = g_ptr4200DEEC;
	struct Eq_190257 * sp_164 = fp + -48;
	if (a5_106 != null)
		a5_106();
	Eq_2 s2_111 = ~0x00;
	word32 s3_112 = 0x4200E000;
	Eq_2 s1_110 = 587751780;
	do
	{
		word32 s4_113;
		Eq_2 a0_42 = sys_timeouts_sleeptime(a5_106);
		if (a0_42 == s2_111)
		{
			word32 a0_203;
			s0 = sys_arch_mbox_fetch(s3_112 + -268, (char *) sp_164 + 0x0C, 0x00, a3, a4, mstatus, sp_164->t0064, sp_164->t00D8, sp_164->t0118, out s1_110, out a0_203, out a1, out a3, out a4, out a5_106, out s2_111, out s3_112, out s4_113);
			goto l2303BC5E;
		}
		if (a0_42 == 0x00)
		{
l2303BC74:
			s0 = sys_check_timeouts(ra, s0, s1_110, a1, mstatus, out a1, out a3, out a4, out a5_106, out s2_111, out s3_112);
			continue;
		}
		Eq_2 a0_55;
		s0 = sys_arch_mbox_fetch(s3_112 + -268, (char *) sp_164 + 0x0C, a0_42, a3, a4, mstatus, sp_164->t0064, sp_164->t00D8, sp_164->t0118, out s1_110, out a0_55, out a1, out a3, out a4, out a5_106, out s2_111, out s3_112, out s4_113);
		if (a0_55 == s2_111)
			goto l2303BC74;
l2303BC5E:
		if (s0 == 0x00)
			continue;
		a5_106 = (word32) *s0;
	} while (a5_106 > (<anonymous> *) 0x04);
	<anonymous> * a5_132 = *((word32) s1_110 + a5_106 * 0x04);
	word32 a4_146;
	word32 a1_149;
	word32 mstatus_150;
	word32 a3_151;
	a5_132();
}

// 2303BCCE: void tcpip_inpkt(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack (ptr32 Eq_190376) dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
// Called from:
//      tcpip_input
void tcpip_inpkt(Eq_2 ra, word32 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, struct Eq_190376 * dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	sys_mbox_valid(1107353332);
	struct Eq_190388 * a0_25;
	Eq_2 a3_28;
	Eq_2 a4_29;
	word32 a2_212;
	word32 a5_213;
	Eq_2 s1_30 = memp_malloc(0x4200E000, 0x09, a3, a4, mstatus, out a0_25, out a2_212, out a3_28, out a4_29, out a5_213);
	if (a0_25 != null)
	{
		*((word32) a1 + 8) = a0_25;
		a0_25->b0000 = 0x02;
		a0_25->dw0004 = a0;
		dwArg44->ptr000C = a0_25;
		word32 a0_42;
		Eq_2 a3_45;
		word32 s1_233;
		word32 a1_234;
		word32 a4_235;
		word32 a5_236;
		word32 a7_237;
		word32 s2_238;
		word32 s3_239;
		word32 s4_240;
		word32 s5_241;
		word32 s6_242;
		Eq_2 s0_50 = sys_mbox_trypost((word32) s1_30 - 268, a4_29, 0x02, mstatus, a2, a1, dwArgD8, dwArg0118, dwArg0158, out s1_233, out a0_42, out a1_234, out a3_45, out a4_235, out a5_236, out a7_237, out s2_238, out s3_239, out s4_240, out s5_241, out s6_242);
		if (a0_42 == 0x00)
			return;
		Eq_2 a3_72;
		Eq_2 a4_73;
		word32 s1_243;
		word32 a0_244;
		word32 a1_245;
		word32 a2_246;
		word32 a5_247;
		word32 a7_248;
		word32 s2_249;
		word32 s3_250;
		word32 s4_251;
		word32 s5_252;
		word32 s6_253;
		word32 s7_254;
		word32 s8_255;
		word32 s9_256;
		word32 s10_257;
		word32 s11_258;
		word32 t4_259;
		printf(ra, &g_t23086194, a3_45, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_243, out a0_244, out a1_245, out a2_246, out a3_72, out a4_73, out a5_247, out a7_248, out s2_249, out s3_250, out s4_251, out s5_252, out s6_253, out s7_254, out s8_255, out s9_256, out s10_257, out s11_258, out t4_259);
		word32 a0_260;
		word32 a2_261;
		word32 a3_262;
		word32 a4_263;
		word32 a5_264;
		memp_free(0x09, s0_50, a3_72, a4_73, mstatus, out a0_260, out a2_261, out a3_262, out a4_263, out a5_264);
	}
	else
	{
		word32 s1_214;
		word32 a0_215;
		word32 a1_216;
		word32 a2_217;
		word32 a3_218;
		word32 a4_219;
		word32 a5_220;
		word32 a7_221;
		word32 s2_222;
		word32 s3_223;
		word32 s4_224;
		word32 s5_225;
		word32 s6_226;
		word32 s7_227;
		word32 s8_228;
		word32 s9_229;
		word32 s10_230;
		word32 s11_231;
		word32 t4_232;
		printf(ra, &g_t23086180, a3_28, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_214, out a0_215, out a1_216, out a2_217, out a3_218, out a4_219, out a5_220, out a7_221, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_230, out s11_231, out t4_232);
	}
}

// 2303BD42: void tcpip_input(Register Eq_2 ra, Register word32 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack (ptr32 Eq_190376) dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void tcpip_input(Eq_2 ra, word32 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, struct Eq_190376 * dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	Eq_2 a2_10;
	if (((word32) *((word32) a1 + 65) & 0x18) != 0x00)
		a2_10.u0 = 587487958;
	else
		a2_10.u0 = 0x2303F4C0;
	tcpip_inpkt(ra, a0, a1, a2_10, a3, a4, s2, mstatus, dwArg08, dwArg44, dwArg50, dwArg54, dwArg78, dwArg9C, dwArgD8, dwArg0118, dwArg0158);
}

