pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303BD60: Register word32 tcpip_callback(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out)
// Called from:
//      lwip_setsockopt
//      cmd_netstat
//      cmd_sntp_start
word32 tcpip_callback(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out)
{
	ptr32 a0_28;
	sys_mbox_valid(1107353332);
	word32 s0_44 = 0x4200E000;
	Eq_2 a0_21;
	word32 a2_119;
	word32 a5_120;
	ptr32 a3_24;
	Eq_2 a4_25;
	Eq_2 s1_26 = memp_malloc(a0, 0x08, a3, a4, mstatus, out a0_21, out a2_119, out a3_24, out a4_25, out a5_120);
	if (a0_21 != 0x00)
	{
		a0_21->u1 = 0x03;
		*((word32) a1 + 8) = a0_21;
		*((word32) s1_26 + 4) = a0_21;
		word32 s5_121;
		s0_44 = sys_mbox_post(1107353332, a4_25, 0x03, mstatus, dwLoc1C, a1, dwArgD8, dwArg0118, dwArg0158, out s1_26, out a3_24, out a4_25, out s2, out s3, out s5_121, out s6);
		a0_28 = 0x00;
	}
	else
		a0_28 = ~0x00;
	s1Out = s1_26;
	a0Out = a0_28;
	a3Out = a3_24;
	a4Out = a4_25;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s6Out = s6;
	return s0_44;
}

// 2303BDA6: Register Eq_2 tcpip_try_callback(Register Eq_190630 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_190643 a5Out, Register out ptr32 a7Out, Register out Eq_190630 s2Out, Register out ptr32 s3Out, Register out Eq_190647 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      pbuf_alloc
Eq_2 tcpip_try_callback(Eq_190630 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_190643 & a5Out, ptr32 & a7Out, union Eq_190630 & s2Out, ptr32 & s3Out, union Eq_190647 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_101;
	sys_mbox_valid(1107353332);
	Eq_190630 s2_10 = a0;
	struct Eq_190655 * a0_23;
	word32 a2_159;
	Eq_2 a3_106;
	Eq_2 a4_108;
	Eq_190643 a5_110;
	Eq_2 s1_117 = memp_malloc(0x4200E000, 0x08, a3, a4, mstatus, out a0_23, out a2_159, out a3_106, out a4_108, out a5_110);
	if (a0_23 != null)
	{
		*((word32) a1 + 8) = a0_23;
		a0_23->b0000 = 0x03;
		a0_23->t0004 = a0;
		word32 s4_160;
		s0 = sys_mbox_trypost((word32) s1_117 - 268, a4_108, 0x03, mstatus, dwLoc1C, a1, dwArgD8, dwArg0118, dwArg0158, out s1_117, out a0_101, out a1, out a3_106, out a4_108, out a5_110, out a7, out s2_10, out s3, out s4_160, out s5, out s6);
		if (a0_101 == 0x00)
		{
l2303BDEE:
			s1Out = s1_117;
			a0Out = a0_101;
			a1Out = a1;
			a3Out = a3_106;
			a4Out = a4_108;
			a5Out = a5_110;
			a7Out = a7;
			s2Out = s2_10;
			s3Out = s3;
			s4Out = dwArg04;
			s5Out = s5;
			s6Out = s6;
			return s0;
		}
		a1 = s0;
		word32 a0_161;
		word32 a2_162;
		s1_117 = memp_free(0x08, s0, a3_106, a4_108, mstatus, out a0_161, out a2_162, out a3_106, out a4_108, out a5_110);
	}
	a0_101 = ~0x00;
	goto l2303BDEE;
}

// 2303BDFA: Register word32 tcpip_send_msg_wait_sem(Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      netconn_apimsg
//      netconn_gethostbyname
word32 tcpip_send_msg_wait_sem(Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArgC8, Eq_2 dwArg0108, Eq_2 dwArg0148, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	sys_sem_valid(a2);
	sys_mbox_valid(1107353332);
	Eq_2 a3_33;
	Eq_2 a4_34;
	Eq_2 s2_40;
	ptr32 s5_43;
	ptr32 s6_44;
	word32 s1_103;
	word32 s3_104;
	sys_mbox_post(1107353332, a4, a5, mstatus, a2, a1, dwArgC8, dwArg0108, dwArg0148, out s1_103, out a3_33, out a4_34, out s2_40, out s3_104, out s5_43, out s6_44);
	ptr32 a1_57;
	ptr32 a3_59;
	ptr32 a4_60;
	ptr32 a5_61;
	ptr32 s1_64;
	ptr32 s2_65;
	ptr32 s3_66;
	ptr32 s4_67;
	word32 a0_105;
	sys_arch_sem_wait(0x00, a3_33, a4_34, s2_40, mstatus, a2, dwArg14, a1, dwArgC8, dwArg0108, out s1_64, out a0_105, out a1_57, out a3_59, out a4_60, out a5_61, out s2_65, out s3_66, out s4_67);
	s1Out = s1_64;
	a0Out = 0x00;
	a1Out = a1_57;
	a3Out = a3_59;
	a4Out = a4_60;
	a5Out = a5_61;
	s2Out = s2_65;
	s3Out = s3_66;
	s4Out = s4_67;
	s5Out = s5_43;
	s6Out = s6_44;
	return dwArgE4;
}

// 2303BE44: Register Eq_2 tcpip_api_call(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      netifapi_netif_add
//      netifapi_netif_set_addr
//      netifapi_netif_common
Eq_2 tcpip_api_call(Eq_2 ra, Eq_2 s0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, union Eq_2 & s1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	word32 a0_25;
	word32 a1_170;
	word32 a2_171;
	word32 s4_172;
	ptr32 a5_141;
	Eq_2 a4_140;
	ptr32 a3_139;
	ptr32 s2_146;
	ptr32 s3_147;
	Eq_2 s1_145 = sys_sem_new(ra, a3, a4, a5, mstatus, s2, s0, ra, dwArgD8, dwArg0118, dwArg0158, out a0_25, out a1_170, out a2_171, out a3_139, out a4_140, out a5_141, out s2_146, out s3_147, out s4_172);
	if (a0_25 == 0x00)
	{
		sys_mbox_valid(1107353332);
		Eq_2 a3_52;
		Eq_2 a4_53;
		Eq_2 s2_59;
		word32 s1_173;
		word32 s3_174;
		word32 s5_175;
		word32 s6_176;
		sys_mbox_post(1107353332, a4_140, 0x01, mstatus, a1, s1_145, dwArgC8, dwArg0108, dwArg0148, out s1_173, out a3_52, out a4_53, out s2_59, out s3_174, out s5_175, out s6_176);
		Eq_2 a3_77;
		union Eq_2 * s1_82;
		word32 a0_177;
		word32 a1_178;
		word32 a4_179;
		word32 a5_180;
		word32 s4_181;
		sys_arch_sem_wait(0x00, a3_52, a4_53, s2_59, mstatus, a1, dwArg14, s1_145, dwArgC8, dwArg0108, out s1_82, out a0_177, out a1_178, out a3_77, out a4_179, out a5_180, out s2_146, out s3_147, out s4_181);
		word32 a1_182;
		word32 a2_183;
		word32 s4_184;
		sys_sem_free(s1_82, a3_77, mstatus, dwArg0128, dwArg0168, out s1_145, out a1_182, out a2_183, out a3_139, out a4_140, out a5_141, out s4_184);
	}
	0x00 = (uint16) dwArg0128;
	s1Out = s1_145;
	a3Out = a3_139;
	a4Out = a4_140;
	a5Out = a5_141;
	s2Out = s2_146;
	s3Out = s3_147;
	return dwArgE4;
}

// 2303BEA4: Register Eq_2 tcpip_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 a6Out)
// Called from:
//      bfl_main
Eq_2 tcpip_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & a6Out)
{
	word32 a0_11;
	word32 a1_12;
	Eq_2 a3_14;
	Eq_2 a4_15;
	Eq_2 ra_19 = lwip_init(ra, mstatus, dwLoc08, dwArg14, dwArg18, dwArg40, dwArg68, dwArg8C, dwArgC8, dwArg0108, dwArg0148, out a0_11, out a1_12, out a3_14, out a4_15);
	g_dw4200EEEC = a0_11;
	g_dw4200EEF0 = a1_12;
	Eq_2 s3_57;
	word32 a0_115;
	word32 a2_116;
	word32 a3_117;
	word32 a4_118;
	word32 a5_119;
	word32 s2_120;
	word32 s4_121;
	Eq_2 s1_55 = sys_mbox_new(ra_19, a3_14, a4_15, 0x4200E000, mstatus, dwLoc10, dwLoc0C, dwArgE8, dwArg0128, out a0_115, out a2_116, out a3_117, out a4_118, out a5_119, out s2_120, out s3_57, out s4_121);
	ptr32 a6_78;
	Eq_2 ra_80 = sys_thread_new(ra_19, s1_55, 0x00, 0x00FFFFA0, 0x1E, s3_57, mstatus, dwArgD8, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out a6_78);
	a6Out = a6_78;
	return ra_80;
}

// 2303BEF6: Register Eq_2 altcp_alloc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      altcp_tcp_accept
//      altcp_tcp_new_ip_type
Eq_2 altcp_alloc(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & s1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out)
{
	Eq_2 a0_13;
	word32 a2_60;
	word32 a5_61;
	ptr32 a3_16;
	ptr32 a4_17;
	Eq_2 s1_18 = memp_malloc(s1, 0x05, a3, a4, mstatus, out a0_13, out a2_60, out a3_16, out a4_17, out a5_61);
	if (a0_13 != 0x00)
	{
		word32 t1_62;
		word32 a0_63;
		word32 a1_64;
		word32 a2_65;
		word32 a5_66;
		ra = memset(ra, a0_13, 0x00, 44, out t1_62, out a0_63, out a1_64, out a2_65, out a3_16, out a4_17, out a5_66);
	}
	s1Out = s1_18;
	a2Out = dwArg10;
	a3Out = a3_16;
	a4Out = a4_17;
	return ra;
}

// 2303BF1A: void altcp_free(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_190973) a5, Register ptr32 mstatus)
// Called from:
//      altcp_tcp_err
//      altcp_tcp_close
void altcp_free(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, struct Eq_190973 * a5, ptr32 mstatus)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_6 = a5->t0000;
	Eq_2 a1_17 = a0_6;
	if (a5 != null)
	{
		<anonymous> * a5_8 = a5->ptr0044;
		if (a5_8 != null)
		{
			struct Eq_190990 * sp_14;
			word32 tp_50;
			word32 s1_49;
			a5_8();
			word32 a2_21 = sp_14->dw0064;
			word32 t3_22 = sp_14->dw0020;
l2303BF36:
			word32 a4_77;
			word32 a3_76;
			word32 a2_75;
			word32 a0_74;
			word32 a5_78;
			memp_free(0x05, a1_17, a3, a4, mstatus, out a0_74, out a2_75, out a3_76, out a4_77, out a5_78);
			return;
		}
	}
	goto l2303BF36;
}

// 2303BF40: Register Eq_2 altcp_new_ip_type(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_183176) a0, Register word32 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      altcp_new
Eq_2 altcp_new_ip_type(Eq_2 ra, Eq_2 s1, struct Eq_183176 * a0, word32 a1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	if (a0 != null)
	{
		<anonymous> * t1_8 = a0->ptr0000;
		if (t1_8 == null)
		{
			s1Out = s1;
			a0Out = 0x00;
			a3Out = a3;
			a4Out = a4;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s9Out = s9;
			s10Out = s10;
			mstatusOut = mstatus;
			return ra;
		}
		else
		{
			ptr32 a0_12;
			Eq_2 ra_52;
			Eq_2 s1_53;
			Eq_2 s3_54;
			ptr32 mstatus_55;
			Eq_2 a4_56;
			Eq_2 a3_57;
			Eq_2 s4_58;
			word32 a2_60;
			word32 a6_61;
			word32 a7_62;
			ptr32 s10_63;
			word32 s11_64;
			ptr32 s2_65;
			word32 s5_66;
			word32 s6_67;
			word32 s8_68;
			ptr32 s9_69;
			word32 t0_70;
			word32 t3_71;
			word32 t4_72;
			word32 t5_73;
			word32 t6_74;
			word32 tp_75;
			t1_8();
			s1Out = s1_53;
			a0Out = a0_12;
			a3Out = a3_57;
			a4Out = a4_56;
			s2Out = s2_65;
			s3Out = s3_54;
			s4Out = s4_58;
			s9Out = s9_69;
			s10Out = s10_63;
			mstatusOut = mstatus_55;
			return ra_52;
		}
	}
	else
	{
		altcp_tcp_new_ip_type(ra, s1, a3, a4, s3, s4, s7, mstatus, dwArg00, dwArg08, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgEC, dwArgF8, dwArg0108);
		s1Out = s1_34;
		a0Out = a0_24;
		a3Out = a3_27;
		a4Out = a4_28;
		s2Out = s2_37;
		s3Out = s3_38;
		s4Out = s4_39;
		s9Out = s9_44;
		s10Out = s10_35;
		mstatusOut = mstatus_32;
		return ra_33;
	}
}

// 2303BF58: Register Eq_2 altcp_new(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_183176) a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 mstatusOut)
// Called from:
//      httpc_init_connection_common.constprop.5
Eq_2 altcp_new(Eq_2 ra, Eq_2 s1, struct Eq_183176 * a0, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0108, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & mstatusOut)
{
	ptr32 a0_14;
	ptr32 a3_19;
	ptr32 a4_20;
	ptr32 mstatus_23;
	ptr32 s1_25;
	ptr32 s10_26;
	ptr32 s2_28;
	ptr32 s3_29;
	ptr32 s4_30;
	ptr32 s9_35;
	Eq_2 ra_24 = altcp_new_ip_type(ra, s1, a0, 0x00, a3, a4, s3, s4, s7, mstatus, dwArg00, dwArg08, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgEC, dwArgF8, dwArg0108, out s1_25, out a0_14, out a3_19, out a4_20, out s2_28, out s3_29, out s4_30, out s9_35, out s10_26, out mstatus_23);
	s1Out = s1_25;
	a0Out = a0_14;
	a3Out = a3_19;
	a4Out = a4_20;
	s2Out = s2_28;
	s3Out = s3_29;
	s4Out = s4_30;
	s9Out = s9_35;
	s10Out = s10_26;
	mstatusOut = mstatus_23;
	return ra_24;
}

// 2303BF5E: void altcp_arg(Register (ptr32 Eq_456) a0, Register Eq_2 a1)
// Called from:
//      httpc_free_state
//      httpc_init_connection_common.constprop.5
void altcp_arg(struct Eq_456 * a0, Eq_2 a1)
{
	if (a0 != null)
		*((word32) a1 + 8) = a0;
}

// 2303BF64: void altcp_recv(Register (ptr32 Eq_456) a0, Register (ptr32 Eq_181813) a1)
// Called from:
//      httpc_free_state
//      httpc_init_connection_common.constprop.5
void altcp_recv(struct Eq_456 * a0, struct Eq_181813 * a1)
{
	if (a0 != null)
		a1->ptr0018 = a0;
}

// 2303BF6A: void altcp_sent(Register (ptr32 Eq_456) a0, Register (ptr32 Eq_181837) a1)
// Called from:
//      httpc_free_state
//      httpc_init_connection_common.constprop.5
void altcp_sent(struct Eq_456 * a0, struct Eq_181837 * a1)
{
	if (a0 != null)
		a1->ptr001C = a0;
}

