pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303BF70: Register (ptr32 Eq_456) altcp_poll(Register (ptr32 Eq_456) a0, Register (ptr32 Eq_181826) a1, Register word32 a2, Register (ptr32 (ptr32 Eq_456)) a5, Register out (ptr32 (ptr32 Eq_456)) a5Out)
// Called from:
//      httpc_free_state
//      httpc_init_connection_common.constprop.5
struct Eq_456 * altcp_poll(struct Eq_456 * a0, struct Eq_181826 * a1, word32 a2, struct Eq_456 ** a5, struct Eq_456 & a5Out)
{
	if (a0 != null)
	{
		a0 = (struct Eq_456 *) *a5;
		a1->ptr0020 = a0;
		a0->b0028 = (byte) a2;
		if (a5 != null)
		{
			struct Eq_456 * t1_11 = *a5;
			if (t1_11 != null)
			{
				struct Eq_456 * a0_14;
				struct Eq_456 ** a5_15;
				word32 t1_18;
				t1_11();
				a5Out = a5_15;
				return a0_14;
			}
		}
	}
	a5Out = a5;
	return a0;
}

// 2303BF8A: void altcp_err(Register (ptr32 Eq_456) a0, Register (ptr32 Eq_181819) a1)
// Called from:
//      httpc_free_state
//      httpc_init_connection_common.constprop.5
void altcp_err(struct Eq_456 * a0, struct Eq_181819 * a1)
{
	if (a0 != null)
		a1->ptr0024 = a0;
}

// 2303BF90: Register Eq_2 altcp_recved(Register Eq_2 a0, Register (ptr32 Eq_415) a5, Register out (ptr32 Eq_415) a5Out)
// Called from:
//      cb_altcp_recv_fn
//      httpc_tcp_recv
Eq_2 altcp_recved(Eq_2 a0, struct Eq_415 * a5, struct Eq_415 & a5Out)
{
	if (a0 != 0x00)
	{
		a0 = a5->t0000;
		if (a5 != null)
		{
			<anonymous> * t1_7 = a5->ptr0004;
			if (t1_7 != null)
			{
				Eq_2 a0_9;
				struct Eq_415 * a5_10;
				word32 t1_11;
				t1_7();
				a5Out = a5_10;
				return a0_9;
			}
		}
	}
	a5Out = a5;
	return a0;
}

// 2303BFA2: Register word32 altcp_connect(Register word32 a0, Register (ptr32 Eq_181640) a5, Register out (ptr32 Eq_181640) a5Out)
// Called from:
//      httpc_get_internal_addr
word32 altcp_connect(word32 a0, struct Eq_181640 * a5, struct Eq_181640 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * t1_7 = a5->ptr000C;
			if (t1_7 != null)
			{
				word32 a0_10;
				struct Eq_181640 * a5_11;
				word32 t1_12;
				t1_7();
				a5Out = a5_11;
				return a0_10;
			}
		}
	}
	a5Out = a5;
	return ~0x05;
}

// 2303BFB6: void altcp_abort(Register (ptr32 Eq_456) a0, Register (ptr32 Eq_181840) a5)
// Called from:
//      httpc_free_state
void altcp_abort(struct Eq_456 * a0, struct Eq_181840 * a5)
{
	if (a0 == null)
		return;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return;
	<anonymous> * t1_7 = a5->ptr0014;
	if (t1_7 == null)
		return;
	word32 t1_11;
	t1_7();
}

// 2303BFC8: Register (ptr32 Eq_456) altcp_close(Register (ptr32 Eq_456) a0, Register (ptr32 Eq_181822) a5, Register out (ptr32 Eq_181822) a5Out)
// Called from:
//      httpc_free_state
struct Eq_456 * altcp_close(struct Eq_456 * a0, struct Eq_181822 * a5, struct Eq_181822 & a5Out)
{
	if (a0 != null)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * t1_7 = a5->ptr0018;
			if (t1_7 != null)
			{
				struct Eq_456 * a0_10;
				struct Eq_181822 * a5_11;
				word32 t1_12;
				t1_7();
				a5Out = a5_11;
				return a0_10;
			}
		}
	}
	a5Out = a5;
	return (struct Eq_456 *) ~0x05;
}

// 2303BFDC: Register word32 altcp_write(Register word32 a0, Register (ptr32 Eq_182673) a5, Register out (ptr32 Eq_182673) a5Out)
// Called from:
//      httpc_tcp_connected
word32 altcp_write(word32 a0, struct Eq_182673 * a5, struct Eq_182673 & a5Out)
{
	if (a0 != 0x00)
	{
		word32 a0_6 = a5->dw0000;
		if (a5 != null)
		{
			<anonymous> * t1_7 = a5->ptr0020;
			if (t1_7 != null)
			{
				word32 a0_10;
				struct Eq_182673 * a5_11;
				word32 t1_12;
				t1_7();
				a5Out = a5_11;
				return a0_10;
			}
		}
	}
	a5Out = a5;
	return ~0x05;
}

// 2303BFF0: void altcp_output(Register (ptr32 (ptr32 Eq_182723)) a0, Register (ptr32 Eq_182686) a5)
// Called from:
//      httpc_tcp_connected
void altcp_output(struct Eq_182723 ** a0, struct Eq_182686 * a5)
{
	if (a0 == null)
		return;
	word32 a0_6 = a5->dw0000;
	if (a5 == null)
		return;
	<anonymous> * t1_7 = a5->ptr0024;
	if (t1_7 == null)
		return;
	word32 t1_12;
	t1_7();
}

// 2303C004: void altcp_tcp_connected(Register (ptr32 Eq_191312) a0)
void altcp_tcp_connected(struct Eq_191312 * a0)
{
	if (a0 == null)
		return;
	<anonymous> * t1_6 = a0->ptr0014;
	if (t1_6 == null)
		return;
	word32 t1_12;
	t1_6();
}

// 2303C018: void altcp_tcp_sent(Register (ptr32 Eq_191322) a0)
void altcp_tcp_sent(struct Eq_191322 * a0)
{
	if (a0 == null)
		return;
	<anonymous> * t1_6 = a0->ptr001C;
	if (t1_6 == null)
		return;
	word32 t1_12;
	t1_6();
}

// 2303C02C: void altcp_tcp_poll(Register (ptr32 Eq_191332) a0)
void altcp_tcp_poll(struct Eq_191332 * a0)
{
	if (a0 == null)
		return;
	<anonymous> * t1_6 = a0->ptr0020;
	if (t1_6 == null)
		return;
	word32 t1_12;
	t1_6();
}

// 2303C040: void altcp_tcp_mss(Register word32 a0)
void altcp_tcp_mss(word32 a0)
{
	if (a0 == 0x00)
		;
}

// 2303C04E: void altcp_tcp_sndbuf(Register word32 a0)
void altcp_tcp_sndbuf(word32 a0)
{
	if (a0 == 0x00)
		;
}

// 2303C05C: void altcp_tcp_sndqueuelen(Register word32 a0)
void altcp_tcp_sndqueuelen(word32 a0)
{
	if (a0 == 0x00)
		;
}

// 2303C06A: void altcp_tcp_nagle_disable(Register word32 a0, Register (ptr32 Eq_191352) a5)
void altcp_tcp_nagle_disable(word32 a0, struct Eq_191352 * a5)
{
	if (a0 != 0x00 && a5 != null)
		a5->w001A = (word16) ((word32) a5->w001A | 64);
}

// 2303C07E: void altcp_tcp_nagle_enable(Register word32 a0, Register (ptr32 Eq_191368) a5)
void altcp_tcp_nagle_enable(word32 a0, struct Eq_191368 * a5)
{
	if (a0 != 0x00 && a5 != null)
		a5->w001A = (word16) ((word32) a5->w001A & -65);
}

// 2303C092: void altcp_tcp_nagle_disabled(Register word32 a0, Register word32 a5)
void altcp_tcp_nagle_disabled(word32 a0, word32 a5)
{
	if (a0 == 0x00 || a5 == 0x00)
		;
}

// 2303C0A8: void altcp_tcp_dealloc()
void altcp_tcp_dealloc()
{
}

// 2303C0AA: void altcp_tcp_get_ip(Register (ptr32 Eq_191389) a0, Register word32 a1)
void altcp_tcp_get_ip(struct Eq_191389 * a0, word32 a1)
{
	if (a0 != null)
		a0->dw000C == 0x00;
}

// 2303C0B6: void altcp_tcp_get_port(Register word32 a0, Register word32 a1, Register word32 a5)
void altcp_tcp_get_port(word32 a0, word32 a1, word32 a5)
{
	if (a0 == 0x00 || a5 == 0x00)
		return;
	if (a1 == 0x00)
		;
}

// 2303C0D0: Register Eq_2 altcp_tcp_setup_callbacks(Register Eq_2 a0, Register Eq_2 a1)
// Called from:
//      altcp_tcp_close
//      altcp_tcp_accept
//      altcp_tcp_new_ip_type
Eq_2 altcp_tcp_setup_callbacks(Eq_2 a0, Eq_2 a1)
{
	tcp_arg(a1, a0);
	tcp_recv(a1, 587448918);
	tcp_sent(a1, 587448344);
	tcp_err(a1, 0x2303C110);
	return a1;
}

// 2303C110: void altcp_tcp_err(Register Eq_2 ra, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_190973) a5, Register ptr32 mstatus)
void altcp_tcp_err(Eq_2 ra, word32 a0, Eq_2 a3, Eq_2 a4, struct Eq_190973 * a5, ptr32 mstatus)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_10 = a5->t0024;
	*((word32) a0_10 + 0x0C) = 0x00;
	Eq_2 s0_12 = a0_10;
	if (a5 != null)
	{
		word32 a2_19;
		word32 a1_48;
		word32 s1_49;
		word32 tp_50;
		a5();
	}
	altcp_free(ra, s0_12, a3, a4, a5, mstatus);
}

// 2303C134: void altcp_tcp_get_tcp_addrinfo(Register (ptr32 Eq_191460) a0, Register word32 a1, Register (ptr32 Eq_191462) a2, Register (ptr32 word16) a3, Register (ptr32 Eq_191464) a5)
void altcp_tcp_get_tcp_addrinfo(struct Eq_191460 * a0, word32 a1, struct Eq_191462 * a2, word16 * a3, struct Eq_191464 * a5)
{
	if (a0 == null)
		return;
	struct Eq_191462 * a0_6 = a0->ptr000C;
	tcp_tcp_get_tcp_addrinfo(a0_6, a1, a2, a3, a5);
}

