pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303C140: void altcp_tcp_setprio(Register (ptr32 Eq_191479) a0, Register word32 a1)
void altcp_tcp_setprio(struct Eq_191479 * a0, word32 a1)
{
	if (a0 == null)
		return;
	struct Eq_191483 * a0_5 = a0->ptr000C;
	tcp_setprio(a0_5, a1);
}

// 2303C14A: void altcp_tcp_output(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_191494) a0, Register Eq_2 a2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118)
void altcp_tcp_output(Eq_2 ra, Eq_2 s1, struct Eq_191494 * a0, Eq_2 a2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118)
{
	if (a0 == null)
		return;
	Eq_2 a0_6 = a0->t000C;
	word32 s0_108;
	word32 s1_109;
	word32 a0_110;
	word32 a2_111;
	word32 a3_112;
	word32 a4_113;
	word32 a5_114;
	word32 s2_115;
	word32 s3_116;
	word32 s4_117;
	word32 s5_118;
	word32 s6_119;
	word32 s7_120;
	word32 s8_121;
	word32 s9_122;
	word32 s10_123;
	word32 s11_124;
	word32 mstatus_125;
	tcp_output(ra, s1, a0_6, a2, s7, mstatus, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg010C, dwArg0118, out s0_108, out s1_109, out a0_110, out a2_111, out a3_112, out a4_113, out a5_114, out s2_115, out s3_116, out s4_117, out s5_118, out s6_119, out s7_120, out s8_121, out s9_122, out s10_123, out s11_124, out mstatus_125);
}

// 2303C156: void altcp_tcp_write(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_191597) a0, Register Eq_2 a1, Register Eq_2 a2, Register ui32 a3, Register ptr32 mstatus, Stack word32 dwArg04, Stack Eq_2 dwArg19, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8)
void altcp_tcp_write(Eq_2 ra, Eq_2 s1, struct Eq_191597 * a0, Eq_2 a1, Eq_2 a2, ui32 a3, ptr32 mstatus, word32 dwArg04, Eq_2 dwArg19, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8)
{
	if (a0 == null)
		return;
	Eq_2 a0_6 = a0->t000C;
	word32 a0_104;
	word32 a1_105;
	word32 a2_106;
	word32 a3_107;
	word32 a5_108;
	word32 s2_109;
	word32 s3_110;
	word32 s4_111;
	word32 s5_112;
	word32 s6_113;
	word32 s7_114;
	word32 s8_115;
	word32 mstatus_116;
	tcp_write(ra, s1, a0_6, a1, a2, a3, mstatus, dwArg04, dwArg19, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out a0_104, out a1_105, out a2_106, out a3_107, out a5_108, out s2_109, out s3_110, out s4_111, out s5_112, out s6_113, out s7_114, out s8_115, out mstatus_116);
}

// 2303C162: void altcp_tcp_shutdown(Register Eq_2 ra, Register (ptr32 Eq_191678) a0, Register Eq_2 a1, Register ui32 a2, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArgFC, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void altcp_tcp_shutdown(Eq_2 ra, struct Eq_191678 * a0, Eq_2 a1, ui32 a2, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArgFC, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	if (a0 == null)
		return;
	Eq_2 a0_6 = a0->t000C;
	word32 s1_112;
	word32 a0_113;
	word32 a3_114;
	word32 a4_115;
	word32 a5_116;
	word32 s3_117;
	word32 s4_118;
	word32 s5_119;
	word32 s6_120;
	word32 s7_121;
	word32 mstatus_122;
	tcp_shutdown(ra, a0_6, a1, a2, s4, s7, mstatus, dwArg10, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgBC, dwArgC8, dwArgD8, dwArgE8, dwArgEC, dwArgF8, dwArgFC, dwArg0108, dwArg0118, out s1_112, out a0_113, out a3_114, out a4_115, out a5_116, out s3_117, out s4_118, out s5_119, out s6_120, out s7_121, out mstatus_122);
}

// 2303C16E: void altcp_tcp_close(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_190973) a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8)
void altcp_tcp_close(Eq_2 ra, Eq_2 s0, Eq_2 s1, word32 a0, Eq_2 a3, Eq_2 a4, struct Eq_190973 * a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8)
{
	if (a0 == 0x00)
		return;
	Eq_2 s1_17 = *((word32) s0 + 0x0C);
	if (s0 != 0x00)
	{
		tcp_arg(s0, 0x00);
		tcp_recv(s0, 0x00);
		tcp_sent(s0, 0x00);
		tcp_err(s0, 0x00);
		Eq_2 a2_27 = (word32) *((word32) s0 + 29);
		tcp_poll(s0, 0x00, a2_27);
		word32 a0_35;
		word32 s3_49;
		word32 s2_187;
		word32 s4_188;
		word32 s5_189;
		word32 s6_190;
		word32 s7_191;
		word32 s8_192;
		word32 s9_193;
		word32 s10_194;
		word32 s11_195;
		ra = tcp_close(ra, s0, a2_27, a3, s4, s7, mstatus, dwLoc10, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, s3, s1, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgDC, dwArgE8, dwArgF8, out s1_17, out a0_35, out a3, out a4, out a5, out s2_187, out s3_49, out s4_188, out s5_189, out s6_190, out s7_191, out s8_192, out s9_193, out s10_194, out s11_195, out mstatus);
		if (a0_35 != 0x00)
		{
			altcp_tcp_setup_callbacks(s1_17, s0);
			tcp_poll(s0, s3_49, (word32) *((word32) s0 + 29));
			return;
		}
		*((word32) s1_17 + 0x0C) = 0x00;
	}
	altcp_free(ra, s1_17, a3, a4, a5, mstatus);
}

