pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303C1F0: void altcp_tcp_abort(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_191930) a0, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108)
void altcp_tcp_abort(Eq_2 ra, Eq_2 s1, struct Eq_191930 * a0, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArg0108)
{
	if (a0 == null)
		return;
	Eq_2 a0_5 = a0->t000C;
	if (a0_5 == 0x00)
		return;
	word32 mstatus_155;
	word32 s11_154;
	word32 s10_153;
	word32 s9_152;
	word32 s7_151;
	word32 s6_150;
	word32 s5_149;
	word32 s3_147;
	word32 s4_148;
	word32 s2_146;
	word32 a5_145;
	word32 a4_144;
	word32 a3_143;
	word32 a0_142;
	word32 s1_141;
	word32 s0_140;
	tcp_abort(ra, s1, a0_5, a3, s3, s4, s7, mstatus, dwArg00, dwArg04, dwArg28, dwArg38, dwArg48, dwArg58, dwArg74, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgD8, dwArgDC, dwArgE8, dwArg0108, out s0_140, out s1_141, out a0_142, out a3_143, out a4_144, out a5_145, out s2_146, out s3_147, out s4_148, out s5_149, out s6_150, out s7_151, out s9_152, out s10_153, out s11_154, out mstatus_155);
}

// 2303C1FC: void altcp_tcp_listen(Register Eq_2 s1, Register (ptr32 Eq_192038) a0, Register (ptr32 byte) a2, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28)
void altcp_tcp_listen(Eq_2 s1, struct Eq_192038 * a0, byte * a2, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg28)
{
	if (a0 == null)
		return;
	word32 a2_66;
	word32 a3_67;
	word32 a4_68;
	word32 a5_69;
	Eq_2 a0_16 = tcp_listen_with_backlog_and_err(s1, a0->t000C, a2, a3, a4, mstatus, dwArg24, dwArg28, out a2_66, out a3_67, out a4_68, out a5_69);
	if (a0_16 == 0x00)
		return;
	*((word32) a0_16 + 0x0C) = a0;
	tcp_accept(a0_16, &g_t2303C292);
}

// 2303C22A: void altcp_tcp_connect(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_192087) a0, Register word32 a1, Register Eq_2 a2, Register (ptr32 Eq_192090) a3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118)
void altcp_tcp_connect(Eq_2 ra, Eq_2 s1, struct Eq_192087 * a0, word32 a1, Eq_2 a2, struct Eq_192090 * a3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0118)
{
	if (a0 == null)
		return;
	a3->ptr0014 = a0;
	Eq_2 a0_7 = a0->t000C;
	word32 s1_113;
	word32 a0_114;
	word32 a4_115;
	word32 a5_116;
	word32 mstatus_117;
	tcp_connect(ra, s1, a0_7, a1, a2, 0x2303C004, s7, mstatus, dwArg04, dwArg24, dwArg38, dwArg48, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgEC, dwArgF8, dwArg0118, out s1_113, out a0_114, out a4_115, out a5_116, out mstatus_117);
}

// 2303C240: void altcp_tcp_bind(Register Eq_2 s1, Register (ptr32 Eq_192164) a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg44)
void altcp_tcp_bind(Eq_2 s1, struct Eq_192164 * a0, Eq_2 a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg44)
{
	if (a0 == null)
		return;
	Eq_2 a0_6 = a0->t000C;
	word32 a4_52;
	tcp_bind(s1, a0_6, a1, a2, a5, mstatus, dwArg24, dwArg44, out a4_52);
}

// 2303C24C: void altcp_tcp_recved(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_192193) a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118)
void altcp_tcp_recved(Eq_2 ra, Eq_2 s1, struct Eq_192193 * a0, word32 a1, Eq_2 a2, Eq_2 a3, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg010C, Eq_2 dwArg0118)
{
	if (a0 == null)
		return;
	Eq_2 a0_5 = a0->t000C;
	word32 s0_108;
	word32 s1_109;
	word32 a0_110;
	word32 a2_111;
	word32 a3_112;
	word32 a4_113;
	word32 a5_114;
	word32 s3_115;
	word32 s4_116;
	word32 s7_117;
	word32 s9_118;
	word32 s10_119;
	word32 s11_120;
	word32 mstatus_121;
	tcp_recved(ra, s1, a0_5, a1, a2, a3, s7, mstatus, dwArg10, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgCC, dwArgD8, dwArgE8, dwArg0108, dwArg010C, dwArg0118, out s0_108, out s1_109, out a0_110, out a2_111, out a3_112, out a4_113, out a5_114, out s3_115, out s4_116, out s7_117, out s9_118, out s10_119, out s11_120, out mstatus_121);
}

// 2303C256: void altcp_tcp_recv(Register Eq_2 ra, Register (ptr32 Eq_192289) a0, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack word32 dwArg10, Stack Eq_2 dwArg0118)
void altcp_tcp_recv(Eq_2 ra, struct Eq_192289 * a0, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, word32 dwArg10, Eq_2 dwArg0118)
{
	if (a0 != null)
	{
		<anonymous> * t1_8 = a0->ptr0018;
		if (t1_8 != null)
		{
			word32 t1_57;
			word32 s0_63;
			word32 t3_64;
			word32 tp_65;
			word32 a5_66;
			word32 s1_67;
			word32 s2_68;
			word32 s3_69;
			word32 a6_70;
			word32 a7_71;
			word32 s5_72;
			word32 s6_73;
			word32 s8_74;
			word32 t0_75;
			word32 t4_76;
			word32 t5_77;
			word32 t6_78;
			t1_8();
			return;
		}
	}
	if (a2 == 0x00)
		return;
	word32 mstatus_162;
	word32 s8_161;
	word32 s6_160;
	word32 s5_159;
	word32 s4_158;
	word32 s3_157;
	word32 s2_156;
	word32 a7_155;
	word32 a5_154;
	word32 a4_153;
	word32 a3_152;
	word32 a2_151;
	word32 a1_150;
	word32 a0_149;
	word32 s1_148;
	word32 s0_147;
	pbuf_free(ra, a2, a3, a4, s4, mstatus, dwArg0118, out s0_147, out s1_148, out a0_149, out a1_150, out a2_151, out a3_152, out a4_153, out a5_154, out a7_155, out s2_156, out s3_157, out s4_158, out s5_159, out s6_160, out s8_161, out mstatus_162);
}

// 2303C27E: void altcp_tcp_set_poll(Register (ptr32 Eq_192358) a0, Register Eq_2 a1)
void altcp_tcp_set_poll(struct Eq_192358 * a0, Eq_2 a1)
{
	if (a0 == null)
		return;
	Eq_2 a0_7 = a0->t000C;
	tcp_poll(a0_7, 0x2303C02C, a1);
}

// 2303C292: void altcp_tcp_accept(Register Eq_2 ra, Register Eq_2 s1, Register word32 a0, Register Eq_2 a1, Register word32 a2, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_192376) a5, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack word32 dwArg28, Stack word32 dwArg48)
void altcp_tcp_accept(Eq_2 ra, Eq_2 s1, word32 a0, Eq_2 a1, word32 a2, Eq_2 a3, Eq_2 a4, struct Eq_192376 * a5, ptr32 mstatus, word32 dwArg00, word32 dwArg04, word32 dwArg28, word32 dwArg48)
{
	if (a0 == 0x00)
		return;
	Eq_2 a0_6 = a5->t0010;
	if (a5 == null)
		return;
	word32 a3_28;
	word32 a4_29;
	word32 a2_140;
	word32 s1_139;
	Eq_2 ra_34 = altcp_alloc(ra, s1, a3, a4, mstatus, out s1_139, out a2_140, out a3_28, out a4_29);
	if (a0_6 == 0x00)
		return;
	word32 a0_46 = altcp_tcp_setup_callbacks(a0_6, a1);
	*((word32) a0_6 + 0x0C) = a1;
	g_t230861A8 = a0_6;
	word32 t1_72;
	word32 tp_80;
	word32 t0_81;
	(*((word32) a0_6 + 16))();
}

// 2303C2F2: void altcp_tcp_new_ip_type(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgCC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgEC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108)
// Called from:
//      altcp_new
void altcp_tcp_new_ip_type(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgCC, Eq_2 dwArgD8, Eq_2 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgEC, Eq_2 dwArgF8, Eq_2 dwArg0108)
{
	Eq_2 a0_16;
	Eq_2 a3_19;
	Eq_2 a4_20;
	ptr32 mstatus_24;
	Eq_2 s4_32;
	Eq_2 s7_35;
	word32 s1_163;
	word32 a5_164;
	Eq_2 ra_25 = tcp_new_ip_type(ra, s1, a3, a4, s3, s4, s7, mstatus, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg44, dwArg48, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgCC, dwArgD8, out s1_163, out a0_16, out a3_19, out a4_20, out a5_164, out s4_32, out s7_35, out mstatus_24);
	if (a0_16 != 0x00)
	{
		Eq_2 a2_47;
		Eq_2 a3_48;
		Eq_2 s1_51;
		word32 a4_165;
		Eq_2 ra_54 = altcp_alloc(ra_25, a0_16, a3_19, a4_20, mstatus_24, out s1_51, out a2_47, out a3_48, out a4_165);
		if (a0_16 != 0x00)
		{
			altcp_tcp_setup_callbacks(a0_16, s1_51);
			*((word32) s1_51 + 0x0C) = a0_16;
			g_t230861A8 = a0_16;
		}
		else
		{
			word32 s1_166;
			word32 a0_167;
			word32 a3_168;
			word32 a4_169;
			word32 a5_170;
			word32 s2_171;
			word32 s3_172;
			word32 s4_173;
			word32 s5_174;
			word32 s6_175;
			word32 s7_176;
			word32 s8_177;
			word32 s9_178;
			word32 s10_179;
			word32 s11_180;
			word32 mstatus_181;
			tcp_close(ra_54, s1_51, a2_47, a3_48, s4_32, s7_35, mstatus_24, dwArg00, dwArg28, dwArg38, dwArg48, dwArg58, dwArg68, ra, dwArg78, dwArg88, dwArg98, dwArg9C, dwArgA8, dwArgAC, dwArgB8, dwArgC8, dwArgD8, dwArgDC, dwArgE8, dwArgEC, dwArgF8, dwArg0108, out s1_166, out a0_167, out a3_168, out a4_169, out a5_170, out s2_171, out s3_172, out s4_173, out s5_174, out s6_175, out s7_176, out s8_177, out s9_178, out s10_179, out s11_180, out mstatus_181);
		}
	}
}

// 2303C332: Register Eq_2 lwip_htons(Register Eq_2 a0, Register out (ptr32 Eq_1597) a5Out)
// Called from:
//      http_test_cmd
//      ota_tcp_cmd
//      get_dns_request
//      lwip_getaddrinfo
//      lwip_sock_make_addr.isra.3
//      lwip_accept
//      lwip_bind
//      lwip_connect
//      lwip_sendto
//      dns_check_entry
//      dns_recv
//      ip_chksum_pseudo
//      ip_chksum_pseudo_partial
//      etharp_request
//      ip4_input
//      ip4_output_if_opt
//      tcp_oos_insert_segment
//      tcp_free_acked_segments.isra.3
//      tcp_receive
//      tcp_input
//      tcp_create_segment
//      tcp_output_alloc_header_common.constprop.6
//      tcp_write
//      tcp_split_unsent_seg
//      tcp_send_fin
//      tcp_rexmit_rto_prepare
//      tcp_output
//      tcp_zero_window_probe
//      udp_input
//      udp_sendto
//      ethernet_output
//      tcpc_entry
//      TCP_Server
//      iperf_client_udp
//      iperf_server
//      iperf_client_tcp
//      ping_free
//      ping_timeout
//      ping_recv
Eq_2 lwip_htons(Eq_2 a0, struct Eq_1597 & a5Out)
{
	a5Out = a0 << 0x08;
	return (word32) (word16) (a0 >> 8 | a0 << 0x08);
}

