pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303CDB8: Register word32 inet_chksum_pseudo_partial(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register uint32 a3, Register Eq_2 a4, Stack Eq_2 dwArg0128, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_194557 s6Out)
// Called from:
//      ip_chksum_pseudo_partial
word32 inet_chksum_pseudo_partial(Eq_2 a0, Eq_2 a1, Eq_2 a2, uint32 a3, Eq_2 a4, Eq_2 dwArg0128, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a4Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_194557 & s6Out)
{
	uint32 a4_24 = *a4;
	uint32 a4_33 = (a4_24 >> 16) + (((a2 & 0x0FFFFFFF) + (a2 >> 16)) + (a4_24 & 0x0FFFFFFF));
	uint32 a4_36 = (a4_33 & 0x0FFFFFFF) + (a4_33 >> 0x10);
	Eq_2 a4_100 = a4_36 & 0x0FFFFFFF;
	Eq_2 s4_40 = a0;
	uint32 s0_104 = (a4_36 >> 0x10) + (a4_36 & 0x0FFFFFFF);
	Eq_194557 s6_154 = 0x00;
	while (s4_40 != 0x00 && a3 != 0x00)
	{
		uint32 a5_49 = (word32) *((word32) s4_40 + 0x0A);
		uint32 s3_50 = a5_49;
		if (a3 < a5_49)
			s3_50 = a3;
		uint32 s3_53 = s3_50 << 16;
		word32 a3_68;
		word32 a5_238;
		word32 a2_237;
		uint32 s0_73 = (word32) lwip_standard_chksum(*((word32) s4_40 + 4), s3_53 >> 0x10, a4_100, out a2_237, out a3_68, out a4_100, out a5_238) + s0_104;
		s3 = a3_68 - (s3_53 >> 0x10);
		s0_104 = (s0_73 & 0x0FFFFFFF) + (s0_73 >> 0x10);
		a3 = (word32) (word16) s3;
		if (((word32) *((word32) s4_40 + 0x0A) & 0x01) != 0x00)
		{
			s6_154 = s6_154 ^ 1;
			s0_104 = s0_104 >> 8 & 0x00FF | s0_104 << 0x08 & 0x0FFFFFFF;
		}
		s4_40 = *s4_40;
	}
	if (s6_154 != 0x00)
	{
		a4_100.u0 = 0x0FFFFFFF;
		s0_104 = s0_104 >> 8 & 0x00FF | s0_104 << 0x08 & 0x0FFFFFFF;
	}
	word32 a5_235;
	Eq_2 a0_111 = lwip_htons(a1, out a5_235);
	word32 a5_236;
	word32 s0_125 = s0_104 + (lwip_htons(a2, out a5_236) + a0_111);
	0x00 = (uint16) dwArg0128;
	s1Out = a0_111;
	uint32 s0_129 = (s0_125 & 0x0FFFFFFF) + (s0_125 >> 0x10);
	a0Out = (word32) (word16) ~((s0_129 & 0x0FFFFFFF) + (s0_129 >> 0x10));
	a4Out = a4_100;
	s3Out = s3;
	s4Out = dwArg78;
	s5Out = a1;
	s6Out = s6_154;
	return dwArgE4;
}

// 2303CEB2: Register word32 ip_chksum_pseudo_partial(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register uint32 a3, Register Eq_2 a4, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_194701) s1Out, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out (ptr32 Eq_225410) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out (ptr32 Eq_194707) s6Out)
// Called from:
//      tcp_output
//      udp_sendto
word32 ip_chksum_pseudo_partial(Eq_2 a0, Eq_2 a1, Eq_2 a2, uint32 a3, Eq_2 a4, Eq_2 dwArg0128, struct Eq_194701 & s1Out, ptr32 & a0Out, ptr32 & a4Out, union Eq_225410 & s3Out, ptr32 & s4Out, ptr32 & s5Out, struct Eq_194707 & s6Out)
{
	ptr32 a0_9;
	ptr32 a4_13;
	struct Eq_194701 * s1_17;
	union Eq_225410 * s3_19;
	ptr32 s4_20;
	ptr32 s5_21;
	struct Eq_194707 * s6_22;
	word32 s0_16 = inet_chksum_pseudo_partial(a0, a1, a2, a3, a4, dwArg0128, out s1_17, out a0_9, out a4_13, out s3_19, out s4_20, out s5_21, out s6_22);
	s1Out = s1_17;
	a0Out = a0_9;
	a4Out = a4_13;
	s3Out = s3_19;
	s4Out = s4_20;
	s5Out = s5_21;
	s6Out = s6_22;
	return s0_16;
}

// 2303CEB6: Register Eq_2 inet_chksum(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      igmp_send
//      igmp_input
//      ip4_input
//      tcp_split_unsent_seg
//      icmp_input
//      icmp_dest_unreach
//      ping_timeout
Eq_2 inet_chksum(Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_12;
	ptr32 a4_13;
	ptr32 a5_14;
	word32 a2_26;
	Eq_2 a0_18 = (word32) (word16) ~lwip_standard_chksum(a0, a1, a4, out a2_26, out a3_12, out a4_13, out a5_14);
	a2Out = dwArg10;
	a3Out = a3_12;
	a4Out = a4_13;
	a5Out = a5_14;
	return a0_18;
}

// 2303CECC: Register uint32 inet_chksum_pbuf(Register Eq_2 a0, Register Eq_2 a4, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s2Out, Register out ptr32 s4Out)
// Called from:
//      icmp_input
uint32 inet_chksum_pbuf(Eq_2 a0, Eq_2 a4, union Eq_2 & s1Out, ptr32 & a0Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s2Out, ptr32 & s4Out)
{
	Eq_2 s1_16 = a0;
	ui32 s3_17 = 0x00;
	uint32 s0_18 = 0x00;
	while (s1_16 != 0x00)
	{
		struct Eq_194762 * s1_24 = *((word32) a0 + 4);
		word32 a2_124;
		word32 a5_125;
		a0 = lwip_standard_chksum(a0, (word32) *((word32) s1_16 + 0x0A), a4, out a2_124, out a3, out a4, out a5_125);
		uint32 s0_33 = (word32) a0 + s0_18;
		s0_18 = (s0_33 & 0x0FFFFFFF) + (s0_33 >> 0x10);
		if (((word32) s1_24->w000A & 0x01) != 0x00)
		{
			s3_17 = s3_17 ^ 1;
			s0_18 = s0_18 >> 8 & 0x00FF | s0_18 << 0x08 & 0x0FFFFFFF;
		}
		s1_16 = s1_24->t0000;
	}
	if (s3_17 != 0x00)
	{
		a4.u0 = 0x0FFFFFFF;
		s0_18 = s0_18 >> 8 & 0x00FF | s0_18 << 0x08 & 0x0FFFFFFF;
	}
	s1Out = s1_16;
	a0Out = (word32) (word16) ~s0_18;
	a3Out = a3;
	a4Out = a4;
	s2Out = 0x0FFFFFFF;
	s4Out = dwArg04;
	return s0_18;
}

// 2303CF46: Register Eq_2 lwip_chksum_copy(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out ptr32 a4Out)
// Called from:
//      lwip_sendto
//      tcp_write
Eq_2 lwip_chksum_copy(Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & a0Out, ptr32 & a2Out, ptr32 & a4Out)
{
	Eq_2 a4_15;
	word32 a1_48;
	word32 a2_49;
	word32 a3_50;
	word32 a5_51;
	word32 a6_52;
	word32 a7_53;
	memcpy(a0, a1, a2, out a1_48, out a2_49, out a3_50, out a4_15, out a5_51, out a6_52, out a7_53);
	ptr32 a2_36;
	ptr32 a4_38;
	word32 a3_54;
	word32 a5_55;
	a0Out = lwip_standard_chksum(a0, a2, a4_15, out a2_36, out a3_54, out a4_38, out a5_55);
	a2Out = a2_36;
	a4Out = a4_38;
	return a2;
}

// 2303CF66: Register Eq_2 lwip_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      tcpip_init
Eq_2 lwip_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out)
{
	stats_init();
	sys_init();
	mem_init(ra, mstatus, dwLoc10, dwLoc0C, ra, dwArgE8, dwArg0128, dwArg0168);
	struct Eq_52584 * a2_31;
	Eq_2 a0_30 = memp_init(out a2_31);
	netif_init();
	struct Eq_52584 * a2_45;
	word32 * a0_54;
	Eq_2 a3_57;
	Eq_2 s1_62;
	Eq_2 ra_61 = tcp_init(ra, udp_init(a0_30, a2_31, out a2_45), a2_45, dwLoc08, dwArg18, dwArg60, dwArg88, dwArgAC, out s1_62, out a0_54, out a3_57);
	word32 * a5_78;
	Eq_2 a4_77 = igmp_init(out a5_78);
	dns_init(ra_61, s1_62, a3_57, a4_77, a5_78, mstatus);
	ptr32 a1_83;
	ptr32 a3_85;
	ptr32 a4_86;
	a0Out = sys_timeouts_init(a0_54, a3_57, a4_77, mstatus, dwArg34, dwArg38, out a1_83, out a3_85, out a4_86);
	a1Out = a1_83;
	a3Out = a3_85;
	a4Out = a4_86;
	return ra_61;
}

