pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303CF96: Register word32 dhcp_set_state(Register Eq_2 a0, Register word32 a1)
// Called from:
//      dhcp_check
//      dhcp_bind
//      dhcp_select
//      dhcp_recv
//      dhcp_network_changed
//      dhcp_arp_reply
//      dhcp_renew
//      dhcp_start
//      dhcp_coarse_tmr
//      dhcp_stop
word32 dhcp_set_state(Eq_2 a0, word32 a1)
{
	word32 a5_5 = (word32) *((word32) a0 + 5);
	if (a5_5 != a1)
	{
		*((word32) a0 + 5) = (byte) a1;
		((word32) a0 + 6)->u1 = 0x00;
		*((word32) a0 + 8) = 0x00;
	}
	return a5_5;
}

// 2303CFAC: Register int32 dhcp_option_short(Register int32 a0, Register (ptr32 Eq_2) a1, Register Eq_194964 a2)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_renew
//      dhcp_coarse_tmr
int32 dhcp_option_short(int32 a0, union Eq_2 * a1, Eq_194964 a2)
{
	*((char *) a1 + a0) = (union Eq_2 *) (byte) (a2 >> 0x08);
	*((char *) a1 + (word32) ((word16) (a0 + 1))) = (union Eq_2 *) (byte) a2;
	return (word32) (word16) (a0 + 0x02);
}

// 2303CFCE: Register Eq_194981 dhcp_option_long(Register Eq_194981 a0, Register Eq_194982 a1, Register Eq_2 a2)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_arp_reply
//      dhcp_stop
Eq_194981 dhcp_option_long(Eq_194981 a0, Eq_194982 a1, Eq_2 a2)
{
	Mem8[a1 + a0:byte] = SLICE(a2 >>u 0x18, byte, 0);
	*((word32) a1.u1 + (word32) ((word16) ((word32) a0.u0 + 1))) = (byte) (a2 >> 0x10);
	*((word32) a1.u1 + (word32) ((word16) ((word32) a0.u0 + 2))) = (byte) (a2 >> 0x08);
	*((word32) a1.u1 + (word32) ((word16) ((word32) a0.u0 + 3))) = (byte) a2;
	return (word32) (word16) ((word32) a0.u0 + 4);
}

// 2303D014: Register Eq_2 dhcp_create_msg(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0138, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out (ptr32 Eq_195043) s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_arp_reply
//      dhcp_renew
//      dhcp_coarse_tmr
//      dhcp_stop
Eq_2 dhcp_create_msg(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0138, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, ptr32 & s2Out, struct Eq_195043 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 s1_108;
	Eq_2 s5_184;
	s1_108 = s1;
	if (a0 == 0x00)
	{
l2303D028:
		s5_184.u0 = 0x00;
		goto l2303D02A;
	}
	s1_108 = s1;
	if (a1 == 0x00)
		goto l2303D028;
	Eq_2 a0_33;
	struct Eq_52584 * a2_34;
	word32 s0_394;
	word32 a1_395;
	word32 s5_397;
	word32 s8_398;
	word32 a7_396;
	word16 * s4_179;
	ra = pbuf_alloc(ra, s0, a0, 0x00B6, 308, 640, a3, a4, mstatus, s4, dwArg24, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0138, out s0_394, out s1_108, out a0_33, out a1_395, out a2_34, out a3, out a4, out a5, out a7_396, out s2, out s3, out s4_179, out s5_397, out s6, out s8_398, out mstatus);
	s5_184 = a0_33;
	if (a0_33 == 0x00)
		goto l2303D028;
	if (s2 != 0x03 || (word32) s3->b0005 == s2)
	{
		Eq_2 a5_63 = (word32) s3->b0006;
		if (a5_63 == 0x00)
		{
			word32 a4_411;
			word32 a3_410;
			word32 * a0_68;
			word32 a1_409;
			s1_108 = bl_rand(a0_33, a2_34, out a0_68, out a1_409, out a3_410, out a4_411, out a5_63, out s4_179);
			*a0_68 = 0x4200DF14;
		}
		s3->t0000 = a5_63;
	}
	Eq_2 s0_89 = *((word32) a0_33 + 4);
	word32 a3_403;
	word32 a4_404;
	word32 a5_405;
	word32 a2_402;
	word32 a1_401;
	word32 a0_400;
	word32 t1_399;
	ra = memset(ra, s0_89, 0x00, 308, out t1_399, out a0_400, out a1_401, out a2_402, out a3_403, out a4_404, out a5_405);
	s0_89->u1 = 0x01;
	((word32) s0_89 + 1)->u1 = 0x01;
	((word32) s0_89 + 2)->u1 = (byte) (word32) *((word32) s1_108 + 64);
	word32 a5_408;
	word32 a3_406;
	word32 a4_407;
	Eq_2 a0_115 = lwip_htonl(s3->t0000, out a3_406, out a4_407, out a5_408);
	((word32) s0_89 + 4)->u1 = (byte) a0_115;
	*((word32) s0_89 + 5) = (byte) (a0_115 >> 0x08);
	*((word32) s0_89 + 6) = (byte) (a0_115 >> 0x10);
	*((word32) s0_89 + 7) = (byte) (a0_115 >> 24);
	s6 = 0x01;
	struct Eq_195178 * a5_126 = (struct Eq_195178 *) 0x04;
	if (s2 == 0x04)
	{
l2303D0F0:
		s1_108 = a5_126->t0004;
		((word32) s0_89 + 0x0C)->u1 = (byte) a5_126;
		*((word32) s0_89 + 0x0D) = (byte) (a5_126 >> 0x08);
		*((word32) s0_89 + 0x0E) = (byte) (a5_126 >> 0x10);
		((word32) s0_89 + 0x0F)->u1 = (byte) (a5_126 >> 24);
		goto l2303D10C;
	}
	else
	{
		a5_126 = s2 + -7 & 0x00FF;
		if (a5_126 <= (struct Eq_195178 *) 0x01)
			goto l2303D0F0;
		if (s2 == 0x03)
		{
			a5_126 = (word32) s3->b0005 + ~0x03 & 0x00FF;
			if (a5_126 <= (struct Eq_195178 *) 0x01)
				goto l2303D0F0;
		}
l2303D10C:
		Eq_2 a5_148 = (word32) s1_108 + 58;
		struct Eq_195237 * a4_150 = (word32) s0_89 + 28;
		s1_108 = (word32) s1_108 + 64;
		do
		{
			a3 = (word32) *a5_148;
			++a4_150;
			a4_150[0x0FFF] = (struct Eq_195237) (byte) a3;
			a5_148 = (word32) a5_148 + 1;
		} while (a5_148 != s1_108);
		((word32) s0_89 + 0x00EC)->u1 = 99;
		((word32) s0_89 + 0x00EF)->u1 = 99;
		((word32) s0_89 + 0x00ED)->u1 = 0x82;
		((word32) s0_89 + 0x00F0)->u1 = 0x35;
		((word32) s0_89 + 0x00F1)->u1 = 0x01;
		((word32) s0_89 + 0x00EE)->u1 = 0x53;
		((word32) s0_89 + 242)->u1 = (byte) s2;
		*s4_179 = 0x03;
		a4.u0 = 83;
		a5 = 0x03;
l2303D02A:
		0x00 = (uint16) dwArgA8;
		s0Out = s1;
		s1Out = s1_108;
		a0Out = s5_184;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5_184;
		s6Out = s6;
		mstatusOut = mstatus;
		return ra;
	}
}

// 2303D15E: Register Eq_2 dhcp_option_trailer(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s8Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_arp_reply
//      dhcp_renew
//      dhcp_coarse_tmr
//      dhcp_stop
Eq_2 dhcp_option_trailer(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s8Out, ptr32 & mstatusOut)
{
	Mem10[a1 + a0:byte] = ~0x00;
	uint32 a5_5 = (word32) a0 + 1 << 16;
	Eq_195323 a5_14 = a5_5 >> 16;
	word32 a1_11 = a1 + (a5_5 >>u 16);
	while (a5_14 <= 67)
	{
		*a1_11 = 0x00;
		a5_14 = (word32) (word16) ((word32) a5_14.u1 + 1);
		++a1_11;
	}
	Eq_2 a1_23 = (word32) (word16) ((word32) a5_14 + 0x00F0);
	ptr32 s1_40;
	ptr32 mstatus_46;
	ptr32 s2_48;
	ptr32 s3_49;
	ptr32 s4_50;
	ptr32 s6_52;
	ptr32 s8_53;
	word32 a2_69;
	word32 a3_70;
	word32 a4_71;
	word32 a5_72;
	word32 s5_73;
	Eq_2 ra_47 = pbuf_realloc(ra, a2, a1_23, ~0x00, 67, s4, mstatus, dwArg0118, out s1_40, out a2_69, out a3_70, out a4_71, out a5_72, out s2_48, out s3_49, out s4_50, out s5_73, out s6_52, out s8_53, out mstatus_46);
	s1Out = s1_40;
	s2Out = s2_48;
	s3Out = s3_49;
	s4Out = s4_50;
	s6Out = s6_52;
	s8Out = s8_53;
	mstatusOut = mstatus_46;
	return ra_47;
}

