pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303D196: Register Eq_2 dhcp_discover(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_2) s0Out, Register out (ptr32 Eq_195394) s1Out, Register out ptr32 a0Out, Register out Eq_195396 a3Out, Register out (ptr32 Eq_195397) a4Out, Register out Eq_195398 a5Out, Register out (ptr32 Eq_195399) s2Out, Register out (ptr32 Eq_195400) s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_recv
//      dhcp_network_changed
//      dhcp_start
//      dhcp_fine_tmr
Eq_2 dhcp_discover(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, union Eq_2 & s0Out, struct Eq_195394 & s1Out, ptr32 & a0Out, union Eq_195396 & a3Out, struct Eq_195397 & a4Out, union Eq_195398 & a5Out, struct Eq_195399 & s2Out, struct Eq_195400 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 a0_14 = *((word32) s1 + 40);
	*((word32) s1 + 28) = 0x00;
	dhcp_set_state(s1, 0x06);
	struct Eq_195417 * s0_36;
	word32 a0_51;
	word32 a4_316;
	word32 a5_317;
	struct Eq_195394 * s1_155;
	struct Eq_195399 * s2_156;
	ptr32 mstatus_169;
	Eq_195396 a3_152;
	struct Eq_195400 * s3_157;
	Eq_2 s4_160;
	ptr32 s5_161;
	ptr32 s6_162;
	Eq_2 ra_170 = dhcp_create_msg(ra, s0, a0_14, s1, fp + -0x0022, a4, s4, mstatus, dwLoc0C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_36, out s1_155, out a0_51, out a3_152, out a4_316, out a5_317, out s2_156, out s3_157, out s4_160, out s5_161, out s6_162, out mstatus_169);
	if (a0_51 != 0x00)
	{
		int32 a5_53 = (word32) wLoc22;
		Eq_2 a0_52 = s0_36->t0004;
		((char *) &s0_36->t0004 + 0x00EC)[a5_53] = 0x39;
		((char *) &s0_36->t0004 + 0x00EC)[(word32) (word16) (a5_53 + 0x01)] = 0x02;
		Eq_2 a0_71 = dhcp_option_short((word32) (word16) (a5_53 + 2), (char *) &s0_36->t0004 + 0x00EC, (word32) s3_157->t0038);
		Mem77[s0_36 + 0x00F0 + a0_71:byte] = 55;
		((char *) &s0_36->t0004 + 0x00EC)[(word32) (word16) ((word32) a0_71 + 1)] = 0x04;
		uint16 wLoc22_221 = (word16) ((word32) a0_71 + 2);
		byte * a5_104 = g_a2308DE88;
		do
		{
			int32 a4_92 = (word32) wLoc22_221;
			((char *) &s0_36->t0004 + 0x00EC)[a4_92] = (byte) (word32) *a5_104;
			uint32 a0_98 = a4_92 + 1 << 16;
			wLoc22_221 = (word16) (a0_98 >> 16);
			++a5_104;
		} while (a5_104 != (byte *) 3707183484);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		ptr32 mstatus_120;
		Eq_2 s2_123;
		Eq_2 s3_124;
		Eq_2 s4_125;
		word32 s8_320;
		word32 s1_318;
		word32 s6_319;
		Eq_2 ra_121 = dhcp_option_trailer(ra_170, a0_98 >> 16, (char *) &s0_36->t0004 + 0x00EC, a0_52, s4_160, mstatus_169, dwArgE8, out s1_318, out s2_123, out s3_124, out s4_125, out s6_319, out s8_320, out mstatus_120);
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		Eq_2 stackArg184 = <invalid>;
		Eq_2 stackArg200 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg296 = <invalid>;
		word32 a3_336;
		word32 a4_337;
		word32 s2_338;
		word32 s3_339;
		word32 s4_340;
		word32 mstatus_341;
		udp_sendto_if_src(ra, a0, a1, a2, a3, a4, a5, s8, mstatus, stackArg20, stackArg120, stackArg136, stackArg168, stackArg184, stackArg200, stackArg232, stackArg248, stackArg296, out a3_336, out a4_337, out s2_338, out s3_339, out s4_340, out mstatus_341);
		word32 s0_342;
		word32 a0_343;
		word32 a1_344;
		word32 a2_345;
		word32 a4_346;
		word32 a5_347;
		word32 a7_348;
		word32 s8_349;
		ra_170 = pbuf_free(ra_121, s2_123, 67, s3_124, s4_125, mstatus_120, dwArgF8, out s0_342, out s1_155, out a0_343, out a1_344, out a2_345, out a3_152, out a4_346, out a5_347, out a7_348, out s2_156, out s3_157, out s4_160, out s5_161, out s6_162, out s8_349, out mstatus_169);
	}
	int32 a5_173 = (word32) s1_155->b0006;
	if (a5_173 != 0x00FF)
		s1_155->b0006 = (byte) (a5_173 + 0x01);
	word32 a5_182;
	up32 a4_179 = (word32) s1_155->b0006;
	if (a4_179 <= 0x05)
		a5_182 = (word32) (word16) ((0x01 << a4_179) + 1000);
	else
		a5_182 = 0x0EFFFA60;
	word32 a5_190 = a5_182 + 499;
	s1_155->w0008 = (word16) (a5_190 ^ 500);
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_155;
	a0Out = 0x00;
	a3Out = a3_152;
	a4Out = (struct Eq_195397 *) 500;
	a5Out = a5_190 ^ 500;
	s2Out = s2_156;
	s3Out = s3_157;
	s4Out = s4_160;
	s5Out = s5_161;
	s6Out = s6_162;
	mstatusOut = mstatus_169;
	return ra_170;
}

// 2303D2D8: Register Eq_2 dhcp_check(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF0, Stack Eq_2 dwArgF4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0168, Register out ptr32 s1Out, Register out Eq_195694 a3Out, Register out (ptr32 Eq_195695) a4Out, Register out (ptr32 Eq_195696) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_recv
//      dhcp_fine_tmr
Eq_2 dhcp_check(Eq_2 ra, Eq_2 s0, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF0, Eq_2 dwArgF4, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0168, ptr32 & s1Out, union Eq_195694 & a3Out, struct Eq_195695 & a4Out, struct Eq_195696 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 a0_10 = *((word32) s0 + 40);
	dhcp_set_state(s0, 0x08);
	Eq_195694 a3_23;
	struct Eq_195711 * s0_27;
	struct Eq_195696 * s2_28;
	ptr32 s4_29;
	ptr32 mstatus_33;
	ptr32 s1_35;
	ptr32 s3_36;
	ptr32 s5_37;
	ptr32 s6_38;
	ptr32 s7_39;
	Eq_2 ra_34 = etharp_query(ra, a0_10, (word32) s0 + 28, s4, mstatus, dwArg04, dwArg28, dwArg38, dwArg48, dwArg64, dwArg68, ra, dwArg78, dwArg88, dwArg90, dwArg94, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD4, dwArgD8, dwArgE8, dwArgF0, dwArgF4, dwArgF8, dwArg0118, dwArg0168, out s0_27, out s1_35, out a3_23, out s2_28, out s3_36, out s4_29, out s5_37, out s6_38, out s7_39, out mstatus_33);
	int32 a5_48 = (word32) s0_27->b0006;
	if (a5_48 != 0x00FF)
		s0_27->b0006 = (byte) (a5_48 + 0x01);
	s0_27->w0008 = 0x01;
	s1Out = s1_35;
	a3Out = a3_23;
	a4Out = (struct Eq_195695 *) 0x00FF;
	s2Out = s2_28;
	s3Out = s3_36;
	s4Out = s4_29;
	s5Out = s5_37;
	s6Out = s6_38;
	s7Out = s7_39;
	mstatusOut = mstatus_33;
	return ra_34;
}

