pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303D31A: Register Eq_2 dhcp_bind(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a5, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_195816 a3Out, Register out (ptr32 Eq_195817) a4Out, Register out (ptr32 Eq_195818) s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_recv
//      dhcp_fine_tmr
Eq_2 dhcp_bind(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a5, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg0108, Eq_2 dwArg0118, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_195816 & a3Out, struct Eq_195817 & a4Out, struct Eq_195818 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	if (a0 == 0x00)
	{
		s0Out = s0;
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 a0_11 = *((word32) s0 + 40);
	if (s0 == 0x00)
	{
l2303D3F8:
		s0Out = s0;
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		s2Out = s2;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		mstatusOut = mstatus;
		return ra;
	}
	Eq_2 s0_13 = *((word32) a5 + 40);
	((word32) s0_13 + 18)->u0 = 0x00;
	if (a5 != ~0x00)
	{
		word32 a4_19;
		a5 += 0x1E;
		if (a5 < 0xFFC4001E)
		{
			a5 = a5 + 0x1E >>u 60;
			a4_19 = (word32) (word16) a5;
			if (a5 == 0x00)
			{
				*((word32) s0_13 + 20) = 0x01;
				a5.u0 = 0x01;
				goto l2303D354;
			}
		}
		else
			a4_19 = 0x0FFFFFFF;
		*((word32) s0_13 + 20) = (word16) a4_19;
	}
l2303D354:
	Eq_2 s0_32 = *((word32) a5 + 44);
	if (a5 == ~0x00)
	{
l2303D382:
		Eq_2 s0_53 = *((word16) a5.u0 + 48);
		if (a5 == ~0x00)
		{
l2303D3B0:
			Eq_2 a5_74 = (word32) *((word32) s0_53 + 0x0C);
			Eq_2 a4_107 = (word32) *((word32) s0_53 + 0x0A);
			if (a4_107 >= a5_74 && a5_74 != 0x00)
				*((word32) s0_53 + 0x0A) = 0x00;
			Eq_2 a5_79 = (word32) *((word32) s0_53 + 7);
			if (a5_79 == 0x00)
			{
				Eq_195967 a5_80 = (word32) *((word32) s0_53 + 28);
				a4_107 = (int32) (byte) a5_80;
				if (a4_107 >= 0x00)
					a5_79.u0 = 0x00FF;
				else
				{
					word32 a5_84;
					a4_107.u0 = 191;
					if (a5_80 > 191)
						a5_84 = 0x01000000;
					else
						a5_84 = 0x10000000;
					a5_79 = a5_84 + ~0x00;
				}
			}
			Eq_2 s0_103 = *((word16) a5_79.u0 + 36);
			if (a5_79 == 0x00)
			{
				s0_103 = *((word32) a5_79 + 28);
				a4_107.u0 = 0x01000000;
			}
			word32 a1_580;
			word32 a5_582;
			word32 s4_583;
			word32 a2_581;
			ra = netif_set_addr(ra, a0_11, a0_11, (word32) s0_103 + 28, fp + ~0x17, fp + ~0x13, a4_107, dhcp_set_state(s0_103, 0x0A), s3, s4, s7, mstatus, a5_79, dwLoc18, dwLoc08, dwArg08, dwArg0C, dwArg24, dwArg28, dwArg38, dwArg48, dwArg4C, dwArg54, dwArg58, s1, dwArg78, dwArg98, dwArg0108, dwArg0118, out s0, out s1, out a1_580, out a2_581, out a3, out a4, out a5_582, out s2, out s3, out s4_583, out s5, out s6, out s7, out mstatus);
			goto l2303D3F8;
		}
		word32 a4_58;
		word32 a5_55 = a5 + 0x1E;
		if (a5_55 < (struct Eq_195917 *) 0x003C0000)
		{
			a4_58 = (word32) (word16) (a5_55 >> 60);
			if (a5_55 >> 60 == 0x00)
			{
				((word32) s0_53 + 0x0C)->u0 = 0x01;
				goto l2303D3A8;
			}
		}
		else
			a4_58 = 0x0FFFFFFF;
		((word32) s0_53 + 0x0C)->u0 = (word16) a4_58;
l2303D3A8:
		*((word32) s0_53 + 16) = (word16) (word32) *((word32) s0_53 + 0x0C);
		goto l2303D3B0;
	}
	word32 a4_37;
	word32 a5_34 = a5 + 0x1E;
	if (a5_34 < (struct Eq_195884 *) 0x003C0000)
	{
		a4_37 = (word32) (word16) (a5_34 >> 60);
		if (a5_34 >> 60 == 0x00)
		{
			*((word32) s0_32 + 0x0A) = 0x01;
			goto l2303D37A;
		}
	}
	else
		a4_37 = 0x0FFFFFFF;
	*((word32) s0_32 + 0x0A) = (word16) a4_37;
l2303D37A:
	a5 = (word32) *((word32) s0_32 + 0x0A);
	*((word32) s0_32 + 0x0E) = (word16) a5;
	goto l2303D382;
}

// 2303D456: Register Eq_2 dhcp_inc_pcb_refcount(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Register out ptr32 a0Out, Register out ptr32 a4Out, Register out Eq_196036 a5Out, Register out (ptr32 Eq_196037) s2Out)
// Called from:
//      dhcp_start
Eq_2 dhcp_inc_pcb_refcount(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, ptr32 & a0Out, ptr32 & a4Out, union Eq_196036 & a5Out, struct Eq_196037 & s2Out)
{
	Eq_196036 a5_100;
	ptr32 a4_32;
	if ((word32) g_b4200DF10 == 0x00)
	{
		word32 s1_23;
		word32 a3_123;
		word32 a4_124;
		ra = udp_new(ra, 0x4200E000, a3, a4, mstatus, out s1_23, out a3_123, out a4_124, out a5_100);
		*a0 = s1_23 + -244;
		a4_32 = ~0x00;
		if (a0 == 0x00)
		{
l2303D4C6:
			0x00 = (uint16) dwArg38;
			a0Out = a4_32;
			a4Out = a4_32;
			a5Out = a5_100;
			s2Out = s2;
			return ra;
		}
		((word32) a0 + 9)->u1 = (byte) ((word32) *((word32) a0 + 9) | 32);
		word32 a3_125;
		word32 a4_126;
		word32 a5_127;
		word32 a4_128;
		word32 a5_129;
		udp_recv(udp_connect(udp_bind(a0, 587783820, (union Eq_2 *) 0x0044, out a3_125, out a4_126, out a5_127), &g_t2308DE8C, 67, dwArg28, out a4_128, out a5_129, out s2), &g_t2303D9D2, 0x00);
	}
	word32 a5_66 = (word32) g_b4200DF10;
	g_b4200DF10 = (byte) (a5_66 + 0x01);
	a4_32 = 0x00;
	a5_100 = a5_66 + 0x01;
	goto l2303D4C6;
}

// 2303D4D4: Register Eq_2 dhcp_option_hostname.isra.0(Register Eq_2 a0, Register (ptr32 Eq_2) a1, Stack Eq_2 dwArg44, Register out Eq_2 a0Out, Register out ptr32 s8Out)
// Called from:
//      dhcp_select
//      dhcp_network_changed
//      dhcp_renew
//      dhcp_coarse_tmr
Eq_2 dhcp_option_hostname.isra.0(Eq_2 a0, union Eq_2 * a1, Eq_2 dwArg44, union Eq_2 & a0Out, ptr32 & s8Out)
{
	Eq_2 s0_59 = a0;
	ptr32 a2_10 = *a0;
	if (a0 != 0x00)
	{
		byte a1_18[];
		word32 a2_99;
		word32 a3_100;
		word32 a4_101;
		word32 a5_102;
		Eq_2 a0_14 = strlen(a0, out a1_18, out a2_99, out a3_100, out a4_101, out a5_102);
		if (a0_14 != 0x00)
		{
			Eq_2 a4_22 = 65 - a1;
			Eq_2 a2_24 = dwArg44;
			if (a0_14 < a4_22)
				a4_22 = a0_14;
			Mem30[a1_18 + a1:byte] = 0x0C;
			a1_18[(word32) (word16) ((char *) a1 + 1)] = (byte) a4_22;
			uint32 a3_34 = (char *) a1 + 2 << 16;
			word32 a0_41 = dwArg44 + a4_22;
			Eq_196167 a5_42 = a3_34 >> 16;
			while (a2_24 != a0_41)
			{
				a2_24 = (word32) a2_24 + 1;
				Mem52[a5_42 + a1_18:byte] = SLICE(CONVERT(Mem46[a2_24 + -1:byte], byte, word32), byte, 0);
				a5_42 = (word32) (word16) ((word32) a5_42 + 1);
			}
			s0_59 = (word32) (word16) ((word32) a4_22 + (a3_34 >> 16));
		}
	}
	a0Out = s0_59;
	s8Out = a2_10;
	return s0_59;
}

