pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303D550: Register Eq_2 dhcp_reboot(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_2) s0Out, Register out (ptr32 Eq_196208) s1Out, Register out (ptr32 Eq_196209) a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_network_changed
//      dhcp_fine_tmr
Eq_2 dhcp_reboot(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, union Eq_2 & s0Out, struct Eq_196208 & s1Out, struct Eq_196209 & a4Out, ptr32 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 a0_18 = *((word32) s1 + 40);
	dhcp_set_state(s1, 0x03);
	uint16 wLoc22_264 = SLICE(s4, uint16, 16);
	word32 a0_53;
	word32 a4_366;
	word32 a5_367;
	word32 s4_368;
	word32 a3_365;
	word32 s0_364;
	struct Eq_196208 * s1_196;
	ptr32 s6_203;
	ptr32 s5_202;
	ptr32 s2_197;
	ptr32 s3_198;
	ptr32 mstatus_210;
	Eq_2 ra_211 = dhcp_create_msg(ra, s0, a0_18, s1, fp + -0x0022, a4, s4, mstatus, dwLoc0C, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_364, out s1_196, out a0_53, out a3_365, out a4_366, out a5_367, out s2_197, out s3_198, out s4_368, out s5_202, out s6_203, out mstatus_210);
	if (a0_53 != 0x00)
	{
		struct Eq_196258 * a5_56 = (word32) wLoc22_264;
		Eq_2 a0_55 = *(union Eq_2 *) 0x03;
		a5_56->b00EF = 0x39;
		((byte[]) 0xEF)[(word32) (word16) ((char *) a5_56 + 1)] = 0x02;
		Eq_2 a0_74 = dhcp_option_short((word32) (word16) ((char *) a5_56 + 2), (union Eq_2 *) 0xEF, 576);
		((word32) a0_74 + 0x00EF)->u1 = 0x32;
		Eq_2 a0_85 = (word32) (word16) ((word32) a0_74 + 1) + 0xEF;
		a0_85->u1 = 0x04;
		word32 s4_89 = a0_74 + 2 << 16;
		word32 a3_369;
		word32 a4_370;
		word32 a5_371;
		Eq_2 a0_99 = dhcp_option_long(s4_89 >> 0x10, 0xEF, lwip_htonl(a0_85, out a3_369, out a4_370, out a5_371));
		((word32) a0_99 + 0x00EF)->u1 = 55;
		((byte[]) 0xEF)[(word32) (word16) ((word32) a0_99 + 1)] = 0x04;
		uint16 wLoc22_267 = (word16) ((word32) a0_99 + 2);
		byte * a5_114 = g_a2308DE88;
		do
		{
			struct Eq_196337 * a4_119 = (word32) wLoc22_267;
			a4_119->b00EF = (byte) (word32) *a5_114;
			word32 a0_125 = a4_119 + 1 << 16;
			wLoc22_267 = (word16) (a0_125 >> 16);
			++a5_114;
		} while (a5_114 != (byte *) 3707183484);
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		// Failed to bind call argument.
		// Please report this issue at https://github.com/uxmal/reko
		Eq_2 a0_144;
		ptr32 mstatus_162;
		Eq_2 s2_165;
		Eq_2 s3_166;
		Eq_2 s4_167;
		word32 s6_374;
		word32 s8_372;
		word32 s8_375;
		word32 s1_373;
		Eq_2 ra_163 = dhcp_option_trailer(ra_211, a0_144, dhcp_option_hostname.isra.0(a0_125 >> 16, (union Eq_2 *) 0xEF, dwArg14, out a0_144, out s8_372), a0_55, s4_89 >> 0x10, mstatus_210, dwArgE8, out s1_373, out s2_165, out s3_166, out s4_167, out s6_374, out s8_375, out mstatus_162);
		Eq_2 stackArg20 = <invalid>;
		Eq_2 stackArg120 = <invalid>;
		Eq_2 stackArg136 = <invalid>;
		Eq_2 stackArg168 = <invalid>;
		Eq_2 stackArg184 = <invalid>;
		Eq_2 stackArg200 = <invalid>;
		Eq_2 stackArg232 = <invalid>;
		Eq_2 stackArg248 = <invalid>;
		Eq_2 stackArg296 = <invalid>;
		word32 a3_390;
		word32 a4_391;
		word32 s2_392;
		word32 s3_393;
		word32 s4_394;
		word32 s7_395;
		word32 s8_396;
		word32 mstatus_397;
		udp_sendto_if(ra, a0, a1, a2, a3, a4, s8, mstatus, stackArg20, stackArg120, stackArg136, stackArg168, stackArg184, stackArg200, stackArg232, stackArg248, stackArg296, out a3_390, out a4_391, out s2_392, out s3_393, out s4_394, out s7_395, out s8_396, out mstatus_397);
		word32 s0_398;
		word32 a0_399;
		word32 a1_400;
		word32 a2_401;
		word32 a3_402;
		word32 a4_403;
		word32 a5_404;
		word32 a7_405;
		word32 s4_406;
		word32 s8_407;
		ra_211 = pbuf_free(ra_163, s2_165, 67, s3_166, s4_167, mstatus_162, dwArgF8, out s0_398, out s1_196, out a0_399, out a1_400, out a2_401, out a3_402, out a4_403, out a5_404, out a7_405, out s2_197, out s3_198, out s4_406, out s5_202, out s6_203, out s8_407, out mstatus_210);
	}
	int32 a5_214 = (word32) s1_196->b0006;
	if (a5_214 != 0x00FF)
		s1_196->b0006 = (byte) (a5_214 + 0x01);
	word32 a5_223;
	up32 a5_220 = (word32) s1_196->b0006;
	if (a5_220 <= 0x09)
		a5_223 = (word32) (word16) (a5_220 + 1000);
	else
		a5_223 = 0x02000710;
	s1_196->w0008 = (word16) (a5_223 + 499 ^ 500);
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_196;
	a4Out = (struct Eq_196209 *) 500;
	s2Out = s2_197;
	s3Out = s3_198;
	s4Out = dwArg78;
	s5Out = s5_202;
	s6Out = s6_203;
	mstatusOut = mstatus_210;
	return ra_211;
}

// 2303D6D2: Register Eq_2 dhcp_select(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_2) s0Out, Register out Eq_2 s1Out, Register out Eq_196534 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_196536) s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_recv
//      dhcp_fine_tmr
Eq_2 dhcp_select(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a4, Eq_2 s4, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_196534 & a3Out, union Eq_2 & a4Out, struct Eq_196536 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	uint16 wLoc22_325 = SLICE(s4, uint16, 16);
	if (a0 != 0x00)
	{
		Eq_2 a0_20 = *((word32) s1 + 40);
		if (s1 != 0x00)
		{
			dhcp_set_state(s1, 0x01);
			Eq_2 a0_56;
			word32 s4_485;
			word32 a5_483;
			word32 s3_484;
			word32 s0_481;
			word32 a4_482;
			ra = dhcp_create_msg(ra, ~0x05, a0_20, s1, fp + -0x0022, a4, s4, mstatus, dwLoc0C, s5, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_481, out s1, out a0_56, out a3, out a4_482, out a5_483, out s2, out s3_484, out s4_485, out s5, out s6, out mstatus);
			s3 = a0_56;
			if (a0_56 != 0x00)
			{
				struct Eq_196595 * a5_60 = (word32) wLoc22_325;
				a5_60->b00EF = 0x39;
				((byte[]) 0xEF)[(word32) (word16) ((char *) a5_60 + 1)] = 0x02;
				Eq_2 a0_77 = dhcp_option_short((word32) (word16) ((char *) a5_60 + 2), (union Eq_2 *) 0xEF, (word32) s2[56]);
				((word32) a0_77 + 0x00EF)->u1 = 0x32;
				((byte[]) 0xEF)[(word32) (word16) ((word32) a0_77 + 1)] = 0x04;
				word32 a5_488;
				word32 a4_487;
				word32 a3_486;
				Eq_2 a0_102 = dhcp_option_long((word32) (word16) ((word32) a0_77 + 2), 0xEF, lwip_htonl(a0_77, out a3_486, out a4_487, out a5_488));
				((word32) a0_102 + 0x00EF)->u1 = 0x36;
				((byte[]) 0xEF)[(word32) (word16) ((word32) a0_102 + 1)] = 0x04;
				word32 s4_116 = a0_102 + 2 << 16;
				word32 a4_490;
				word32 a3_489;
				word32 a5_491;
				Eq_2 a0_126 = dhcp_option_long(s4_116 >> 0x10, 0xEF, lwip_htonl(a0_102, out a3_489, out a4_490, out a5_491));
				((word32) a0_126 + 0x00EF)->u1 = 55;
				((byte[]) 0xEF)[(word32) (word16) ((word32) a0_126 + 1)] = 0x04;
				uint16 wLoc22_329 = (word16) ((word32) a0_126 + 2);
				byte * a5_141 = g_a2308DE88;
				do
				{
					struct Eq_196698 * a4_146 = (word32) wLoc22_329;
					a4_146->b00EF = (byte) (word32) *a5_141;
					word32 a0_152 = a4_146 + 1 << 16;
					wLoc22_329 = (word16) (a0_152 >> 16);
					++a5_141;
				} while (a5_141 != (byte *) 3707183484);
				Eq_2 a0_171;
				ptr32 mstatus_189;
				Eq_2 s2_192;
				Eq_2 s3_193;
				Eq_2 s8_197;
				Eq_2 a3_217;
				Eq_2 a4_218;
				ptr32 mstatus_222;
				Eq_2 s3_227;
				Eq_2 s4_228;
				word32 s8_492;
				word32 s1_493;
				word32 s4_494;
				word32 s6_495;
				word32 s2_496;
				word32 s0_497;
				word32 a0_498;
				word32 a1_499;
				word32 a2_500;
				word32 a5_502;
				word32 a4_501;
				word32 a7_503;
				word32 s4_504;
				word32 s8_505;
				ra = pbuf_free(udp_sendto_if_src(dhcp_option_trailer(ra, a0_171, dhcp_option_hostname.isra.0(a0_152 >> 16, (union Eq_2 *) 0xEF, dwArg14, out a0_171, out s8_492), a0_56, s4_116 >> 0x10, mstatus, dwArgE8, out s1_493, out s2_192, out s3_193, out s4_494, out s6_495, out s8_197, out mstatus_189), g_t4200DF0C, s3_193, 587783824, 67, s2_192, 587783820, s8_197, mstatus_189, s0, dwArg48, s5, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out a3_217, out a4_218, out s2_496, out s3_227, out s4_228, out mstatus_222), s3_227, a3_217, a4_218, s4_228, mstatus_222, dwArgF8, out s0_497, out s1, out a0_498, out a1_499, out a2_500, out a3, out a4_501, out a5_502, out a7_503, out s2, out s3, out s4_504, out s5, out s6, out s8_505, out mstatus);
			}
			int32 a5_270 = (word32) *((word32) s1 + 6);
			if (a5_270 != 0x00FF)
				*((word32) s1 + 6) = (byte) (a5_270 + 0x01);
			word32 a5_279;
			up32 a4_276 = (word32) *((word32) s1 + 6);
			if (a4_276 <= 0x05)
				a5_279 = (word32) (word16) ((0x01 << a4_276) + 1000);
			else
				a5_279 = 0x0EFFFA60;
			*((word32) s1 + 8) = (word16) (a5_279 + 499 ^ 500);
			a4.u0 = 500;
		}
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1;
	a3Out = a3;
	a4Out = a4;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg78;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

// 2303D8A8: Register Eq_2 dhcp_dec_pcb_refcount(Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_196827) a5Out)
// Called from:
//      dhcp_start
//      dhcp_stop
Eq_2 dhcp_dec_pcb_refcount(Eq_2 a0, Eq_2 a3, ptr32 mstatus, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_196827 & a5Out)
{
	struct Eq_196827 * a5_8 = (word32) g_b4200DF10 + ~0x00 & 0x00FF;
	g_b4200DF10 = (byte) a5_8;
	if (a5_8 != null)
	{
		a3Out = a3;
		a4Out = 0x4200DF10;
		a5Out = a5_8;
		return s1;
	}
	else
	{
		word32 * s0_15 = *a0;
		Eq_2 a3_23;
		ptr32 a4_24;
		struct Eq_196827 * a5_25;
		word32 a0_52;
		word32 a2_53;
		Eq_2 s1_26 = udp_remove(a0, a3, mstatus, out a0_52, out a2_53, out a3_23, out a4_24, out a5_25);
		*s0_15 = 0x00;
		a3Out = a3_23;
		a4Out = a4_24;
		a5Out = a5_25;
		return s1_26;
	}
}

// 2303D8E2: Register Eq_2 dhcp_handle_ack.isra.3(Register Eq_2 a0, Register (ptr32 Eq_196865) a1, Register (ptr32 Eq_196866) a4, Register out (ptr32 Eq_196867) s1Out, Register out Eq_196868 a5Out, Register out ptr32 s4Out)
// Called from:
//      dhcp_recv
Eq_2 dhcp_handle_ack.isra.3(Eq_2 a0, struct Eq_196865 * a1, struct Eq_196866 * a4, struct Eq_196867 & s1Out, union Eq_196868 & a5Out, ptr32 & s4Out)
{
	word32 a5_12 = (word32) g_b4201FD83;
	((word32) a0 + 32)->u0 = 0x00;
	((word32) a0 + 36)->u0 = 0x00;
	Eq_2 s0_111 = a0;
	if (a5_12 != 0x00)
		g_ptr4201FD64->t0028 = a0;
	struct Eq_196885 * a5_25;
	struct Eq_196886 * a5_23 = (word32) g_b4201FD84;
	if (a5_23 != null)
		a5_25 = g_ptr4201FD68;
	else
	{
		s0_111 = a5_23->t0028;
		a5_25 = a5_23 >> 1;
	}
	struct Eq_196910 * a5_40;
	a5_25->t002C = s0_111;
	if ((word32) g_b4201FD85 != 0x00)
		a5_40 = g_ptr4201FD6C;
	else
	{
		s0_111 = a4->t0028;
		a5_40 = a4 + 0x07 >>u 3;
	}
	a5_40->t0030 = s0_111;
	((word32) a1->b0013 << 24 | (((word32) a1->b0011 << 8 | (word32) a1->b0010) | (word32) a1->b0012 << 16))->t001C = s0_111;
	if ((word32) g_b4201FD86 != 0x00)
	{
		word32 a3_176;
		word32 a4_177;
		word32 a5_178;
		a0 = lwip_htonl(g_t4201FD70, out a3_176, out a4_177, out a5_178);
		*((word32) a0 + 32) = s0_111;
		((word32) s0_111 + 7)->u1 = 0x01;
	}
	else
		((word32) s0_111 + 7)->u1 = 0x00;
	if ((word32) g_b4201FD87 != 0x00)
	{
		word32 a3_179;
		word32 a4_180;
		word32 a5_181;
		a0 = lwip_htonl(g_t4201FD74, out a3_179, out a4_180, out a5_181);
		*((word32) a0 + 36) = s0_111;
	}
	Eq_196868 a5_110 = (word32) g_b4201FD88;
	if (a5_110 != 0x00)
	{
		s0_111 = *((word32) a0 + 32);
		Eq_2 a4_96;
		word32 a3_182;
		word32 a5_183;
		lwip_htonl(a0, out a3_182, out a4_96, out a5_183);
		word32 a4_184;
		word32 a5_185;
		Eq_2 a0_107 = dns_setserver(0x00, fp + ~0x13, a4_96, out a4_184, out a5_185);
		a5_110 = (word32) g_b4201FD89;
		if (a5_110 != 0x00)
		{
			s0_111 = *((word32) a0_107 + 36);
			Eq_2 a4_114;
			word32 a3_186;
			word32 a5_187;
			lwip_htonl(a0_107, out a3_186, out a4_114, out a5_187);
			word32 a4_188;
			dns_setserver(0x01, fp + ~0x13, a4_114, out a4_188, out a5_110);
		}
	}
	s1Out = &g_t4201FD80;
	a5Out = a5_110;
	s4Out = dwArg04;
	return s0_111;
}

