pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303DFB4: Register Eq_2 dhcp_renew(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_198155) s0Out, Register out (ptr32 Eq_198156) s1Out, Register out (ptr32 Eq_198157) s3Out, Register out Eq_2 s4Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_coarse_tmr
Eq_2 dhcp_renew(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, struct Eq_198155 & s0Out, struct Eq_198156 & s1Out, struct Eq_198157 & s3Out, union Eq_2 & s4Out, ptr32 & mstatusOut)
{
	Eq_2 a0_14 = *((word32) s1 + 40);
	dhcp_set_state(s1, 0x05);
	word32 a0_50;
	word32 s5_376;
	word32 s6_377;
	word32 a5_374;
	word32 s2_375;
	word32 a3_372;
	word32 a4_373;
	word32 s0_371;
	struct Eq_198156 * s1_195;
	Eq_2 s4_200;
	struct Eq_198157 * s3_197;
	ptr32 mstatus_209;
	Eq_2 ra_210 = dhcp_create_msg(ra, s0, a0_14, s1, fp + -0x0022, a4, s4, mstatus, dwLoc0C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_371, out s1_195, out a0_50, out a3_372, out a4_373, out a5_374, out s2_375, out s3_197, out s4_200, out s5_376, out s6_377, out mstatus_209);
	if (a0_50 != 0x00)
	{
		struct Eq_198207 * a5_53 = (word32) wLoc22;
		Eq_2 a0_52 = *(union Eq_2 *) 0x03;
		a5_53->b00EF = 0x39;
		((byte[]) 0xEF)[(word32) (word16) ((char *) a5_53 + 1)] = 0x02;
		Eq_2 a0_71 = dhcp_option_short((word32) (word16) ((char *) a5_53 + 2), (union Eq_2 *) 0xEF, (word32) s3_197->t0038);
		((word32) a0_71 + 0x00EF)->u1 = 55;
		((byte[]) 0xEF)[(word32) (word16) ((word32) a0_71 + 1)] = 0x04;
		uint16 wLoc22_262 = (word16) ((word32) a0_71 + 2);
		byte * a5_104 = g_a2308DE88;
		do
		{
			struct Eq_198255 * a4_92 = (word32) wLoc22_262;
			a4_92->b00EF = (byte) (word32) *a5_104;
			word32 a0_98 = a4_92 + 1 << 16;
			wLoc22_262 = (word16) (a0_98 >> 16);
			++a5_104;
		} while (a5_104 != (byte *) 3707183484);
		Eq_2 a0_117;
		ptr32 mstatus_135;
		word32 s1_137;
		Eq_2 s2_138;
		Eq_2 s3_139;
		Eq_2 s8_143;
		Eq_2 a3_160;
		Eq_2 a4_161;
		ptr32 mstatus_165;
		Eq_2 s2_169;
		Eq_2 s4_171;
		word32 s7_382;
		word32 a0_385;
		word32 s0_384;
		word32 a2_387;
		word32 a1_386;
		word32 a4_389;
		word32 a3_388;
		word32 s5_393;
		word32 a5_390;
		word32 a7_391;
		word32 s6_394;
		word32 s8_395;
		word32 s2_392;
		word32 s8_383;
		word32 s6_380;
		word32 s3_381;
		word32 s8_378;
		word32 s4_379;
		ra_210 = pbuf_free(udp_sendto_if(dhcp_option_trailer(ra_210, a0_117, dhcp_option_hostname.isra.0(a0_98 >> 16, (union Eq_2 *) 0xEF, dwArg14, out a0_117, out s8_378), a0_52, s4_200, mstatus_209, dwArgE8, out s1_137, out s2_138, out s3_139, out s4_379, out s6_380, out s8_143, out mstatus_135), g_t4200DF0C, s2_138, s1_137 + 24, 67, s3_139, s8_143, mstatus_135, s0, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out a3_160, out a4_161, out s2_169, out s3_381, out s4_171, out s7_382, out s8_383, out mstatus_165), s2_169, a3_160, a4_161, s4_171, mstatus_165, dwArgF8, out s0_384, out s1_195, out a0_385, out a1_386, out a2_387, out a3_388, out a4_389, out a5_390, out a7_391, out s2_392, out s3_197, out s4_200, out s5_393, out s6_394, out s8_395, out mstatus_209);
	}
	int32 a5_213 = (word32) s1_195->t0006;
	if (a5_213 != 0x00FF)
		s1_195->t0006 = (byte) (a5_213 + 0x01);
	word32 a5_222;
	up32 a5_219 = (word32) s1_195->t0006;
	if (a5_219 <= 0x09)
		a5_222 = (word32) (word16) (a5_219 + 2000);
	else
		a5_222 = 0x04FFFE20;
	s1_195->w0008 = (word16) (a5_222 + 499 ^ 500);
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_195;
	s3Out = s3_197;
	s4Out = s4_200;
	mstatusOut = mstatus_209;
	return ra_210;
}

// 2303E0F2: Register Eq_2 dhcp_supplied_address(Register Eq_2 a0, Register (ptr32 Eq_198384) a5, Register out ptr32 a4Out, Register out (ptr32 Eq_198384) a5Out)
// Called from:
//      dhcp_stop
Eq_2 dhcp_supplied_address(Eq_2 a0, struct Eq_198384 * a5, ptr32 & a4Out, struct Eq_198384 & a5Out)
{
	if (a0 == 0x00 || a5 == null)
	{
		a4Out = a4;
		a5Out = a5;
		return 0x00;
	}
	else
	{
		struct Eq_198384 * a5_9 = (word32) a5->b0005;
		ui32 a0_11 = 0x01;
		if (a5_9 != (struct Eq_198384 *) 0x0A)
			a0_11 = (word32) (a5_9 < (struct Eq_198384 *) -6);
		a4Out = 0x0A;
		a5Out = a5_9;
		return a0_11 & 0x00FF;
	}
}

// 2303E118: Register Eq_2 dhcp_release_and_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_198384) a5Out, Register out (ptr32 Eq_198439) s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_start
//      dhcp_coarse_tmr
//      dhcp_fine_tmr
//      dhcp_stop
Eq_2 dhcp_release_and_stop(Eq_2 ra, Eq_2 s0, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_198384 & a5Out, struct Eq_198439 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	uint16 wLoc26 = SLICE(dwLoc28, uint16, 16);
	word16 wLoc28 = (word16) dwLoc28;
	Eq_2 a0_16 = *((word32) s0 + 40);
	if (s0 != 0x00)
	{
		a5 = (word32) *((word32) s0 + 5);
		if (a5 != null)
		{
			Eq_2 s0_18 = a5->t0018;
			*((word32) s0_18 + 28) = 0x00;
			*((word32) s0_18 + 24) = 0x00;
			((word32) s0_18 + 32)->u0 = 0x00;
			((word32) s0_18 + 36)->u0 = 0x00;
			((word32) s0_18 + 48)->u0 = 0x00;
			((word32) s0_18 + 44)->u0 = 0x00;
			*((word32) s0_18 + 40) = 0x00;
			((word32) s0_18 + 0x0E)->u0 = 0x00;
			*((word32) s0_18 + 16) = 0x00;
			*((word32) s0_18 + 20) = 0x00;
			Eq_2 s1_163 = a0_16;
			Eq_2 dwLoc28_277 = dwLoc28;
			Eq_2 a5_162;
			Eq_2 a4_161;
			if (dhcp_supplied_address(a0_16, a5, out a4_161, out a5_162) != 0x00)
			{
				Eq_2 a0_63;
				word32 s0_366;
				word32 a3_367;
				word32 s2_368;
				word32 s3_369;
				word32 s5_370;
				word32 s6_371;
				ra = dhcp_create_msg(ra, s0_18, a0_16, s0_18, fp + -38, a4_161, s4, mstatus, dwLoc0C, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_366, out s1_163, out a0_63, out a3_367, out a4_161, out a5_162, out s2_368, out s3_369, out s4, out s5_370, out s6_371, out mstatus);
				s3 = a0_63;
				if (a0_63 != 0x00)
				{
					Eq_198546 s2_65 = *((word32) a0_63 + 4);
					int32 a5_66 = (word32) wLoc26;
					(word32) s2_65 + 0x00F0 + a5_66 = (byte *) 0x36;
					(word32) (word16) (a5_66 + 0x01) + ((word32) s2_65 + 0x00F0) = (byte *) 0x04;
					uint32 s4_79 = a5_66 + 2 << 16;
					word32 a3_372;
					word32 a4_373;
					word32 a5_374;
					Eq_2 a0_89 = dhcp_option_long(s4_79 >> 0x10, (word32) s2_65 + 0x00F0, lwip_htonl(a0_63, out a3_372, out a4_373, out a5_374));
					ptr32 mstatus_104;
					Eq_2 s1_106;
					Eq_2 s3_108;
					Eq_2 s8_112;
					Eq_2 a3_129;
					Eq_2 a4_130;
					ptr32 mstatus_134;
					Eq_2 s3_139;
					Eq_2 s4_140;
					word32 s2_375;
					word32 s4_376;
					word32 s6_377;
					word32 s2_378;
					word32 s8_379;
					word32 s0_380;
					word32 a0_381;
					word32 a1_382;
					word32 a2_383;
					word32 a3_384;
					word32 a7_385;
					word32 s2_386;
					word32 s5_387;
					word32 s6_388;
					word32 s8_389;
					ra = pbuf_free(udp_sendto_if(dhcp_option_trailer(ra, a0_89, (word32) s2_65 + 0x00F0, a0_63, s4_79 >> 0x10, mstatus, dwArgE8, out s1_106, out s2_375, out s3_108, out s4_376, out s6_377, out s8_112, out mstatus_104), g_t4200DF0C, s3_108, fp + -36, 67, s1_106, s8_112, mstatus_104, s0, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out a3_129, out a4_130, out s2_378, out s3_139, out s4_140, out s7, out s8_379, out mstatus_134), s3_139, a3_129, a4_130, s4_140, mstatus_134, dwArgF8, out s0_380, out s1_163, out a0_381, out a1_382, out a2_383, out a3_384, out a4_161, out a5_162, out a7_385, out s2_386, out s3, out s4, out s5_387, out s6_388, out s8_389, out mstatus);
					dwLoc28_277 = SEQ((word16) a0_89, wLoc28);
				}
			}
			Eq_2 s0_205;
			word32 a1_390;
			word32 a2_391;
			word32 a5_392;
			ra = netif_set_addr(ra, s1_163, s1_163, &g_t2308DE8C, 587783820, 587783820, a4_161, a5_162, s3, s4, s7, mstatus, dwLoc2C, dwLoc28_277, dwLoc18, dwLoc08, dwLoc04, dwArg14, dwArg18, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg58, dwArg68, dwArg88, dwArgF8, dwArg0108, out s0_205, out s1, out a1_390, out a2_391, out a3, out a4, out a5_392, out s2, out s3, out s4, out s5, out s6, out s7, out mstatus);
			dhcp_set_state(s0_205, 0x00);
			a5 = (word32) *((word32) s0_205 + 4);
			if (a5 != null)
			{
				s1 = dhcp_dec_pcb_refcount(s0_205, a3, mstatus, out a3, out a4, out a5);
				((word32) s0_205 + 4)->u1 = 0x00;
			}
		}
	}
	0x00 = (uint16) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1;
	a3Out = a3;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

// 2303E222: Register Eq_2 dhcp_start(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178, Register out Eq_2 s1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_coarse_tmr
//      dhcp_fine_tmr
Eq_2 dhcp_start(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0178, union Eq_2 & s1Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 s1_12 = ~0x0F;
	if (a0 != 0x00)
	{
		ui32 a5_14 = (word32) *((word32) a0 + 65);
		s1_12.u0 = ~0x0F;
		a5 = a5_14 & 0x01;
		if ((a5_14 & 0x01) == 0x00)
			goto l2303E28C;
		a4 = (word32) *((word32) a0 + 56);
		a5.u0 = 575;
		s2 = *((word32) a0 + 40);
		if (a4 <= 575)
		{
l2303E24A:
			s1_12.u0 = ~0x00;
			goto l2303E28C;
		}
		if (s2 == 0x00)
		{
			Eq_2 a0_33;
			word32 a1_317;
			word32 a3_318;
			word32 a7_319;
			word32 s2_320;
			word32 s8_321;
			mem_malloc(ra, a0, 52, a3, a4, s2, mstatus, dwArg04, dwArg24, dwArg84, dwArgD8, dwArgF8, dwArg0118, dwArg0138, dwArg0178, out a0_33, out a1_317, out a3_318, out a4, out a5, out a7_319, out s2_320, out s3, out s4, out s5, out s6, out s8_321);
			s2 = a0_33;
			if (a0_33 == 0x00)
				goto l2303E24A;
			*((word32) a0_33 + 40) = a0;
		}
		else if ((word32) *((word32) s2 + 4) != 0x00)
		{
			word32 a3_331;
			word32 a4_332;
			word32 a5_333;
			dhcp_dec_pcb_refcount(a0, a3, mstatus, out a3_331, out a4_332, out a5_333);
		}
		Eq_2 a0_62;
		Eq_2 a3_65;
		Eq_2 a4_66;
		Eq_2 a0_74;
		word32 t1_327;
		word32 a1_328;
		word32 a2_329;
		word32 a5_330;
		ra = dhcp_inc_pcb_refcount(memset(ra, s2, 0x00, 52, out t1_327, out a0_62, out a1_328, out a2_329, out a3_65, out a4_66, out a5_330), a0_62, a3_65, a4_66, mstatus, dwArg18, dwArg28, out a0_74, out a4, out a5, out s2);
		s1_12 = a0_74;
		if (a0_74 != 0x00)
			goto l2303E24A;
		((word32) s2 + 4)->u1 = 0x01;
		if (((word32) *((word32) a0 + 65) & 0x04) == 0x00)
			a5 = dhcp_set_state(s2, 0x02);
		else
		{
			Eq_2 a0_97;
			Eq_2 s0_107;
			word32 s1_322;
			word32 a3_323;
			ra = dhcp_discover(ra, a0, a0_74, a4, s4, mstatus, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s0_107, out s1_322, out a0_97, out a3_323, out a4, out a5, out s2, out s3, out s4, out s5, out s6, out mstatus);
			s1_12 = a0_97;
			if (a0_97 != 0x00)
			{
				word32 s0_324;
				word32 s1_325;
				word32 a3_326;
				ra = dhcp_release_and_stop(ra, s0_107, s3, s4, s7, mstatus, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, out s0_324, out s1_325, out a3_326, out a4, out a5, out s2, out s3, out s4, out s5, out s6, out s7, out mstatus);
				goto l2303E24A;
			}
		}
	}
l2303E28C:
	0x00 = (uint16) dwArg38;
	s1Out = s1_12;
	a4Out = a4;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

// 2303E2B8: void dhcp_coarse_tmr(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register Eq_2 s4, Register word32 s8, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack word32 dwArg0198)
void dhcp_coarse_tmr(Eq_2 ra, Eq_2 s1, Eq_2 s2, Eq_2 s4, word32 s8, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0138, word32 dwArg0198)
{
	Eq_2 a5_112 = 0x42020000;
	Eq_2 s0_33 = g_t4201FD90;
	uint16 wLoc32_518 = SLICE(s8, uint16, 16);
	Eq_2 s3_140 = 0x01;
	Eq_2 s4_141 = 0x02000710;
	Eq_2 s7_254 = 0x2308E000;
	s1_138 = s1;
	while (true)
	{
		Eq_2 s1_138;
		if (s0_33 == 0x00)
			break;
		Eq_2 s0_345;
		Eq_2 s0_115 = *((word32) a5_112 + 40);
		if (a5_112 != 0x00 && (word32) (*((word32) a5_112 + 5)) != 0x00)
		{
			uint32 a3_38 = (word32) *((word32) a5_112 + 20);
			if (a3_38 != 0x00)
			{
				uint32 a4_41 = (word32) *((word32) a5_112 + 18) + 0x01 << 16;
				*((word32) a5_112 + 18) = (word16) (a4_41 >> 16);
				if (a3_38 != a4_41 >> 16)
					goto l2303E33A;
				Eq_2 a3_351;
				ptr32 mstatus_355;
				Eq_2 s4_362;
				Eq_2 s7_365;
				word32 s2_961;
				word32 a5_960;
				word32 s1_958;
				word32 a4_959;
				word32 a4_965;
				word32 s6_964;
				word32 s3_962;
				word32 s5_963;
				word32 s2_966;
				word32 s5_967;
				word32 s6_968;
				ra = dhcp_start(dhcp_release_and_stop(ra, s0_115, s3_140, s4_141, s7_254, mstatus, s4, s2, dwLoc18, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s0_345, out s1_958, out a3_351, out a4_959, out a5_960, out s2_961, out s3_962, out s4_362, out s5_963, out s6_964, out s7_365, out mstatus_355), s0_345, a3_351, s4_362, s7_365, mstatus_355, dwLoc3C, dwLoc38, s2, dwLoc1C, dwLoc18, dwLoc14, dwLoc0C, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg38, dwArg44, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0138, out s1_138, out a4_965, out a5_112, out s2_966, out s3_140, out s4_141, out s5_967, out s6_968, out s7_254, out mstatus);
				s0_115 = s0_345;
				goto l2303E336;
			}
l2303E33A:
			Eq_2 a4_46 = (word32) *((word32) a5_112 + 16);
			if (a4_46 != 0x00)
			{
				*((word32) a5_112 + 16) = (word16) ((word32) a4_46 - 1);
				if (a4_46 != s3_140)
					goto l2303E486;
				s0_115 = *((word32) s1_138 + 40);
				a5_112.u0 = 0x0A;
				Eq_2 a4_117 = (word32) *((word32) s1_138 + 5);
				if (a4_117 <= 0x0A)
				{
					uint32 a5_119 = 0x0432 >> a4_117;
					a5_112 = a5_119 & 0x01;
					if ((a5_119 & 0x01) != 0x00)
					{
						dhcp_set_state(s1_138, 0x04);
						ptr32 s5_142;
						struct Eq_199080 * a0_152;
						word32 a5_971;
						word32 a3_969;
						word32 a4_970;
						word32 s2_972;
						word32 s6_973;
						ra = dhcp_create_msg(ra, s0_115, s0_115, s1_138, fp + -50, a4_117, s4_141, mstatus, dwLoc1C, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out s0_115, out s1_138, out a0_152, out a3_969, out a4_970, out a5_971, out s2_972, out s3_140, out s4_141, out s5_142, out s6_973, out mstatus);
						if (a0_152 != null)
						{
							union Eq_2 * s2_154 = a0_152->ptr0004;
							int32 a5_155 = (word32) wLoc32_518;
							Mem163[s2_154 + 0x00F0 + a5_155:byte] = 0x39;
							Mem166[CONVERT(SLICE(a5_155 + 0x01, word16, 0), word16, word32) + (s2_154 + 0x00F0):byte] = 0x02;
							word32 a0_172 = dhcp_option_short((word32) (word16) (a5_155 + 2), s2_154 + 0x00F0, CONVERT(Mem166[s0_115 + 56:uint16], uint16, word32));
							Mem178[s2_154 + 0x00F0 + a0_172:byte] = 55;
							Mem184[CONVERT(SLICE(a0_172 + 1, word16, 0), word16, word32) + (s2_154 + 0x00F0):byte] = 0x04;
							uint16 wLoc32_520 = SLICE(a0_172 + 0x02, word16, 0);
							int32 a5_187;
							for (a5_187 = 0x00; a5_187 != 0x04; ++a5_187)
							{
								int32 a4_191 = (word32) wLoc32_520;
								Mem201[a4_191 + (s2_154 + 0x00F0):byte] = SLICE(CONVERT(Mem190[s5_142 + a5_187:byte], byte, word32), byte, 0);
								uint32 a0_197 = a4_191 + 1 << 16;
								wLoc32_520 = (word16) (a0_197 >> 16);
							}
							wLoc32_518 = (word16) a0_216;
							Eq_2 s8_210;
							Eq_2 a0_216;
							ptr32 mstatus_233;
							struct Eq_199186 * s6_240;
							Eq_2 s8_241;
							Eq_2 a3_260;
							Eq_2 a4_261;
							ptr32 mstatus_265;
							Eq_2 s4_271;
							Eq_2 s8_275;
							word32 s3_979;
							word32 a4_984;
							word32 s6_989;
							word32 s2_975;
							word32 s1_974;
							word32 s3_976;
							word32 s4_977;
							word32 s2_978;
							word32 a0_980;
							word32 a1_981;
							word32 a2_982;
							word32 s2_987;
							word32 a3_983;
							word32 a5_985;
							word32 a7_986;
							word32 s5_988;
							word32 s8_990;
							ra = pbuf_free(udp_sendto_if(dhcp_option_trailer(ra, a0_216, s2_154 + 0x00F0, s8_210, s4_141, mstatus, dwArgD8, out s1_974, out s2_975, out s3_976, out s4_977, out s6_240, out s8_241, out mstatus_233), Mem221[s6_240 + -244:int32], s8_241, s7_254 + -368, 67, dhcp_option_hostname.isra.0(a0_197 >>u 16, s2_154 + 0x00F0, dwArg04, out a0_216, out s8_210), s8_241, mstatus_233, s4, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out a3_260, out a4_261, out s2_978, out s3_979, out s4_271, out s7_254, out s8_275, out mstatus_265), s8_275, a3_260, a4_261, s4_271, mstatus_265, dwArgE8, out s0_115, out s1_138, out a0_980, out a1_981, out a2_982, out a3_983, out a4_984, out a5_985, out a7_986, out s2_987, out s3_140, out s4_141, out s5_988, out s6_989, out s8_990, out mstatus);
						}
						int32 a5_312 = (word32) *((word32) s1_138 + 6);
						if (a5_312 != 0x00FF)
							*((word32) s1_138 + 6) = (byte) (a5_312 + 0x01);
						up32 a4_318 = (word32) *((word32) s1_138 + 6);
						Eq_2 a5_322 = s4_141;
						if (a4_318 <= 0x09)
							a5_322 = (word32) (word16) (a4_318 + 1000);
						word32 a4_333 = (word32) *((word32) s1_138 + 18);
						*((word32) s1_138 + 8) = (word16) ((word32) a5_322 + 499 ^ 500);
						a5_112 = (word32) *((word32) s1_138 + 20) - a4_333;
						if (s3_140 < a5_112)
						{
							*((word32) s1_138 + 16) = (word16) (a5_112 >> 1);
							a5_112 >>= 1;
						}
					}
				}
				goto l2303E336;
			}
l2303E486:
			Eq_2 a4_53 = (word32) *((word32) a5_112 + 0x0E);
			if (a4_53 == 0x00)
				goto l2303E336;
			*((word16) a5_112.u0 + 0x0E) = (word16) ((word32) a4_53 - 1);
			if (a4_53 != s3_140)
				goto l2303E336;
			a5_112 = (word32) *((word32) s1_138 + 5);
			s0_115 = *((word32) s1_138 + 40);
			Eq_2 a4_62 = a5_112 & 0x00FB;
			if ((a5_112 & 0x00FB) != s3_140)
			{
				a4_62.u0 = 0x0A;
				if (a5_112 == 0x0A)
					goto l2303E4AE;
			}
			else
			{
l2303E4AE:
				ra = dhcp_renew(ra, s0_115, s1_138, a4_62, s4_141, mstatus, s4, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out s0_115, out s1_138, out s3_140, out s4_141, out mstatus);
				a5_112.u0 = (uint16) (*((word32) s1_138 + 0x0C) - *((word32) s1_138 + 18));
				if (s3_140 < a5_112)
				{
					*((word32) s1_138 + 0x0E) = (word16) (a5_112 >> 1);
					a5_112 >>= 1;
				}
			}
		}
l2303E336:
		s0_33 = *s0_115;
	}
	0x00 = dwArg0198;
}

