pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303E4CA: void dhcp_fine_tmr(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD0, Stack Eq_2 dwArgD4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void dhcp_fine_tmr(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD0, Eq_2 dwArgD4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	Eq_2 s0_262 = g_t4201FD90;
	Eq_2 s1_113 = 0x01;
	Eq_2 s2_114 = 0x0C;
	Eq_2 s3_115 = 0x06;
	Eq_2 s4_116 = 0x08;
	Eq_2 s5_117 = 0x03;
	up32 s6_118 = 0x05;
	while (s0_262 != 0x00)
	{
		Eq_2 s0_135;
		Eq_2 s0_193 = *((word32) a4 + 40);
		if (a4 != 0x00)
		{
			Eq_2 a5_32 = (word32) *((word32) a4 + 8);
			if (s1_113 < a5_32)
			{
				((word32) a4 + 8)->u0 = (word16) ((word32) a5_32 - 1);
				goto l2303E518;
			}
			if (a5_32 != s1_113)
				goto l2303E518;
			((word32) a4 + 8)->u0 = 0x00;
			s0_193 = *((word32) a4 + 40);
			Eq_2 a5_36 = (word32) *((word32) a4 + 5);
			if (a5_36 != s2_114 && a5_36 != s3_115)
			{
				if (a5_36 == s1_113)
				{
					if (s6_118 >= (word32) (*((word32) a4 + 6)))
					{
						word32 a3_547;
						ra = dhcp_select(ra, s0_193, s1_113, s0_193, a4, s4_116, s5_117, mstatus, dwLoc0C, dwArg28, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s0_193, out s1_113, out a3_547, out a4, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out mstatus);
					}
					else
					{
						Eq_2 a3_141;
						ptr32 mstatus_145;
						Eq_2 s4_152;
						Eq_2 s7_155;
						word32 s2_542;
						word32 s1_539;
						word32 a4_540;
						word32 a5_541;
						word32 s3_543;
						word32 s5_544;
						word32 s6_545;
						word32 a5_546;
						ra = dhcp_start(dhcp_release_and_stop(ra, s0_193, s3_115, s4_116, s7, mstatus, dwLoc0C, dwLoc08, dwArg08, dwArg18, dwArg1C, dwArg24, dwArg28, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s0_135, out s1_539, out a3_141, out a4_540, out a5_541, out s2_542, out s3_543, out s4_152, out s5_544, out s6_545, out s7_155, out mstatus_145), s0_135, a3_141, s4_152, s7_155, mstatus_145, s4, s2, dwLoc08, dwArg04, dwArg08, dwArg0C, dwArg14, dwArg18, dwArg28, dwArg38, dwArg48, dwArg58, s3, s1, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0118, dwArg0158, out s1_113, out a4, out a5_546, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out s7, out mstatus);
						s0_193 = s0_135;
					}
					goto l2303E518;
				}
				if (a5_36 == s4_116)
				{
					Eq_2 a5_71 = (word32) *((word32) a4 + 6);
					if (s1_113 >= a5_71)
					{
						word32 a3_549;
						ra = dhcp_check(ra, s0_193, s4_116, mstatus, s4, dwArg08, dwArg18, dwArg28, dwArg44, dwArg48, dwArg58, s1, dwArg70, dwArg74, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB4, dwArgB8, dwArgC8, dwArgD0, dwArgD4, dwArgD8, dwArgF8, dwArg0148, out s1_113, out a3_549, out a4, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out s7, out mstatus);
					}
					else
					{
						word32 a3_548;
						ra = dhcp_bind(ra, s0_193, s1_113, s0_193, a5_71, s3_115, s4_116, s7, mstatus, s2, s0, dwArg04, dwArg08, dwArg18, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg58, dwArg78, dwArgE8, dwArgF8, out s0_193, out s1_113, out a3_548, out a4, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out s7, out mstatus);
					}
					goto l2303E518;
				}
				if (a5_36 != s5_117)
					goto l2303E518;
				if (s1_113 < (word32) (*((word32) a4 + 6)))
					goto l2303E534;
				ra = dhcp_reboot(ra, s0_193, s1_113, a4, s4_116, s5_117, mstatus, dwLoc0C, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s0_193, out s1_113, out a4, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out mstatus);
			}
			else
			{
l2303E534:
				word32 a0_550;
				word32 a3_551;
				word32 a5_552;
				ra = dhcp_discover(ra, s0_193, s1_113, a4, s4_116, mstatus, dwArg38, dwArg48, dwArg58, s1, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArg0108, out s0_193, out s1_113, out a0_550, out a3_551, out a4, out a5_552, out s2_114, out s3_115, out s4_116, out s5_117, out s6_118, out mstatus);
			}
		}
l2303E518:
		s0_262 = *s0_193;
	}
	0x00 = (uint16) dwArgA8;
}

// 2303E588: Register Eq_2 dhcp_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Register out ptr32 s1Out, Register out ptr32 s3Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcpd_start
Eq_2 dhcp_stop(Eq_2 ra, Eq_2 s0, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0128, ptr32 & s1Out, ptr32 & s3Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	ptr32 mstatus_22;
	ptr32 s1_24;
	ptr32 s3_28;
	ptr32 s7_32;
	word32 s0_63;
	word32 a3_64;
	word32 a4_65;
	word32 a5_66;
	word32 s2_67;
	word32 s4_68;
	word32 s5_69;
	word32 s6_70;
	Eq_2 ra_23 = dhcp_release_and_stop(ra, s0, s3, s4, s7, mstatus, dwArg14, dwArg18, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0128, out s0_63, out s1_24, out a3_64, out a4_65, out a5_66, out s2_67, out s3_28, out s4_68, out s5_69, out s6_70, out s7_32, out mstatus_22);
	s1Out = s1_24;
	s3Out = s3_28;
	s7Out = s7_32;
	mstatusOut = mstatus_22;
	return ra_23;
}

// 2303E58C: Register Eq_2 etharp_free_entry(Register Eq_2 ra, Register (ptr32 Eq_199631) a0, Register Eq_2 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_199631) s1Out, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out (ptr32 Eq_2) s2Out, Register out ptr32 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      etharp_find_entry
//      etharp_cleanup_netif
//      etharp_tmr
Eq_2 etharp_free_entry(Eq_2 ra, struct Eq_199631 * a0, Eq_2 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg0118, struct Eq_199631 & s1Out, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	struct Eq_199631 * s1_17 = a0;
	int32 s0_18 = 0x420150BC;
	union Eq_2 * s2_19 = &a0->t420150D4;
	Eq_2 a0_20 = a0->t420150D4;
	if (a0_20 != 0x00)
	{
		word32 a1_115;
		word32 a2_116;
		word32 a4_117;
		word32 a5_118;
		word32 a7_119;
		word32 s8_120;
		ra = pbuf_free(ra, a0_20, a3, &a0->b0007 + 0x0011, s4, mstatus, dwArg0118, out s0_18, out s1_17, out a0_20, out a1_115, out a2_116, out a3, out a4_117, out a5_118, out a7_119, out s2_19, out s3, out s4, out s5, out s6, out s8_120, out mstatus);
		*s2_19 = (union Eq_2 *) 0x00;
	}
	(&(&s1_17->b0007 + 0x0011 + s0_18 / 1107382488)->b0007)[0x0D] = 0x00;
	0x00 = (uint16) dwArg38;
	s1Out = s1_17;
	a0Out = a0_20;
	a3Out = a3;
	s2Out = s2_19;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

// 2303E5D2: Register Eq_2 etharp_find_entry(Register Eq_2 ra, Register Eq_2 a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8, Register out ptr32 s0Out, Register out (ptr32 Eq_199631) s1Out, Register out (ptr32 Eq_199631) a0Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 mstatusOut)
// Called from:
//      etharp_input
//      etharp_query
Eq_2 etharp_find_entry(Eq_2 ra, Eq_2 a0, word32 a1, Eq_2 a2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgF8, ptr32 & s0Out, struct Eq_199631 & s1Out, struct Eq_199631 & a0Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & mstatusOut)
{
	Eq_2 a3_145 = 0x420150BC;
	up32 t0_16 = 0x00;
	up32 t6_17 = 0x00;
	up32 t5_18 = 0x00;
	struct Eq_199631 * t1_105 = (struct Eq_199631 *) 0x0A;
	struct Eq_199631 * a5_185 = null;
	struct Eq_199631 * a4_161 = (struct Eq_199631 *) 0x0A;
	struct Eq_199631 * a7_22 = (struct Eq_199631 *) 0x0A;
	struct Eq_199631 * s1_100 = (struct Eq_199631 *) 0x0A;
	ptr32 s0_180 = 0x420150BC;
	do
	{
		word32 t4_29 = (word32) *((word32) a3_145 + 20);
		if (a4_161 == (struct Eq_199631 *) 0x0A)
		{
			if (t4_29 != 0x00)
				goto l2303E60A;
			a4_161 = a5_185;
		}
		else if (t4_29 != 0x00)
		{
l2303E60A:
			if (a0 != 0x00)
			{
				s2 = *a0;
				if (s2 == *((word32) a3_145 + 4) && (a2 == 0x00 || *((word32) a3_145 + 8) == a2))
					goto l2303E6A0;
			}
			up32 a6_45 = (word32) *((word32) a3_145 + 18);
			if (t4_29 == 0x01)
			{
				if (*a3_145 != 0x00)
				{
					if (a6_45 >= t5_18)
					{
						t5_18 = a6_45;
						t1_105 = a5_185;
					}
				}
				else if (a6_45 >= t6_17)
				{
					t6_17 = a6_45;
					s1_100 = a5_185;
				}
			}
			else if (a6_45 >= t0_16)
			{
				t0_16 = a6_45;
				a7_22 = a5_185;
			}
		}
		word32 a6_72 = (word32) (word16) &a5_185->b0001;
		a3_145 = (word32) a3_145 + 24;
		a5_185 = (int32) (word16) a6_72;
	} while (a6_72 != 0x0A);
	a3_145.u0 = 0x01;
	a5_185 = (struct Eq_199631 *) ~0x00;
	if (a1 == 0x01)
	{
		s3 = a2;
		s2 = a0;
		if (a4_161 == (struct Eq_199631 *) 0x0A)
		{
			if (a7_22 == a4_161)
			{
				if (s1_100 == a7_22)
				{
					if (t1_105 == s1_100)
						goto l2303E6A0;
					s1_100 = t1_105;
				}
			}
			else
				s1_100 = a7_22;
			word32 a0_351;
			word32 s4_352;
			ra = etharp_free_entry(ra, s1_100, 0x01, s4, mstatus, dwArg18, dwArgF8, out s1_100, out a0_351, out a3_145, out s2, out s3, out s4_352, out s5, out s6, out mstatus);
			a4_161 = s1_100;
		}
		if (s2 != 0x00)
		{
			a3_145 = *s2;
			*((word16) a3_145.u0 + 4) = &a4_161->t420150D4;
		}
		struct Eq_199819 * a5_178 = &a4_161->b0007 + 0x0011;
		a5_178->w420150CE = 0x00;
		a5_178->t420150C4 = s3;
		s0_180 = (char *) a5_178 + 0x420150BC;
		a5_185 = a4_161;
	}
l2303E6A0:
	s0Out = s0_180;
	s1Out = s1_100;
	a0Out = a5_185;
	a3Out = a3_145;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	mstatusOut = mstatus;
	return ra;
}

