pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303E6CC: Register Eq_2 etharp_raw(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0198, Register out ptr32 s0Out, Register out (ptr32 Eq_199860) s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_199864 a4Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      etharp_input
//      etharp_request
//      etharp_output_to_arp_index
Eq_2 etharp_raw(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0198, ptr32 & s0Out, struct Eq_199860 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_199864 & a4Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	ptr32 a0_213;
	word32 a0_47;
	struct Eq_199874 * s0_52;
	struct Eq_199875 * s1_53;
	Eq_2 s8_54;
	Eq_2 s4_60;
	Eq_2 a7_62;
	word32 a2_312;
	word32 a5_313;
	Eq_2 s3_199;
	ptr32 s2_198;
	ptr32 mstatus_211;
	Eq_199864 a4_195;
	ptr32 a3_194;
	ptr32 a1_193;
	ptr32 s5_203;
	Eq_2 s6_204;
	Eq_2 ra_212 = pbuf_alloc(ra, s0, 0x42020000, 0x008E, 0x1C, 640, a3, a4, mstatus, dwLoc3C, dwArg04, dwArg68, dwArg78, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s0_52, out s1_53, out a0_47, out a1_193, out a2_312, out a3_194, out a4_195, out a5_313, out a7_62, out s2_198, out s3_199, out s4_60, out s5_203, out s6_204, out s8_54, out mstatus_211);
	struct Eq_199860 * s1_197 = (char *) s1_53 - 616;
	if (a0_47 == 0x00)
	{
		s1_53->wFFFFFDBC = (word16) ((word32) s1_53->wFFFFFDBC + 0x01);
		a0_213 = ~0x00;
	}
	else
	{
		Eq_2 a0_74 = s0_52->t0004;
		word32 a5_314;
		Eq_2 a0_77 = lwip_htons(a7_62, out a5_314);
		s0_52->b0006 = (byte) a0_77;
		s0_52->b0007 = (byte) (a0_77 >> 8);
		word32 a1_315;
		word32 a2_316;
		word32 a3_317;
		word32 a4_318;
		word32 a5_319;
		word32 a6_320;
		word32 a7_321;
		memcpy(&s0_52->b0007 + 1, a3, 0x06, out a1_315, out a2_316, out a3_317, out a4_318, out a5_319, out a6_320, out a7_321);
		word32 a1_322;
		word32 a2_323;
		word32 a3_324;
		word32 a4_325;
		word32 a5_326;
		word32 a6_327;
		word32 a7_328;
		memcpy(&s0_52->b0007 + 11, s8_54, 0x06, out a1_322, out a2_323, out a3_324, out a4_325, out a5_326, out a6_327, out a7_328);
		word32 a1_329;
		word32 a2_330;
		word32 a3_331;
		word32 a4_332;
		word32 a5_333;
		word32 a6_334;
		word32 a7_335;
		memcpy(&s0_52->b0007 + 7, a4, 0x04, out a1_329, out a2_330, out a3_331, out a4_332, out a5_333, out a6_334, out a7_335);
		word32 a1_336;
		word32 a2_337;
		word32 a3_338;
		word32 a4_339;
		word32 a5_340;
		word32 a6_341;
		word32 a7_342;
		memcpy(&s0_52->b0007 + 0x0011, s6_204, 0x04, out a1_336, out a2_337, out a3_338, out a4_339, out a5_340, out a6_341, out a7_342);
		s0_52->b0001 = 0x01;
		s0_52->b0002 = 0x08;
		s0_52->t0004.u1 = 0x06;
		s0_52->b0005 = 0x04;
		s0_52->b0000 = 0x00;
		s0_52->b0003 = 0x00;
		Eq_2 a3_165;
		Eq_2 a4_166;
		struct Eq_200053 * s1_169;
		Eq_2 s2_170;
		Eq_2 s4_172;
		word32 s0_343;
		word32 s3_344;
		Eq_2 ra_178 = ethernet_output(ra_212, s3_199, a0_74, s4_60, 0x00FFF806, dwLoc08, dwArg18, dwArg34, dwArgA4, dwArgC0, dwArgC4, dwArgE8, out s0_343, out s1_169, out a3_165, out a4_166, out s2_170, out s3_344, out s4_172);
		s1_169->w0018 = (word16) ((word32) s1_169->w0018 + 0x01);
		word32 s0_345;
		word32 a0_346;
		word32 a2_347;
		word32 a5_348;
		word32 a7_349;
		word32 s4_350;
		word32 s8_351;
		ra_212 = pbuf_free(ra_178, s2_170, a3_165, a4_166, s4_172, mstatus_211, dwArgE8, out s0_345, out s1_197, out a0_346, out a1_193, out a2_347, out a3_194, out a4_195, out a5_348, out a7_349, out s2_198, out s3_199, out s4_350, out s5_203, out s6_204, out s8_351, out mstatus_211);
		a0_213 = 0x00;
	}
	0x00 = (uint16) dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_197;
	a0Out = a0_213;
	a1Out = a1_193;
	a3Out = a3_194;
	a4Out = a4_195;
	s2Out = s2_198;
	s3Out = s3_199;
	s4Out = dwLoc14;
	s5Out = s5_203;
	s6Out = s6_204;
	s7Out = a4;
	mstatusOut = mstatus_211;
	return ra_212;
}

// 2303E7BE: Register (ptr32 Eq_200126) etharp_cleanup_netif(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArgF8, Register out ptr32 s4Out)
// Called from:
//      netif_set_down
struct Eq_200126 * etharp_cleanup_netif(Eq_2 ra, Eq_2 a0, Eq_2 a3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArgF8, ptr32 & s4Out)
{
	Eq_2 s3_16 = a0;
	struct Eq_200126 * s0_17 = &g_t420150BC;
	struct Eq_199631 * s1_18 = null;
	struct Eq_199631 * s2_19 = (struct Eq_199631 *) 0x0A;
	do
	{
		Eq_2 a5_22 = (word32) s0_17->b0014;
		if (a5_22 != 0x00)
		{
			s0_17 = (struct Eq_200126 *) *((word32) a5_22 + 8);
			if (a5_22 == s3_16)
			{
				word32 a0_141;
				word32 s5_142;
				word32 s6_143;
				ra = etharp_free_entry(ra, s1_18, a3, s4, mstatus, dwArg18, dwArgF8, out s1_18, out a0_141, out a3, out s2_19, out s3_16, out s4, out s5_142, out s6_143, out mstatus);
			}
		}
		s1_18 = (struct Eq_199631 *) &s1_18->b0001;
		++s0_17;
	} while (s1_18 != s2_19);
	s4Out = dwArg04;
	return s0_17;
}

// 2303E800: void etharp_input(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0158, Stack word32 dwArg0198)
// Called from:
//      ethernet_input
void etharp_input(Eq_2 ra, Eq_2 s1, Eq_2 a1, Eq_2 a3, Eq_2 s2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0158, word32 dwArg0198)
{
	if (a1 == 0x00)
		return;
	Eq_2 s3_130 = *((word32) s1 + 4);
	Eq_2 a4_227 = 0x0100;
	struct Eq_200212 * s2_120 = &g_t4201FD98;
	if (((word32) *((word32) s1 + 1) << 8 | (word32) (*s1)) == 0x0100)
	{
		a4_227 = (word32) *((word32) s1 + 4);
		if (a4_227 == 0x06)
		{
			a4_227 = (word32) *((word32) s1 + 5);
			if (a4_227 == 0x04)
			{
				a4_227.u0 = 0x08;
				if (((word32) *((word32) s1 + 3) << 8 | (word32) (*((word32) s1 + 2))) == 0x08)
				{
					word32 s5_134;
					word32 s6_101;
					g_w4201FDB2 = (word16) ((word32) g_w4201FDB2 + 0x01);
					word32 a2_590;
					word32 a3_591;
					word32 a1_589;
					word32 a7_595;
					word32 a4_592;
					word32 a5_593;
					word32 a6_594;
					memcpy(fp + -56, (word32) s1 + 0x0E, 0x04, out a1_589, out a2_590, out a3_591, out a4_592, out a5_593, out a6_594, out a7_595);
					word32 a4_64;
					word32 a5_65;
					word32 a7_599;
					word32 a2_597;
					word32 a6_598;
					word32 a1_596;
					memcpy(fp + -52, (word32) s1 + 24, 0x04, out a1_596, out a2_597, out a3, out a4_64, out a5_65, out a6_598, out a7_599);
					s4 = (word32) s1 + 8;
					if (a5_65 != 0x00 && a5_65 == a4_64)
					{
						s5_134 = 0x01;
						s6_101 = 0x01;
					}
					else
					{
						s5_134 = 0x00;
						s6_101 = 0x02;
					}
					Eq_2 s1_119;
					Eq_2 s0_118 = dwArg04;
					s1_119 = s1;
					if (fp != ~0x33)
					{
						s1_119 = s1;
						ui32 a5_95;
						word32 a4_600;
						if (ip4_addr_isbroadcast_u32(fp + -52, dwArg04, out a3, out a4_600, out a5_95) == null)
						{
							s0_118 = dwArgA4;
							s1_119 = s1;
							if ((a5_95 & 0x00F0) != 224)
							{
								struct Eq_200367 * a0_111;
								word32 s6_601;
								ra = etharp_find_entry(ra, fp + -56, s6_101, dwArgA4, (word32) s1 + 8, mstatus, s2, dwArgB8, out s0_118, out s1_119, out a0_111, out a3, out s2_120, out s3_130, out s4, out s5_134, out s6_601, out mstatus);
								if (a0_111 >= null)
								{
									a0_111->b420150E8 = 0x02;
									a0_111->t420150DC = s0_118;
									word32 a5_605;
									word32 a6_606;
									word32 a7_607;
									word32 a1_602;
									word32 a2_603;
									word32 a4_604;
									memcpy((char *) &a0_111->t420150DC + 4, s4, 0x06, out a1_602, out a2_603, out a3, out a4_604, out a5_605, out a6_606, out a7_607);
									Eq_2 s7_162 = a0_111->t420150D4;
									a0_111->w420150E6 = 0x00;
									if (s7_162 != 0x00)
									{
										a0_111->t420150D4.u0 = 0x00;
										Eq_2 a3_174;
										Eq_2 a4_175;
										Eq_2 s4_181;
										word32 a7_617;
										word32 s6_618;
										word32 s8_619;
										word32 a2_614;
										word32 a4_615;
										word32 a5_616;
										word32 s3_611;
										word32 a0_612;
										word32 a1_613;
										word32 s0_608;
										word32 s1_609;
										word32 s2_610;
										ra = pbuf_free(ethernet_output(ra, s0_118, s7_162, (word32) s0_118 + 58, 0x00FFF800, dwLoc08, dwArg18, dwArg34, dwArgA4, dwArgC0, dwArgC4, dwArgE8, out s0_608, out s1_609, out a3_174, out a4_175, out s2_610, out s3_611, out s4_181), s7_162, a3_174, a4_175, s4_181, mstatus, dwArgE8, out s0_118, out s1_119, out a0_612, out a1_613, out a2_614, out a3, out a4_615, out a5_616, out a7_617, out s2_120, out s3_130, out s4, out s5_134, out s6_618, out s8_619, out mstatus);
									}
								}
							}
						}
					}
					int32 a5_226 = (word32) *((word32) s1_119 + 7) << 8 | (word32) (*((word32) s1_119 + 6));
					a4_227.u0 = 0x0100;
					if (a5_226 != 0x0100)
					{
						a4_227.u0 = 0x0200;
						if (a5_226 != 0x0200)
							s2_120->w002C = (word16) ((word32) s2_120->w002C + 0x01);
						else
							ra = dhcp_arp_reply(ra, s0_118, s0_118, s4, mstatus, dwArg08, dwArg18, dwArg28, dwArg38, dwArg48, s1, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgE8, out a3, out a4_227, out s3_130, out s4, out mstatus);
					}
					else if (s5_134 != 0x00)
					{
						word32 s6_642;
						word32 s7_643;
						word32 s2_640;
						word32 s5_641;
						word32 a0_638;
						word32 a1_639;
						word32 s0_636;
						word32 s1_637;
						ra = etharp_raw(ra, s0_118, (word32) s0_118 + 58, (word32) s0_118 + 4, mstatus, dwLoc3C, s2, dwLoc0C, dwArg28, dwArg38, s1, dwArg64, dwArg68, dwArg78, dwArg80, dwArg84, dwArg98, dwArgA8, dwArgD8, dwArg0158, out s0_636, out s1_637, out a0_638, out a1_639, out a3, out a4_227, out s2_640, out s3_130, out s4, out s5_641, out s6_642, out s7_643, out mstatus);
					}
l2303E874:
					word32 mstatus_635;
					word32 s5_632;
					word32 s6_633;
					word32 s8_634;
					word32 s2_629;
					word32 s3_630;
					word32 s4_631;
					word32 a4_626;
					word32 a5_627;
					word32 a7_628;
					word32 a1_623;
					word32 a2_624;
					word32 a3_625;
					word32 s0_620;
					word32 s1_621;
					word32 a0_622;
					pbuf_free(ra, s3_130, a3, a4_227, s4, mstatus, dwArgE8, out s0_620, out s1_621, out a0_622, out a1_623, out a2_624, out a3_625, out a4_626, out a5_627, out a7_628, out s2_629, out s3_630, out s4_631, out s5_632, out s6_633, out s8_634, out mstatus_635);
					0x00 = dwArg0198;
					return;
				}
			}
		}
	}
	g_w4201FDC0 = (word16) ((word32) g_w4201FDC0 + 0x01);
	g_w4201FDB6 = (word16) ((word32) g_w4201FDB6 + 0x01);
	goto l2303E874;
}

// 2303E99A: Register Eq_2 etharp_request(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC0, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_200580) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_200583 a1Out, Register out Eq_200584 a3Out, Register out Eq_200585 a4Out, Register out ptr32 s2Out, Register out Eq_200587 s3Out, Register out Eq_200588 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      etharp_tmr
//      etharp_output_to_arp_index
//      etharp_query
//      netif_issue_reports
Eq_2 etharp_request(Eq_2 ra, Eq_2 s0, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC0, Eq_2 dwArgC4, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArg0118, Eq_2 dwArg0198, struct Eq_200580 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_200583 & a1Out, union Eq_200584 & a3Out, union Eq_200585 & a4Out, ptr32 & s2Out, union Eq_200587 & s3Out, union Eq_200588 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	ptr32 a0_18;
	Eq_200583 a1_19;
	Eq_200584 a3_21;
	Eq_200585 a4_22;
	ptr32 mstatus_26;
	struct Eq_200580 * s0_28;
	ptr32 s1_29;
	ptr32 s2_30;
	Eq_200587 s3_31;
	Eq_200588 s4_32;
	ptr32 s5_33;
	ptr32 s6_34;
	ptr32 s7_35;
	Eq_2 ra_27 = etharp_raw(ra, s0, (word32) a0 + 58, (word32) a0 + 4, mstatus, dwArg04, dwArg18, dwArg34, dwArg68, dwArg78, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgC0, dwArgC4, dwArgD8, dwArgE8, dwArg0118, dwArg0198, out s0_28, out s1_29, out a0_18, out a1_19, out a3_21, out a4_22, out s2_30, out s3_31, out s4_32, out s5_33, out s6_34, out s7_35, out mstatus_26);
	s0Out = s0_28;
	s1Out = s1_29;
	a0Out = a0_18;
	a1Out = a1_19;
	a3Out = a3_21;
	a4Out = a4_22;
	s2Out = s2_30;
	s3Out = s3_31;
	s4Out = s4_32;
	s5Out = s5_33;
	s6Out = s6_34;
	s7Out = s7_35;
	mstatusOut = mstatus_26;
	return ra_27;
}

