pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303E9BC: void etharp_tmr(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack word32 dwArg0128, Stack Eq_2 dwArg0168)
void etharp_tmr(Eq_2 ra, Eq_2 a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8, word32 dwArg0128, Eq_2 dwArg0168)
{
	struct Eq_200645 * s0_114 = &g_t420150BC;
	struct Eq_199631 * s1_112 = null;
	Eq_2 s4_102 = 299;
	uint32 s5_103 = 0x01;
	uint32 s6_104 = 0x03;
	uint32 s2_133 = 0x04;
	word32 s7_134 = 0x02;
	struct Eq_199631 * s3_101 = (struct Eq_199631 *) 0x0A;
	do
	{
		uint32 a4_33 = (word32) s0_114[20];
		if (a4_33 != 0x00)
		{
			uint32 a5_36 = (word32) s0_114[18] + 0x01 << 16;
			s0_114[18] = (struct Eq_200645) (word16) (a5_36 >> 16);
			if (s4_102 >= a5_36 >> 16)
			{
				if (a4_33 == s5_103)
				{
					if (s2_133 < a5_36 >> 16)
						goto l2303EA08;
					word32 a1_268;
					word32 a4_269;
					ra = etharp_request(ra, *((word32) a0 + 8), a0, mstatus, dwLoc2C, dwLoc18, dwArg04, dwArg38, dwArg48, dwArg68, dwArg74, dwArg78, dwArg88, dwArg90, dwArg94, dwArgA8, dwArgB8, dwArgE8, dwArg0168, out s0_114, out s1_112, out a0, out a1_268, out a3, out a4_269, out s2_133, out s3_101, out s4_102, out s5_103, out s6_104, out s7_134, out mstatus);
				}
				else if (a4_33 == s6_104)
					s0_114[20] = (struct Eq_200645) (byte) s2_133;
				else if (a4_33 == s2_133)
					s0_114[20] = (struct Eq_200645) (byte) s7_134;
			}
			else
			{
l2303EA08:
				ra = etharp_free_entry(ra, s1_112, a3, s4_102, mstatus, dwArg08, dwArgE8, out s1_112, out a0, out a3, out s2_133, out s3_101, out s4_102, out s5_103, out s6_104, out mstatus);
			}
		}
		s1_112 = (struct Eq_199631 *) &s1_112->b0001;
		s0_114 += 24;
	} while (s1_112 != s3_101);
	0x00 = dwArg0128;
}

// 2303EA4C: void etharp_output_to_arp_index(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 Eq_200359) a2, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0178)
// Called from:
//      etharp_output
void etharp_output_to_arp_index(Eq_2 ra, Eq_2 a0, struct Eq_200359 * a2, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE4, Eq_2 dwArgF8, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0128, Eq_2 dwArg0178)
{
	Eq_2 s2_115 = a0;
	if ((word32) a2->b420150E8 == 0x02)
	{
		struct Eq_200770 * s1_100;
		word32 a0_44;
		Eq_200772 a5_31 = (word32) a2->w420150E6;
		if (a5_31 > 0x011C)
		{
			word32 s7_223;
			word32 mstatus_224;
			word32 s5_221;
			word32 s6_222;
			word32 s3_219;
			word32 s4_220;
			word32 a3_217;
			word32 a4_218;
			word32 s0_215;
			word32 a1_216;
			ra = etharp_request(ra, (char *) a2 + 0x420150E0, a0, mstatus, s4, dwLoc08, dwArg14, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA0, dwArgA4, dwArgB8, dwArgC8, dwArgF8, dwArg0178, out s0_215, out s1_100, out a0_44, out a1_216, out a3_217, out a4_218, out s2_115, out s3_219, out s4_220, out s5_221, out s6_222, out s7_223, out mstatus_224);
		}
		else
		{
			if (a5_31 <= 269)
				goto l2303EAA0;
			word32 s0_232;
			word32 a1_233;
			word32 a3_234;
			word32 a4_235;
			word32 s3_236;
			word32 s4_237;
			word32 s5_238;
			word32 s6_239;
			word32 s7_240;
			word32 mstatus_241;
			ra = etharp_raw(ra, (char *) a2 + 0x420150E0, (word32) a0 + 58, (word32) a0 + 4, mstatus, s4, dwLoc08, dwArg14, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA0, dwArgA4, dwArgB8, dwArgC8, dwArgF8, dwArg0178, out s0_232, out s1_100, out a0_44, out a1_233, out a3_234, out a4_235, out s2_115, out s3_236, out s4_237, out s5_238, out s6_239, out s7_240, out mstatus_241);
		}
		if (a0_44 == 0x00)
			s1_100->b0014 = 0x03;
	}
l2303EAA0:
	word32 s0_225;
	word32 s1_226;
	word32 a3_227;
	word32 a4_228;
	word32 s2_229;
	word32 s3_230;
	word32 s4_231;
	ethernet_output(ra, s2_115, dwArg04, dwArg48, 0x00FFF800, dwArg38, dwArg58, dwArg74, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_225, out s1_226, out a3_227, out a4_228, out s2_229, out s3_230, out s4_231);
}

// 2303EAE8: Register Eq_2 etharp_query(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA0, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0100, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0178, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a3Out, Register out Eq_2 s2Out, Register out Eq_195755 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      dhcp_check
//      etharp_output
Eq_2 etharp_query(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA0, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0100, Eq_2 dwArg0104, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0178, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a3Out, union Eq_2 & s2Out, union Eq_195755 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 s1_113;
	Eq_2 s2_12 = a0;
	word32 a5_593;
	word32 a4_592;
	Eq_2 a3_112;
	if (ip4_addr_isbroadcast_u32(*a1, a0, out a3_112, out a4_592, out a5_593) == null)
	{
		Eq_2 a5_29 = *a1;
		a3_112 = a5_29 & 0x00F0;
		if ((a5_29 & 0x00F0) != 224 && a5_29 != 0x00)
		{
			int32 a0_37;
			Eq_2 s4_144;
			Eq_2 s0_118;
			ra = etharp_find_entry(ra, a1, 0x01, a0, a1, mstatus, dwLoc08, dwArgD8, out s0_118, out s1_113, out a0_37, out a3_112, out s2_12, out s3, out s4_144, out s5, out s6, out mstatus);
			if (a0_37 < 0x00)
			{
				if (s0_118 != 0x00)
					g_w4201FDBC = (word16) ((word32) g_w4201FDBC + 0x01);
				goto l2303EB42;
			}
			struct Eq_200911 * a4_65 = (a0_37 & 0x00FF) + 0x18;
			s3 = a0_37 & 0x00FF;
			s1_113.u0 = 0x420150BC;
			if ((word32) a4_65->b420150D0 != 0x00)
			{
				if (s0_118 != 0x00)
					goto l2303EB7E;
			}
			else
			{
				a4_65->b420150D0 = 0x01;
				a4_65->t420150C4 = s2_12;
			}
			word32 a4_596;
			word32 a0_594;
			word32 a1_595;
			ra = etharp_request(ra, s0_118, s2_12, mstatus, s4, dwLoc08, dwArg14, dwArg48, dwArg58, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA0, dwArgA4, dwArgB8, dwArgC8, dwArgF8, dwArg0178, out s0_118, out s1_113, out a0_594, out a1_595, out a3_112, out a4_596, out s2_12, out s3, out s4_144, out s5, out s6, out s7, out mstatus);
			if (s0_118 == 0x00)
				goto l2303EB42;
l2303EB7E:
			a3_112 = (word32) s3.u0 + 24;
			word32 a4_116 = CONVERT(Mem115[s1_113 + a3_112 + 20:byte], byte, word32);
			if (a4_116 > 0x01)
			{
				g_b4200EF18 = (byte) s3;
				Eq_2 a2_232 = (word32) s2_12 + 58;
				Eq_2 a3_243;
				Eq_2 s0_246;
				Eq_2 s1_247;
				Eq_2 s2_248;
				Eq_195755 s3_249;
				ptr32 s4_250;
				word32 a4_597;
				Eq_2 ra_256 = ethernet_output(ra, s2_12, s0_118, a2_232, 0x00FFF800, dwArg38, dwArg58, dwArg74, dwArgE4, dwArg0100, dwArg0104, dwArg0128, out s0_246, out s1_247, out a3_243, out a4_597, out s2_248, out s3_249, out s4_250);
				s0Out = s0_246;
				s1Out = s1_247;
				a3Out = a3_243;
				s2Out = s2_248;
				s3Out = s3_249;
				s4Out = s4_250;
				s5Out = s5;
				s6Out = s6;
				s7Out = s7;
				mstatusOut = mstatus;
				return ra_256;
			}
			if (a4_116 == 0x01)
			{
				Eq_2 a5_119 = s0_118;
				do
				{
					Eq_2 a4_135;
					Eq_2 a0_155;
					ui32 a4_122 = (word32) *((word32) a5_119 + 0x0C);
					if ((a4_122 & 64) != 0x00)
					{
						ra = pbuf_clone(ra, s0_118, 0x008E, 640, s0_118, a3_112, a4_122 & 64, mstatus, dwArg14, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgE8, dwArgF8, dwArg0128, out s1_113, out a0_155, out a3_112, out a4_135, out s2_12, out s3, out s4_144, out s5, out s6, out mstatus);
						s0_118 = a0_155;
						if (a0_155 != 0x00)
							goto l2303EBE4;
						g_w4201FDBC = (word16) ((word32) g_w4201FDBC + 0x01);
						goto l2303EB42;
					}
					a5_119 = *a5_119;
				} while (a5_119 != 0x00);
				word32 a5_598;
				a0_155 = pbuf_ref(s0_118, a3_112, a4_122 & 64, mstatus, out a3_112, out a4_135, out a5_598);
l2303EBE4:
				if (a0_155 != 0x00)
				{
					word32 s8_606;
					word32 s4_605;
					word32 a7_604;
					word32 a5_603;
					word32 a4_602;
					word32 a2_601;
					word32 a1_600;
					word32 a0_599;
					ra = pbuf_free(ra, a0_155, a3_112, a4_135, s4_144, mstatus, dwArg0108, out s0_118, out s1_113, out a0_599, out a1_600, out a2_601, out a3_112, out a4_602, out a5_603, out a7_604, out s2_12, out s3, out s4_605, out s5, out s6, out s8_606, out mstatus);
				}
				s1_113 = (word16) s1_113.u0 + ((word32) s3.u0 + 24);
				*s0_118 = s1_113;
			}
l2303EB42:
			s0Out = s1;
			s1Out = s1_113;
			a3Out = a3_112;
			s2Out = s2_12;
			s3Out = s3;
			s4Out = dwArg04;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s1_113 = s1;
	goto l2303EB42;
}

