pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303EC2E: void etharp_output(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0158)
void etharp_output(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0158)
{
	union Eq_2 * a5_22;
	word32 a4_477;
	word32 a3_476;
	struct Eq_200359 * a0_19 = ip4_addr_isbroadcast_u32(a0, a0, out a3_476, out a4_477, out a5_22);
	if (a0_19 == null)
	{
		Eq_2 s1_229 = *a5_22;
		if ((a5_22 & 0x00F0) != 224)
		{
			Eq_2 s0_30 = (a5_22 & 0x00F0)->t0008;
			struct Eq_200359 * a4_31 = a0_19;
			if (((a5_22 ^ 224) & (a5_22 & 0x00F0)) != 0x00)
			{
				struct Eq_201201 * a5_36 = (word32) (word16) a5_22;
				if (a5_36 != (struct Eq_201201 *) 0x0FFFFEA9)
				{
					s0_30 = a5_36->t000C;
					if (a5_36 == null)
						return;
					s1_229 = (word32) s0_30 + 0x0C;
				}
			}
			struct Eq_200359 * a2_136 = (word32) g_b4200DF18;
			Eq_2 a5_49 = 0x420150BC;
			if ((word32) a2_136->b420150E8 > 0x01)
			{
				Eq_2 a3_53 = *(union Eq_2 *) 0x09;
				if (s0_30 == 0x01)
				{
					s1_229 = *(union Eq_2 *) 0x01;
					if (*((word32) a3_53 + 4) == 0x01)
					{
						g_w4201FDC6 = (word16) ((word32) g_w4201FDC6 + 0x01);
l2303ED06:
						etharp_output_to_arp_index(ra, s0_30, a2_136, s4, mstatus, dwLoc1C, dwLoc0C, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, dwArg64, s1, dwArg78, dwArg80, dwArg84, dwArg98, dwArgA8, dwArgC4, dwArgD8, dwArgE0, dwArgE4, dwArg0108, dwArg0158);
						return;
					}
				}
			}
			do
			{
				Eq_2 a0_61 = (word32) *((word32) a5_49 + 20);
				if (a0_61 > 0x01)
				{
					a5_49 = *((word32) a0_61 + 8);
					if (a0_61 == s0_30)
					{
						a5_49 = *((word32) a0_61 + 4);
						if (*s1_229 == a0_61)
						{
							g_b4200DF18 = (byte) a4_31;
							a2_136 = a4_31;
							goto l2303ED06;
						}
					}
				}
				ui32 a4_70 = (char *) a4_31 + 1;
				a4_31 = a4_70 & 0x00FF;
				a5_49 = (word32) a5_49 + 24;
			} while ((a4_70 & 0x00FF) != 0x0A);
			word32 s0_485;
			word32 s1_486;
			word32 a3_487;
			word32 s4_490;
			word32 s5_491;
			word32 s3_489;
			word32 s6_492;
			word32 s2_488;
			word32 s7_493;
			word32 mstatus_494;
			etharp_query(ra, s0_30, s1_229, s4, mstatus, dwLoc0C, dwArg18, dwArg28, dwArg38, dwArg54, dwArg58, dwArg64, s1, dwArg78, dwArg80, dwArg84, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC4, dwArgC8, dwArgD8, dwArgE0, dwArgE4, dwArgE8, dwArg0108, dwArg0158, out s0_485, out s1_486, out a3_487, out s2_488, out s3_489, out s4_490, out s5_491, out s6_492, out s7_493, out mstatus_494);
			return;
		}
	}
	word32 s1_479;
	word32 s0_478;
	word32 a4_481;
	word32 a3_480;
	word32 s4_484;
	word32 s3_483;
	word32 s2_482;
	ethernet_output(ra, a0, a1, (word32) a0 + 58, 0x00FFF800, dwArg18, dwArg38, dwArg54, dwArgC4, dwArgE0, dwArgE4, dwArg0108, out s0_478, out s1_479, out a3_480, out a4_481, out s2_482, out s3_483, out s4_484);
}

struct Eq_127403 * g_ptr2303EC42 = &g_t619000EF;
// 2303ED60: Register Eq_2 igmp_send(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_201309 a3Out, Register out (ptr32 Eq_201310) a4Out, Register out (ptr32 Eq_201311) a5Out, Register out (ptr32 Eq_201312) s2Out, Register out (ptr32 Eq_201313) s3Out, Register out (ptr32 Eq_201314) s4Out, Register out Eq_2 s5Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      igmp_joingroup_netif
//      igmp_leavegroup_netif
//      igmp_tmr
Eq_2 igmp_send(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_201309 & a3Out, struct Eq_201310 & a4Out, struct Eq_201311 & a5Out, struct Eq_201312 & s2Out, struct Eq_201313 & s3Out, struct Eq_201314 & s4Out, union Eq_2 & s5Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	struct Eq_201311 * a5_166;
	struct Eq_201319 * s1_41;
	Eq_2 s4_48;
	Eq_2 s6_54;
	word32 a1_271;
	word32 a3_272;
	word32 a5_273;
	word32 a7_274;
	word32 s8_275;
	struct Eq_201313 * s3_169;
	Eq_2 s5_173;
	Eq_2 s0_160;
	struct Eq_201312 * s2_168;
	ptr32 mstatus_181;
	ptr32 a2_159;
	struct Eq_201310 * a4_165;
	Eq_2 a0_158;
	Eq_2 ra_52 = pbuf_alloc(ra, s0, 0x42020000, 0x00B6, 0x08, 640, a3, a4, mstatus, dwLoc4C, dwLoc0C, dwArg58, dwArg68, dwArg88, dwArg98, dwArgA8, dwArgC8, dwArgD8, dwArg0108, out s0_160, out s1_41, out a0_158, out a1_271, out a2_159, out a3_272, out a4_165, out a5_273, out a7_274, out s2_168, out s3_169, out s4_48, out s5_173, out s6_54, out s8_275, out mstatus_181);
	if (a0_158 != 0x00)
	{
		Eq_2 a5_68 = s3_169->t0004;
		if (s5_173 == 22)
		{
			((word32) s0_160 + 7)->u1 = (byte) (a5_68 >> 24);
			*((word32) s0_160 + 4) = (byte) (a5_68 & 0x00FF);
			((word32) s0_160 + 5)->u1 = (byte) (a5_68 >> 0x08);
			*((word32) s0_160 + 6) = (byte) (a5_68 >> 0x10);
			s3_169->b0008 = 0x01;
		}
		else
		{
			*((word32) s0_160 + 4) = (byte) (a5_68 & 0x00FF);
			((word32) s0_160 + 5)->u1 = (byte) (a5_68 >> 0x08);
			*((word32) s0_160 + 6) = (byte) (a5_68 >> 0x10);
			((word32) s0_160 + 7)->u1 = (byte) (a5_68 >> 24);
		}
		*s0_160 = (byte) s5_173;
		((word32) s0_160 + 1)->u1 = 0x00;
		((word32) s0_160 + 2)->u1 = 0x00;
		((word32) s0_160 + 3)->u1 = 0x00;
		Eq_2 a2_101;
		word32 a3_276;
		word32 a4_277;
		word32 a5_278;
		Eq_2 a0_99 = inet_chksum(s0_160, 0x08, a5_68 >> 0x10, out a2_101, out a3_276, out a4_277, out a5_278);
		*((word32) s0_160 + 2) = (byte) a0_99;
		((word32) s0_160 + 3)->u1 = (byte) (a0_99 >> 8);
		s1_41->wFFFFFDF8 = (word16) ((word32) s1_41->wFFFFFDF8 + 0x01);
		Eq_2 a3_133;
		Eq_2 a4_134;
		Eq_2 s2_141;
		Eq_2 s4_143;
		word32 s0_279;
		word32 s1_280;
		word32 a0_281;
		word32 a5_282;
		word32 a7_283;
		word32 s3_284;
		word32 s5_285;
		word32 s6_286;
		word32 s8_287;
		word32 s9_288;
		word32 s1_289;
		word32 a1_290;
		word32 a3_291;
		word32 a7_292;
		word32 s4_293;
		word32 s6_294;
		word32 s8_295;
		pbuf_free(ip4_output_if_opt(ra_52, s0_160, (char *) s1_41 - 616, a0_158, fp + -40, a2_101, 0x01, 0x00, 0x02, s4_48, fp + -36, s4_48, s5_173, s6_54, s7, 0x04, out s0_279, out s1_280, out a0_281, out a3_133, out a4_134, out a5_282, out a7_283, out s2_141, out s3_284, out s4_143, out s5_285, out s6_286, out s7, out s8_287, out s9_288), s2_141, a3_133, a4_134, s4_143, mstatus_181, dwArgD8, out s0_160, out s1_289, out a0_158, out a1_290, out a2_159, out a3_291, out a4_165, out a5_166, out a7_292, out s2_168, out s3_169, out s4_293, out s5_173, out s6_294, out s8_295, out mstatus_181);
	}
	else
	{
		word32 a5_61 = (word32) s1_41->wFFFFFE02;
		s1_41->wFFFFFE02 = (word16) (a5_61 + 0x01);
		a5_166 = a5_61 + 0x01;
	}
	s0Out = s0_160;
	s1Out = dwLoc4C;
	a0Out = a0_158;
	a2Out = a2_159;
	a3Out = s2;
	a4Out = a4_165;
	a5Out = a5_166;
	s2Out = s2_168;
	s3Out = s3_169;
	s4Out = dwArg0168;
	s5Out = s5_173;
	s7Out = s7;
	mstatusOut = mstatus_181;
	return dwLoc08;
}

// 2303EE60: Register Eq_2 igmp_delaying_member(Register Eq_2 a0, Register Eq_201582 a1, Register (ptr32 Eq_52584) a2, Register out Eq_201582 a1Out, Register out (ptr32 Eq_52584) a2Out, Register out Eq_201586 a3Out, Register out Eq_201587 a4Out, Register out Eq_201582 a5Out, Register out ptr32 s4Out)
// Called from:
//      igmp_input
//      netif_issue_reports
Eq_2 igmp_delaying_member(Eq_2 a0, Eq_201582 a1, struct Eq_52584 * a2, union Eq_201582 & a1Out, struct Eq_52584 & a2Out, union Eq_201586 & a3Out, union Eq_201587 & a4Out, union Eq_201582 & a5Out, ptr32 & s4Out)
{
	Eq_201582 a5_5 = (word32) *((word32) a0 + 9);
	Eq_201587 a4_31 = 0x02;
	if (a5_5 != 0x02)
	{
		a4_31.u0 = 0x01;
		if (a5_5 != 0x01)
		{
l2303EEB2:
			a1Out = a1;
			a2Out = a2;
			a3Out = a3;
			a4Out.u0 = 0x01;
			a5Out = a5_5;
			s4Out = s4;
			return s1;
		}
		a5_5 = (word32) *((word32) a0 + 0x0A);
		if (a5_5 != 0x00 && a1 >= a5_5)
			goto l2303EEB2;
	}
	Eq_2 s1_25 = a0;
	if (a1 > 0x02)
	{
		ui32 a0_28;
		word32 a5_122;
		s1_25 = bl_rand(a0, a2, out a0_28, out a1, out a3, out a4_31, out a5_122, out s4);
		ui32 s0_39 = a0_28 & a1;
		*((word32) s1_25 + 0x0A) = (word16) s0_39;
		if (s0_39 != 0x00)
			goto l2303EE92;
	}
	((word32) s1_25 + 0x0A)->u0 = 0x01;
l2303EE92:
	((word32) s1_25 + 9)->u1 = 0x01;
	a1Out = a1;
	a2Out = dwArg10;
	a3Out = a3;
	a4Out = a4_31;
	a5Out.u0 = 0x01;
	s4Out = s4;
	return s1_25;
}

