pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303EEB4: Register word32 igmp_init(Register out ptr32 a5Out)
// Called from:
//      lwip_init
word32 igmp_init(ptr32 & a5Out)
{
	g_dw4200EF20 = 0x010000E0;
	g_dw4200EF1C = 0x020000E0;
	a5Out = 0x020000E0;
	return 0x4200E000;
}

// 2303EED6: Register Eq_2 igmp_stop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a3, Register Eq_2 a4, Register (ptr32 Eq_201656) a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out Eq_2 a3Out)
// Called from:
//      netif_remove
Eq_2 igmp_stop(Eq_2 ra, Eq_2 s0, Eq_2 a3, Eq_2 a4, struct Eq_201656 * a5, ptr32 mstatus, Eq_2 dwArg38, union Eq_2 & a3Out)
{
	((word32) *((word32) s0 + 44) + 44)->u0 = 0x00;
	while (s0 != 0x00)
	{
		word32 s1_18 = a5->dw0048;
		Eq_2 s2_19 = *s0;
		if (a5 != null)
		{
			word32 a5_33;
			a5();
		}
		word32 a2_89;
		word32 a0_88;
		memp_free(0x0A, s0, a3, a4, mstatus, out a0_88, out a2_89, out a3, out a4, out a5);
		s0 = s2_19;
	}
	0x00 = (uint16) dwArg38;
	a3Out = a3;
	return ra;
}

// 2303EF16: Register Eq_2 igmp_report_groups(Register Eq_2 s0, Register (ptr32 Eq_52584) a2, Register Eq_2 a5, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_2 a5Out, Register out ptr32 s4Out)
// Called from:
//      netif_issue_reports
Eq_2 igmp_report_groups(Eq_2 s0, struct Eq_52584 * a2, Eq_2 a5, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, ptr32 & s4Out)
{
	if (a5 == 0x00)
	{
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s4Out = s4;
		return s1;
	}
	else
	{
		Eq_2 a5_11 = *s0;
		while (s0 != 0x00)
		{
			s1 = igmp_delaying_member(s0, 0x05, a2, out a1, out a2, out a3, out a4, out a5_11, out s4);
			s0 = *s0;
		}
		a1Out = a1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5_11;
		s4Out = s4;
		return s1;
	}
}

// 2303EF3A: Register Eq_2 igmp_lookfor_group(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5)
// Called from:
//      igmp_lookup_group
//      igmp_input
//      igmp_leavegroup_netif
//      ip4_input
Eq_2 igmp_lookfor_group(Eq_2 a0, Eq_2 a4, Eq_2 a5)
{
	Eq_2 a0_12 = *((word32) a0 + 44);
	while (a0_12 != 0x00)
	{
		a0_12 = *((word32) a4 + 4);
		if (a4 == a5)
			return a0_12;
		a0_12 = *a0_12;
	}
	return a0_12;
}

// 2303EF4C: Register Eq_2 igmp_lookup_group(Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out Eq_2 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 s2Out)
// Called from:
//      igmp_start
//      igmp_joingroup_netif
Eq_2 igmp_lookup_group(Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg38, union Eq_2 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & s2Out)
{
	Eq_2 s1_13 = a0;
	Eq_2 a0_18 = igmp_lookfor_group(a0, a4, a5);
	if (a0_18 == 0x00)
	{
		word32 a5_83;
		word32 a2_82;
		s1_13 = memp_malloc(*((word32) s0 + 44), 0x0A, a3, a4, mstatus, out a0_18, out a2_82, out a3, out a4, out a5_83);
		if (a0_18 != 0x00)
		{
			Eq_2 a5_31 = 0x00;
			if (a1 != 0x00)
				a5_31 = *a1;
			*((word32) a5_31 + 4) = a0_18;
			*((word32) a0_18 + 8) = 0x00;
			((word32) a0_18 + 0x0C)->u1 = 0x00;
			if (s0 == 0x00)
			{
				a0_18->u0 = 0x00;
				*((word32) a0_18 + 44) = s1_13;
			}
			else
			{
				Eq_2 s0_39 = *a5_31;
				*a5_31 = a0_18;
				*a0_18 = s0_39;
			}
		}
	}
	0x00 = (uint16) dwArg38;
	a0Out = a0_18;
	a3Out = a3;
	a4Out = a4;
	s2Out = a1;
	return s1_13;
}

// 2303EF9A: void igmp_start(Register word32 ra, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg28)
// Called from:
//      netif_add
void igmp_start(word32 ra, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg28)
{
	struct Eq_201821 * a0_18;
	word32 a3_24;
	word32 a4_25;
	word32 s2_76;
	Eq_2 s1_21 = igmp_lookup_group(a0, a0, 0x4200DF20, a3, a4, a5, mstatus, dwArg28, out a0_18, out a3_24, out a4_25, out s2_76);
	if (a0_18 != null)
	{
		a0_18->b0009 = 0x02;
		struct Eq_201840 * a5_30 = (word32) a0_18->b000C;
		a0_18->b000C = (byte) ((char *) a5_30 + 1);
		word32 s0_33 = a5_30->dw0049;
		if (a5_30 != (struct Eq_201840 *) 0x01)
			(*((char *) a5_30 + 1))();
	}
}

// 2303EFE2: Register Eq_2 igmp_input(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128)
// Called from:
//      ip4_input
Eq_2 igmp_input(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 s4, ptr32 mstatus, Eq_2 dwArgF8, Eq_2 dwArg0128)
{
	Eq_2 s1_177;
	g_w4201FDFA = (word16) ((word32) g_w4201FDFA + 0x01);
	Eq_2 s0_102 = 1107426712;
	Eq_2 a1_26 = (word32) *((word32) a0 + 0x0A);
	if (a1_26 <= 0x07)
	{
		word32 s2_379;
		word32 s4_381;
		word32 s3_380;
		word32 s5_382;
		word32 a7_378;
		word32 a5_377;
		word32 s8_384;
		word32 mstatus_385;
		word32 s6_383;
		struct Eq_201913 * s0_254;
		word32 a0_372;
		word32 a4_376;
		word32 a2_374;
		word32 a3_375;
		word32 a1_373;
		pbuf_free(ra, a0, a3, a4, s4, mstatus, dwArgF8, out s0_254, out s1_177, out a0_372, out a1_373, out a2_374, out a3_375, out a4_376, out a5_377, out a7_378, out s2_379, out s3_380, out s4_381, out s5_382, out s6_383, out s8_384, out mstatus_385);
		s0_254->w0068 = (word16) ((word32) s0_254->w0068 + 0x01);
		goto l2303F01E;
	}
	Eq_2 a0_28 = *((word32) s1 + 4);
	Eq_2 s4_115 = a2;
	Eq_2 a4_38;
	Eq_2 a5_39;
	struct Eq_52584 * a2_107;
	Eq_2 a3_111;
	if (inet_chksum(s1, a1_26, a4, out a2_107, out a3_111, out a4_38, out a5_39) != 0x00)
	{
		word32 a0_386;
		word32 a1_387;
		word32 a2_388;
		word32 a7_392;
		word32 a5_391;
		word32 s2_393;
		word32 s5_396;
		word32 s3_394;
		word32 a4_390;
		word32 a3_389;
		word32 s8_398;
		word32 s6_397;
		word32 mstatus_399;
		word32 s4_395;
		struct Eq_201966 * s0_225;
		pbuf_free(ra, a0_28, a3_111, a4_38, a2, mstatus, dwArgF8, out s0_225, out s1_177, out a0_386, out a1_387, out a2_388, out a3_389, out a4_390, out a5_391, out a7_392, out s2_393, out s3_394, out s4_395, out s5_396, out s6_397, out s8_398, out mstatus_399);
		s0_225->w0066 = (word16) ((word32) s0_225->w0066 + 0x01);
		goto l2303F01E;
	}
	Eq_2 a0_42 = igmp_lookfor_group(a1, a4_38, a5_39);
	if (a0_42 == 0x00)
	{
		struct Eq_202004 * s0_196;
		word32 a0_400;
		word32 a1_401;
		word32 a2_402;
		word32 a3_403;
		word32 a4_404;
		word32 a5_405;
		word32 a7_406;
		word32 s2_407;
		word32 s3_408;
		word32 s4_409;
		word32 s5_410;
		word32 s6_411;
		word32 s8_412;
		word32 mstatus_413;
		pbuf_free(ra, a0_28, a3_111, a4_38, a2, mstatus, dwArgF8, out s0_196, out s1_177, out a0_400, out a1_401, out a2_402, out a3_403, out a4_404, out a5_405, out a7_406, out s2_407, out s3_408, out s4_409, out s5_410, out s6_411, out s8_412, out mstatus_413);
		s0_196->w0064 = (word16) ((word32) s0_196->w0064 + 0x01);
		goto l2303F01E;
	}
	Eq_2 a4_112;
	word32 a5_44 = (word32) *s1;
	if (a5_44 != 0x11)
	{
		a4_112.u0 = 22;
		if (a5_44 == 22)
		{
			g_w4201FE0C = (word16) ((word32) g_w4201FE0C + 0x01);
			a4_112 = (word32) *((word32) a0_42 + 9);
			if (a4_112 == 0x01)
				*(union Eq_2 *) 0x0208 = a0_42;
			goto l2303F0DA;
		}
		goto l2303F07C;
	}
	a3_111 = *a2;
	Eq_2 a5_57 = (word32) *((word32) s1 + 7) << 24 | (((word32) (*((word32) s1 + 5)) << 8 | (word32) (*((word32) s1 + 4))) | (word32) (*((word32) s1 + 6)) << 16);
	a4_112 = g_t4200DF20;
	if (a3_111 == a4_112)
	{
		if (a5_57 == 0x00)
		{
			if ((word32) *((word32) s1 + 1) == 0x00)
			{
				g_w4201FE06 = (word16) ((word32) g_w4201FE06 + 0x01);
				((word32) s1 + 1)->u1 = 0x0A;
			}
			else
				g_w4201FE0A = (word16) ((word32) g_w4201FE0A + 0x01);
			if (*((word32) a1 + 44) != 0x00)
			{
				while (s0_102 != 0x00)
				{
					word32 a1_429;
					word32 a5_430;
					s1 = igmp_delaying_member(s0_102, (word32) *((word32) s1 + 1), a2_107, out a1_429, out a2_107, out a3_111, out a4_112, out a5_430, out s4_115);
					s0_102 = *s0_102;
				}
			}
l2303F0DA:
			word32 s0_414;
			word32 a0_415;
			word32 a1_416;
			word32 a2_417;
			word32 a3_418;
			word32 a4_419;
			word32 a5_420;
			word32 a7_421;
			word32 s2_422;
			word32 s3_423;
			word32 s4_424;
			word32 s5_425;
			word32 s6_426;
			word32 s8_427;
			word32 mstatus_428;
			pbuf_free(ra, a0_28, a3_111, a4_112, s4_115, mstatus, dwArgF8, out s0_414, out s1_177, out a0_415, out a1_416, out a2_417, out a3_418, out a4_419, out a5_420, out a7_421, out s2_422, out s3_423, out s4_424, out s5_425, out s6_426, out s8_427, out mstatus_428);
l2303F01E:
			0x00 = (uint16) dwArg0128;
			return s1_177;
		}
		a0_42 = igmp_lookfor_group(a1, a4_112, a5_57);
		if (a0_42 == 0x00)
		{
			g_w4201FDFC = (word16) ((word32) g_w4201FDFC + 0x01);
			goto l2303F0DA;
		}
	}
	else if (a5_57 == 0x00)
	{
l2303F07C:
		g_w4201FE04 = (word16) ((word32) g_w4201FE04 + 0x01);
		goto l2303F0DA;
	}
	g_w4201FE08 = (word16) ((word32) g_w4201FE08 + 0x01);
	word32 a1_431;
	word32 a2_432;
	word32 a5_433;
	igmp_delaying_member(a0_42, (word32) *((word32) s1 + 1), a2_107, out a1_431, out a2_432, out a3_111, out a4_112, out a5_433, out s4_115);
	goto l2303F0DA;
}

// 2303F148: Register Eq_2 igmp_joingroup_netif(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Register out Eq_2 s1Out, Register out Eq_202238 a0Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_202238 a5Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      igmp_joingroup
Eq_2 igmp_joingroup_netif(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg28, Eq_2 dwArg38, union Eq_2 & s1Out, union Eq_202238 & a0Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_202238 & a5Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 a1_5 = *a3;
	if ((a3 & 0x00F0) == 224)
	{
		Eq_202238 a5_11 = ~0x05;
		if (a3 != g_t4200DF20)
		{
			ui32 a3_24 = (word32) *((word32) a0 + 65);
			struct Eq_202265 * sp_14 = fp + ~0x0F;
			Eq_2 s1_109 = a0;
			Eq_2 a3_106 = a3_24 & 32;
			if ((a3_24 & 32) != 0x00)
			{
				Eq_2 a0_30;
				word32 s2_34;
				s1_109 = igmp_lookup_group(s0, a0, a1_5, a3_24 & 32, a4, ~0x05, mstatus, dwArg28, out a0_30, out a3_106, out a4, out s2_34);
				Eq_2 s0_123 = a0_30;
				a5_11.u0 = ~0x00;
				if (a0_30 != 0x00)
				{
					if ((word32) *((word32) a0_30 + 9) == 0x00)
					{
						struct Eq_202308 * a5_42 = (word32) *((word32) a0_30 + 0x0C);
						if (a5_42 == null)
						{
							word32 s1_43 = a5_42->dw0048;
							if (a5_42 != null)
							{
								word32 tp_58;
								word32 a6_145;
								word32 a7_146;
								word32 s3_147;
								word32 s4_148;
								word32 s5_149;
								word32 s6_150;
								word32 s8_151;
								word32 t0_152;
								word32 t1_153;
								word32 t3_154;
								word32 t4_155;
								word32 t5_156;
								word32 t6_157;
								word32 s9_158;
								a5_42();
							}
						}
						word32 a4_63 = (word32) g_w4201FE0E;
						g_w4201FE0E = (word16) (a4_63 + 0x01);
						Eq_2 a0_77;
						struct Eq_52584 * a2_79;
						word32 s1_320;
						word32 s2_324;
						word32 a5_323;
						word32 a4_322;
						word32 a3_321;
						word32 s5_327;
						word32 s4_326;
						word32 s3_325;
						ra = igmp_send(ra, s0_123, a3_106, a4_63 + 0x01, s7, mstatus, sp_14->t0058, sp_14->t0068, sp_14->t0088, sp_14->t0098, sp_14->t00A8, sp_14->t00C8, sp_14->t00D8, sp_14->t0108, out s0_123, out s1_320, out a0_77, out a2_79, out a3_321, out a4_322, out a5_323, out s2_324, out s3_325, out s4_326, out s5_327, out s7, out mstatus);
						ui32 a0_104;
						word32 s4_330;
						word32 a5_329;
						word32 a1_328;
						s1_109 = bl_rand(a0_77, a2_79, out a0_104, out a1_328, out a3_106, out a4, out a5_329, out s4_330);
						ui32 a0_116 = a0_104 & 0x05;
						if ((a0_104 & 0x05) == 0x00)
							a0_116 = 0x01;
						*((word32) s0_123 + 0x0A) = (word16) a0_116;
						((word32) s0_123 + 9)->u1 = 0x01;
					}
					*((word32) s0_123 + 0x0C) = (byte) ((word32) *((word32) s0_123 + 0x0C) + 0x01);
					a5_11.u0 = 0x00;
				}
			}
			0x00 = (uint16) dwArg38;
			s1Out = s1_109;
			a0Out = a5_11;
			a3Out = a3_106;
			a4Out = a4;
			a5Out = a5_11;
			s7Out = s7;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s1Out = s1;
	a0Out.u0 = ~0x05;
	a3Out = a3;
	a4Out = a4;
	a5Out.u0 = ~0x05;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

// 2303F1F2: Register (ptr32 Eq_2) igmp_joingroup(Register Eq_2 ra, Register (ptr32 Eq_2) a0, Register Eq_2 a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_netconn_do_join_leave_group
union Eq_2 * igmp_joingroup(Eq_2 ra, union Eq_2 * a0, Eq_2 a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 a3_40 = a5 & 0x00F0;
	if ((a5 & 0x00F0) != 224)
	{
		a4Out.u0 = 224;
		a5Out = a5;
		mstatusOut = mstatus;
		return (union Eq_2 *) ~0x05;
	}
	else
	{
		Eq_2 a4_10 = g_t4200DF20;
		union Eq_2 * s1_21 = a0;
		union Eq_2 * a0_128 = (union Eq_2 *) ~0x05;
		if (a5 != a4_10)
		{
			a5.u0 = 0x42020000;
			Eq_2 s0_24 = g_t4201FD90;
			while (s0_24 != 0x00)
			{
				ui32 a5_28 = (word32) *((word32) s0_24 + 65);
				a5 = a5_28 & 32;
				if ((a5_28 & 32) != 0x00)
				{
					if (s1_21 != null)
					{
						s1_21 = (union Eq_2 *) *(a5_28 & 32);
						if ((a5_28 & 32) == 0x00)
							goto l2303F248;
						s0_24 = *((word32) a4_10 + 4);
						if ((a5_28 & 32) == a4_10)
							goto l2303F248;
					}
					else
					{
l2303F248:
						ra = igmp_joingroup_netif(ra, s0_24, s0_24, a3_40, a4_10, s7, mstatus, dwArg18, dwArg28, out s1_21, out a0_128, out a3_40, out a4_10, out a5, out s7, out mstatus);
						if (a0_128 != null)
							break;
					}
				}
				s0_24 = *s0_24;
			}
		}
		0x00 = (uint16) dwArg38;
		a4Out = a4_10;
		a5Out = a5;
		mstatusOut = mstatus;
		return a0_128;
	}
}

// 2303F25A: Register Eq_2 igmp_leavegroup_netif(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Register out Eq_2 s1Out, Register out Eq_202510 a0Out, Register out Eq_2 a4Out, Register out Eq_202510 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      igmp_leavegroup
Eq_2 igmp_leavegroup_netif(Eq_2 ra, Eq_2 a0, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgF8, union Eq_2 & s1Out, union Eq_202510 & a0Out, union Eq_2 & a4Out, union Eq_202510 & a5Out, union Eq_2 & s2Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 a1_5 = *a4;
	if ((a4 & 0x00F0) == 224)
	{
		Eq_2 a3_10 = g_t4200DF20;
		Eq_202510 a5_11 = ~0x05;
		if (a4 != a3_10)
		{
			ui32 a4_24 = (word32) *((word32) a0 + 65);
			Eq_2 s1_153 = a0;
			Eq_2 a4_106 = a4_24 & 32;
			if ((a4_24 & 32) != 0x00)
			{
				Eq_2 a0_28 = igmp_lookfor_group(a0, a4_24 & 32, ~0x05);
				s2 = a1_5;
				Eq_2 s0_109 = a0_28;
				a5_11.u0 = ~0x05;
				if (a0_28 != 0x00)
				{
					up32 a5_32 = (word32) *((word32) a0_28 + 0x0C);
					a4_106.u0 = 0x01;
					if (a5_32 <= 0x01)
					{
						while (a5_32 != 0x00)
						{
							Eq_2 a5_40 = *(union Eq_2 *) 0x01;
							if (a0_28 == 0x01)
							{
								s0_109 = *(union Eq_2 *) 0x01;
								*(union Eq_2 *) 0x01 = a5_40;
								break;
							}
							a5_32 = 0x01;
						}
						struct Eq_202570 * a5_47 = (word32) *((word32) s0_109 + 8);
						if (a5_47 != null)
						{
							word32 a4_50 = (word32) g_w4201FE10;
							g_w4201FE10 = (word16) (a4_50 + 0x01);
							word32 s4_415;
							word32 a2_413;
							word32 s3_414;
							word32 a0_412;
							word32 s1_411;
							word32 s5_416;
							ra = igmp_send(ra, s0_109, a3_10, a4_50 + 0x01, s7, mstatus, dwArg48, dwArg58, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8, out s0_109, out s1_411, out a0_412, out a2_413, out a3_10, out a4_106, out a5_47, out s2, out s3_414, out s4_415, out s5_416, out s7, out mstatus);
						}
						word32 s1_99 = a5_47->dw0048;
						if (a5_47 != null)
						{
							word32 tp_124;
							word32 a6_127;
							word32 a7_128;
							word32 s3_129;
							word32 s4_130;
							word32 s5_131;
							word32 s6_132;
							word32 s8_133;
							word32 t0_134;
							word32 t1_135;
							word32 t3_136;
							word32 t4_137;
							word32 t5_138;
							word32 t6_139;
							word32 s9_140;
							a5_47();
						}
						word32 a5_420;
						word32 a3_419;
						word32 a0_417;
						word32 a2_418;
						s1_153 = memp_free(0x0A, s0_109, a3_10, a4_106, mstatus, out a0_417, out a2_418, out a3_419, out a4_106, out a5_420);
					}
					else
						*((word32) a0_28 + 0x0C) = (byte) (a5_32 + ~0x00);
					a5_11.u0 = 0x00;
				}
			}
			0x00 = (uint16) dwArg38;
			s1Out = s1_153;
			a0Out = a5_11;
			a4Out = a4_106;
			a5Out = a5_11;
			s2Out = s2;
			s7Out = s7;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s1Out = s1;
	a0Out.u0 = ~0x05;
	a4Out = a4;
	a5Out.u0 = ~0x05;
	s2Out = s2;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

