pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303F308: Register Eq_2 igmp_leavegroup(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_2) a0, Register Eq_2 a5, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Register out (ptr32 Eq_202669) a0Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out ptr32 mstatusOut)
// Called from:
//      lwip_netconn_do_join_leave_group
Eq_2 igmp_leavegroup(Eq_2 ra, Eq_2 s1, union Eq_2 * a0, Eq_2 a5, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgD8, struct Eq_202669 & a0Out, union Eq_2 & a4Out, union Eq_2 & a5Out, ptr32 & mstatusOut)
{
	Eq_2 a4_16 = 224;
	struct Eq_202669 * s1_17 = (struct Eq_202669 *) ~0x05;
	if ((a5 & 0x00F0) == 224)
	{
		a4_16 = g_t4200DF20;
		s1_17 = (struct Eq_202669 *) ~0x05;
		if (a5 != a4_16)
		{
			a5.u0 = 0x42020000;
			s0 = g_t4201FD90;
			union Eq_2 * s2_26 = a0;
			while (s0 != 0x00)
			{
				ui32 a5_29 = (word32) *((word32) s0 + 65);
				a5 = a5_29 & 32;
				if ((a5_29 & 32) != 0x00)
				{
					if (s2_26 != null)
					{
						a5 = *s2_26;
						if (a5 == 0x00)
							goto l2303F36A;
						s0 = *((word32) a4_16 + 4);
						if (a5 == a4_16)
							goto l2303F36A;
					}
					else
					{
l2303F36A:
						struct Eq_202669 * a0_50;
						ra = igmp_leavegroup_netif(ra, s0, a4_16, s7, mstatus, dwArg18, dwArg28, dwArg38, dwArg58, s1, dwArg78, dwArg98, dwArgA8, dwArgD8, out s1_17, out a0_50, out a4_16, out a5, out s2_26, out s7, out mstatus);
						if (s1_17 != null)
							s1_17 = a0_50;
					}
				}
				s0 = *s0;
			}
		}
	}
	a0Out = s1_17;
	a4Out = a4_16;
	a5Out = a5;
	mstatusOut = mstatus;
	return s0;
}

// 2303F37A: void igmp_tmr(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8)
void igmp_tmr(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a3, Eq_2 a4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgE8)
{
	Eq_2 s1_25 = g_t4201FD90;
	word32 s3_21 = 0x01;
	struct Eq_202747 * s4_102 = &g_t4200E000;
	word32 s5_104 = 0x02;
	struct Eq_202751 * s2_106 = &g_t4201FD98;
	while (s1_25 != 0x00)
	{
		Eq_2 s1_108 = *((word32) s0 + 44);
		while (s0 != 0x00)
		{
			word32 a5_31 = (word32) *((word32) s0 + 0x0A);
			if (a5_31 != 0x00)
			{
				uint32 a5_33 = a5_31 + ~0x00 << 16;
				*((word32) s0 + 0x0A) = (word16) (a5_33 >> 16);
				if (a5_33 >> 16 == 0x00 && (word32) (*((word32) s0 + 9)) == s3_21)
				{
					s0 = *((word32) a4 + 4);
					if (a4 != s4_102->tFFFFFF20)
					{
						((word32) s0 + 9)->u1 = (byte) s5_104;
						s2_106->w007A = (word16) ((word32) s2_106->w007A + 0x01);
						word32 a0_217;
						word32 a2_218;
						word32 a5_219;
						ra = igmp_send(ra, s0, a3, a4, s7, mstatus, dwArg38, dwArg48, s1, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out s0, out s1_108, out a0_217, out a2_218, out a3, out a4, out a5_219, out s2_106, out s3_21, out s4_102, out s5_104, out s7, out mstatus);
					}
				}
			}
			s0 = *s0;
		}
		s1_25 = *s1_108;
	}
}

// 2303F3FE: Register Eq_2 ip4_input_accept(Register Eq_2 a0, Register Eq_2 a4, Register out Eq_202834 a3Out, Register out Eq_2 a4Out)
// Called from:
//      ip4_input
Eq_2 ip4_input_accept(Eq_2 a0, Eq_2 a4, union Eq_202834 & a3Out, union Eq_2 & a4Out)
{
	if (((word32) *((word32) a0 + 65) & 0x01) == 0x00)
	{
		a3Out = a3;
		a4Out = a4;
		return 0x00;
	}
	else
	{
		Eq_2 a0_9 = *((word32) a4 + 4);
		Eq_2 a0_11 = 0x00;
		if (a4 != 0x00)
		{
			Eq_2 a5_13 = g_t4201FED4;
			a0_11.u0 = 0x01;
			if (a4 != a5_13)
			{
				Eq_202834 a3_20;
				Eq_2 a4_21;
				word32 a5_48;
				Eq_2 a0_25 = (word32) (ip4_addr_isbroadcast_u32(a5_13, a0_9, out a3_20, out a4_21, out a5_48) != null);
				a3Out = a3_20;
				a4Out = a4_21;
				return a0_25;
			}
		}
		a3Out = a3;
		a4Out = a4;
		return a0_11;
	}
}

// 2303F434: Register Eq_2 ip4_route(Register Eq_2 a2, Register Eq_2 a5, Register out Eq_2 a2Out, Register out Eq_202875 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      raw_sendto
//      tcp_connect
//      tcp_input
//      tcp_output_control_segment
//      tcp_output
//      udp_sendto
//      icmp_dest_unreach
Eq_2 ip4_route(Eq_2 a2, Eq_2 a5, union Eq_2 & a2Out, union Eq_202875 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a4_24;
	Eq_2 a0_12;
	Eq_202875 a3_15 = a5 & 0x00F0;
	if ((a5 & 0x00F0) == 224)
	{
		a4_24.u0 = 0x4200E000;
		a0_12 = g_t4200DF24;
		if (a0_12 != 0x00)
			goto l2303F4BE;
	}
	a0_12 = g_t4201FD90;
	while (a0_12 != 0x00)
	{
		a3_15 = (word32) *((word32) a0_12 + 65);
		if ((a3_15 & 1) != 0x00)
		{
			struct Eq_202944 * a4_18 = a3_15 >> 0x02 & 0x01;
			if (a4_18 != null)
			{
				a0_12 = a4_18->t0004;
				if (a4_18 != null)
				{
					a0_12 = *((word16) a2.u0 + 8);
					a4_24 = (a4_18 ^ a5) & a2;
					if (a4_24 == 0x00)
						goto l2303F4BE;
					a3_15 &= 0x02;
					if ((a3_15 & 0x02) == 0x00)
					{
						a0_12 = *((word16) a4_24.u0 + 0x0C);
						if (a5 == a4_24)
							goto l2303F4BE;
					}
				}
			}
		}
		a0_12 = *a0_12;
	}
	Eq_2 a4_31 = g_t4201FD8C;
	if (a4_31 != 0x00)
	{
		ui32 a3_32 = (word32) *((word32) a4_31 + 65);
		a2.u0 = 0x05;
		a3_15 = a3_32 & 0x05;
		if ((a3_32 & 0x05) != 0x05)
			goto l2303F47C;
		a4_24 = (a3_32 & 0x05)->t0004;
		if ((a3_32 & 0x05) != 0x00)
		{
			a5 &= 0x00FF;
			a3_15.u0 = 0x007F;
			if ((a5 & 0x00FF) == 0x007F)
				goto l2303F47C;
			a0_12 = a4_24;
l2303F4BE:
			a2Out = a2;
			a3Out = a3_15;
			a4Out = a4_24;
			a5Out = a5;
			return a0_12;
		}
	}
l2303F47C:
	word32 a4_42 = (word32) g_w4201FDD6;
	g_w4201FDD6 = (word16) (a4_42 + 0x01);
	a2Out = a2;
	a3Out = a3_15;
	a4Out = a4_42 + 0x01;
	a5Out.u0 = 1107426712;
	return a0_12;
}

// 2303F4C0: void ip4_input(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s8, Register Eq_2 s10, Register Eq_2 s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack word32 dwArg9C, Stack Eq_2 dwArgA8, Stack word32 dwArgB4, Stack Eq_2 dwArgB8, Stack word32 dwArgBC, Stack Eq_2 dwArgC8, Stack word32 dwArgD0, Stack word32 dwArgD4, Stack word32 dwArgDC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack word32 dwArg0178)
// Called from:
//      ethernet_input
void ip4_input(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 s3, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s8, Eq_2 s10, Eq_2 s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, word32 dwArg9C, Eq_2 dwArgA8, word32 dwArgB4, Eq_2 dwArgB8, word32 dwArgBC, Eq_2 dwArgC8, word32 dwArgD0, word32 dwArgD4, word32 dwArgDC, Eq_2 dwArgE8, Eq_2 dwArgF8, word32 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, word32 dwArg0178)
{
	g_w4201FDCA = (word16) ((word32) g_w4201FDCA + 0x01);
	Eq_2 s3_30 = *((word32) a0 + 4);
	uint32 s6_32 = (word32) *s3_30;
	Eq_2 a4_33 = s6_32 >> 0x04;
	if (s6_32 >> 0x04 != 0x04)
	{
		struct Eq_203073 * s1_749;
		word32 a2_1495;
		word32 a3_1496;
		word32 a4_1497;
		word32 a1_1494;
		word32 a5_1498;
		word32 s4_1502;
		word32 a0_1493;
		word32 s0_1492;
		word32 mstatus_1506;
		word32 s8_1505;
		word32 s6_1504;
		word32 s5_1503;
		word32 s3_1501;
		word32 s2_1500;
		word32 a7_1499;
		pbuf_free(ra, a0, a3, s6_32 >> 0x04, s4, mstatus, dwArgF8, out s0_1492, out s1_749, out a0_1493, out a1_1494, out a2_1495, out a3_1496, out a4_1497, out a5_1498, out a7_1499, out s2_1500, out s3_1501, out s4_1502, out s5_1503, out s6_1504, out s8_1505, out mstatus_1506);
		s1_749->w0044 = (word16) ((word32) s1_749->w0044 + 0x01);
		s1_749->w0036 = (word16) ((word32) s1_749->w0036 + 0x01);
		goto l2303F512;
	}
	Eq_2 ra_244;
	int32 s6_169 = (s6_32 & 0x0F) << 2;
	word32 a5_1491;
	Eq_2 a0_41 = lwip_htons((word32) *((word32) s3_30 + 2) | (word32) (*((word32) s3_30 + 3)) << 8, out a5_1491);
	Eq_2 s2_35 = a0;
	Eq_2 s4_122 = a1;
	Eq_2 s1_48 = (word32) (word16) s6_169;
	Eq_2 s5_49 = a0_41;
	ra_244 = ra;
	if (a0_41 < (word32) (*((word32) a0 + 8)))
	{
		word32 s8_1509;
		word32 a5_1508;
		word32 a2_1507;
		ra_244 = pbuf_realloc(ra, a0, a0_41, a3, s6_32 >> 0x04, a1, mstatus, dwArgE8, out s1_48, out a2_1507, out a3, out a4_33, out a5_1508, out s2_35, out s3_30, out s4_122, out s5_49, out s6_169, out s8_1509, out mstatus);
	}
	struct Eq_203128 * s0_567;
	if ((word32) *((word32) s2_35 + 0x0A) < s1_48 || ((word32) (*((word32) s2_35 + 8)) < s5_49 || s1_48 <= 0x13))
	{
		word32 a0_1511;
		word32 a1_1512;
		word32 a2_1513;
		word32 a3_1514;
		word32 s1_1510;
		word32 a4_1515;
		word32 a5_1516;
		word32 a7_1517;
		word32 s4_1520;
		word32 s5_1521;
		word32 s6_1522;
		word32 s2_1518;
		word32 s3_1519;
		word32 s8_1523;
		word32 mstatus_1524;
		pbuf_free(ra_244, s2_35, a3, a4_33, s4_122, mstatus, dwArgF8, out s0_567, out s1_1510, out a0_1511, out a1_1512, out a2_1513, out a3_1514, out a4_1515, out a5_1516, out a7_1517, out s2_1518, out s3_1519, out s4_1520, out s5_1521, out s6_1522, out s8_1523, out mstatus_1524);
		s0_567->w003A = (word16) ((word32) s0_567->w003A + 0x01);
		goto l2303F588;
	}
	Eq_2 a3_92;
	Eq_2 a4_93;
	word32 a5_1526;
	word32 a2_1525;
	Eq_2 a0_124 = inet_chksum(s3_30, s1_48, a4_33, out a2_1525, out a3_92, out a4_93, out a5_1526);
	if (a0_124 != 0x00)
	{
		word32 a2_1530;
		word32 a5_1533;
		word32 a0_1528;
		word32 a1_1529;
		word32 s1_1527;
		word32 a7_1534;
		word32 a3_1531;
		word32 mstatus_1541;
		word32 s4_1537;
		word32 s3_1536;
		word32 s5_1538;
		word32 s6_1539;
		word32 s8_1540;
		word32 s2_1535;
		word32 a4_1532;
		pbuf_free(ra_244, s2_35, a3_92, a4_93, s4_122, mstatus, dwArgF8, out s0_567, out s1_1527, out a0_1528, out a1_1529, out a2_1530, out a3_1531, out a4_1532, out a5_1533, out a7_1534, out s2_1535, out s3_1536, out s4_1537, out s5_1538, out s6_1539, out s8_1540, out mstatus_1541);
		s0_567->w0038 = (word16) ((word32) s0_567->w0038 + 0x01);
		goto l2303F588;
	}
	Eq_2 s5_133;
	struct Eq_203217 * a5_107 = (word32) *((word32) s3_30 + 19) << 24 | (((word32) (*((word32) s3_30 + 0x0011)) << 8 | (word32) (*((word32) s3_30 + 16))) | (word32) (*((word32) s3_30 + 18)) << 16);
	a5_107->dw0014 = 1107427008;
	Eq_2 a3_116 = (word32) *((word32) s3_30 + 0x0D) << 8 | (word32) (*((word32) s3_30 + 0x0C)) | (word32) (*((word32) s3_30 + 0x0E)) << 16;
	((word32) *((word32) s3_30 + 0x0F) << 24 | a3_116)->dw0010 = 1107427008;
	Eq_198970 s1_102 = 1107427008;
	Eq_2 a4_121 = 224;
	if ((a5_107 & 0x00F0) == 224)
	{
		ui32 a5_148 = (word32) *((word32) s4_122 + 65);
		if ((a5_148 & 32) == 0x00)
			goto l2303F60E;
		a0_124 = igmp_lookfor_group(s4_122, 224, a5_148 & 32);
		if (a0_124 != 0x00)
		{
			s1_102 = *(union Eq_198970 *) 0x00F0;
			if (a3_116 == 0x010000E0)
			{
				s5_133 = s4_122;
				if (false)
				{
l2303F662:
					ui32 a4_213 = (word32) *((word32) s3_30 + 7);
					if (((word32) *((word32) s3_30 + 6) & 63 | a4_213 << 8) != 0x00)
					{
						word32 s1_1557;
						word32 a5_1563;
						word32 a0_1558;
						word32 a1_1559;
						word32 a2_1560;
						word32 a3_1561;
						word32 a7_1564;
						word32 a4_1562;
						word32 s2_1565;
						word32 s4_1567;
						word32 s3_1566;
						word32 s6_1569;
						word32 mstatus_1571;
						word32 s8_1570;
						word32 s5_1568;
						pbuf_free(ra_244, s2_35, a3_116, a4_213 << 8, s4_122, mstatus, dwArgF8, out s0_567, out s1_1557, out a0_1558, out a1_1559, out a2_1560, out a3_1561, out a4_1562, out a5_1563, out a7_1564, out s2_1565, out s3_1566, out s4_1567, out s5_1568, out s6_1569, out s8_1570, out mstatus_1571);
						s0_567->w0042 = (word16) ((word32) s0_567->w0042 + 0x01);
l2303F588:
						s0_567->w0036 = (word16) ((word32) s0_567->w0036 + 0x01);
						goto l2303F512;
					}
					*s1_102 = s5_133;
					*((word32) s1_102 + 4) = s4_122;
					*((word32) s1_102 + 8) = s3_30;
					*((word32) s1_102 + 0x0C) = (word16) (((word32) *s3_30 & 0x0F) << 2);
					Eq_2 a0_261;
					Eq_2 a2_263;
					Eq_2 s3_271;
					Eq_2 s5_273;
					Eq_2 s6_274;
					Eq_2 s8_276;
					Eq_2 s0_268;
					Eq_2 s2_270;
					Eq_2 s4_272;
					Eq_2 s1_269;
					Eq_2 ra_279 = raw_input(ra_244, s2_35, s4_122, dwArgF8, out s0_268, out s1_269, out a0_261, out a2_263, out s2_270, out s3_271, out s4_272, out s5_273, out s6_274, out s8_276);
					if (a0_261 != s8_276)
					{
						word32 a5_1574;
						word32 a1_1572;
						word32 a4_1573;
						Eq_2 a3_286;
						Eq_2 a0_283 = pbuf_remove_header(s2_270, s6_274, a2_263, out a1_1572, out a3_286, out a4_1573, out a5_1574);
						Eq_2 a5_288 = (word32) *((word32) s3_271 + 9);
						Eq_2 a4_289 = 0x02;
						if (a5_288 == 0x02)
						{
							s1_269 = igmp_input(ra_279, s1_269, s2_270, s4_272, 1107427028, a3_286, 0x02, s4_272, mstatus, dwArgC8, dwArgF8);
							goto l2303F790;
						}
						if (a5_288 <= 0x02)
						{
							if (a5_288 == s8_276)
							{
								s1_269 = icmp_input(ra_279, s2_270, s4_272, a3_286, s4_272, mstatus, s0, dwArg48, s5, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgC8, dwArgF8);
								goto l2303F790;
							}
						}
						else
						{
							if (a5_288 == 0x06)
							{
								s1_269 = tcp_input(ra_279, s0_268, s2_270, s3_271, s5_273, s6_274, a0_261, s10, s11, mstatus, s8, s6, dwLoc18, dwLoc14, dwLoc0C, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg28, dwArg38, dwArg3C, dwArg44, dwArg48, dwArg4C, s5, s3, ra, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgBC, dwArgDC, dwArgF8, dwArg0118, dwArg0138, dwArg0158, dwArg0178);
								goto l2303F790;
							}
							a4_289.u0 = 0x11;
							if (a5_288 == 0x11)
							{
								s1_269 = udp_input(ra_279, s2_270, s4_272, a2_263, s5_273, mstatus, dwArg08, dwArg18, dwArg38, dwArg48, s5, dwArg68, dwArg78, dwArg88, dwArgB4, dwArgB8, dwArgD0, dwArgD4, dwArgF8);
								goto l2303F790;
							}
						}
						if (a0_261 != 0x02)
						{
							struct Eq_203680 * a5_448;
							if (ip4_addr_isbroadcast_u32(a0_283, s5_273, out a3_286, out a4_289, out a5_448) == null)
							{
								Eq_2 s1_450 = a5_448->t0014;
								a4_289.u0 = 224;
								if ((a5_448 & 0x00F0) != 224)
								{
									Eq_2 a4_462;
									word32 s1_1590;
									ra_279 = icmp_dest_unreach(ra_279, s0_268, s1_450, pbuf_header_force(s2_270, s6_274, a2_263, out a4_462), a4_462, a0_261, mstatus, s8, dwArg38, dwArg48, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgE8, out s0_268, out s1_1590, out a3_286, out a4_289, out s2_270, out s4_272, out mstatus);
								}
							}
							((word32) s0_268 + 64)->u0 = (word16) ((word32) *((word32) s0_268 + 64) + 0x01);
							((word32) s0_268 + 54)->u0 = (word16) ((word32) *((word32) s0_268 + 54) + 0x01);
						}
						word32 mstatus_1589;
						word32 a4_1580;
						word32 s8_1588;
						word32 a5_1581;
						word32 a7_1582;
						word32 s3_1584;
						word32 s4_1585;
						word32 s5_1586;
						word32 s6_1587;
						word32 s2_1583;
						word32 a3_1579;
						word32 a0_1576;
						word32 a1_1577;
						word32 a2_1578;
						word32 s0_1575;
						pbuf_free(ra_279, s2_270, a3_286, a4_289, s4_272, mstatus, dwArgF8, out s0_1575, out s1_269, out a0_1576, out a1_1577, out a2_1578, out a3_1579, out a4_1580, out a5_1581, out a7_1582, out s2_1583, out s3_1584, out s4_1585, out s5_1586, out s6_1587, out s8_1588, out mstatus_1589);
					}
l2303F790:
					s1_269->u0 = 0x00;
					((word32) s1_269 + 4)->u0 = 0x00;
					*((word32) s1_269 + 8) = 0x00;
					((word32) s1_269 + 0x0C)->u0 = 0x00;
					((word32) s1_269 + 16)->u0 = 0x00;
					*((word32) s1_269 + 20) = 0x00;
					goto l2303F512;
				}
			}
			goto l2303F63C;
		}
	}
	else
	{
		a0_124 = ip4_input_accept(s4_122, 224, out a3_116, out a4_121);
		if (a0_124 == 0x00)
		{
			a4_121 = (word32) g_t4201FED4;
			if (a4_121 != 0x007F)
			{
				s5_133 = g_t4201FD90;
				while (s5_133 != 0x00)
				{
					if (s5_133 != s4_122)
					{
						a0_124 = ip4_input_accept(s5_133, a4_121, out a3_116, out a4_121);
						if (a0_124 != 0x00)
							goto l2303F63E;
					}
					s5_133 = *s5_133.u0;
				}
			}
		}
		else if (s4_122 != 0x00)
		{
l2303F63C:
			s5_133 = s4_122;
			goto l2303F63E;
		}
	}
l2303F60E:
	a4_121 = (word32) *((word32) s3_30 + 9);
	if (a4_121 == 0x11)
	{
		struct Eq_203367 * a4_172 = (word32) s3_30 + s6_169;
		a3_116 = (word32) a4_172->b0002;
		a4_121.u0 = 0x04000400;
		if (((word32) a4_172->b0003 << 8 | a3_116) == 0x04000400)
		{
			s5_133 = s4_122;
l2303F6DC:
			if (s5_133 == 0x00)
			{
				g_w4201FDCE = (word16) ((word32) g_w4201FDCE + 0x01);
				word32 a5_1598;
				word32 mstatus_1606;
				word32 a7_1599;
				word32 s2_1600;
				word32 s4_1602;
				word32 s5_1603;
				word32 s6_1604;
				word32 s8_1605;
				word32 s3_1601;
				word32 a4_1597;
				word32 s0_1591;
				word32 a0_1593;
				word32 a1_1594;
				word32 a2_1595;
				word32 a3_1596;
				word32 s1_1592;
				pbuf_free(ra_244, s2_35, a3_116, a4_121, s4_122, mstatus, dwArgF8, out s0_1591, out s1_1592, out a0_1593, out a1_1594, out a2_1595, out a3_1596, out a4_1597, out a5_1598, out a7_1599, out s2_1600, out s3_1601, out s4_1602, out s5_1603, out s6_1604, out s8_1605, out mstatus_1606);
l2303F512:
				0x00 = (uint16) dwArg0128;
				return;
			}
			goto l2303F662;
		}
	}
	s5_133.u0 = 0x00;
l2303F63E:
	s1_102 = *((word32) a0_124 + 16);
	if (a0_124 != 0x00)
	{
		struct Eq_203391 * a5_198;
		if (ip4_addr_isbroadcast_u32(a0_124, s4_122, out a3_116, out a4_121, out a5_198) != null)
		{
l2303F656:
			word32 a2_1545;
			word32 s1_1542;
			word32 a0_1543;
			word32 a3_1546;
			word32 s5_1553;
			word32 a7_1549;
			word32 s6_1554;
			word32 s8_1555;
			word32 a5_1548;
			word32 s2_1550;
			word32 s3_1551;
			word32 s4_1552;
			word32 a4_1547;
			word32 a1_1544;
			word32 mstatus_1556;
			pbuf_free(ra_244, s2_35, a3_116, a4_121, s4_122, mstatus, dwArgF8, out s0_567, out s1_1542, out a0_1543, out a1_1544, out a2_1545, out a3_1546, out a4_1547, out a5_1548, out a7_1549, out s2_1550, out s3_1551, out s4_1552, out s5_1553, out s6_1554, out s8_1555, out mstatus_1556);
			goto l2303F588;
		}
		s1_102 = a5_198->t0010;
		a4_121.u0 = 224;
		if ((a5_198 & 0x00F0) == 224)
			goto l2303F656;
	}
	goto l2303F6DC;
}

