pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303F7D0: Register Eq_2 ip4_output_if_opt_src(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Stack uint16 wArg00, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out Eq_2 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_2 s9Out)
// Called from:
//      ip4_output_if_opt
//      ip4_output_if_src
Eq_2 ip4_output_if_opt_src(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, uint16 wArg00, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out, union Eq_2 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out)
{
	Eq_2 a6_275;
	Eq_2 s2_242;
	ptr32 a0_303;
	ptr32 a5_309;
	ptr32 a4_308;
	Eq_2 s3_29 = a6;
	Eq_2 s9_111 = (word32) wArg00;
	if (a2 != 0x00)
	{
		uint32 s1_157;
		s4 = a1;
		s2_242 = a2;
		s6 = a3;
		s5 = a4;
		s7 = a5;
		if (s9_111 != 0x00)
		{
			if (s9_111 > 40)
			{
				word32 a4_327 = (word32) g_w4201FDDC;
				g_w4201FDDC = (word16) (a4_327 + 0x01);
				a5_309 = 1107426712;
				a0_303 = ~0x05;
				a4_308 = a4_327 + 0x01;
				goto l2303F81E;
			}
			Eq_2 s0_62 = (word32) (word16) ((word32) s9_111 + 3 & ~0x03);
			s1_157 = (word32) (word16) ((word32) s0_62 + 20);
			word32 a3_517;
			word32 a4_518;
			word32 a5_519;
			word32 a1_515;
			word32 a2_516;
			if (pbuf_add_header(a0, s0_62, out a1_515, out a2_516, out a3_517, out a4_518, out a5_519) != 0x00)
			{
l2303F856:
				word32 a4_321 = (word32) g_w4201FDDC;
				g_w4201FDDC = (word16) (a4_321 + 0x01);
				a5_309 = 1107426712;
				a0_303 = ~0x01;
				a4_308 = a4_321 + 0x01;
				goto l2303F81E;
			}
			word32 a2_521;
			word32 a5_524;
			word32 a3_522;
			word32 a4_523;
			word32 a1_520;
			memcpy(*((word32) a0 + 4), a7, s9_111, out a1_520, out a2_521, out a3_522, out a4_523, out a5_524, out a6_275, out a7);
			if (s9_111 < s0_62)
			{
				word32 a2_528;
				word32 a5_531;
				word32 a3_529;
				word32 a4_530;
				word32 t1_525;
				word32 a0_526;
				word32 a1_527;
				ra = memset(ra, Mem66[a0 + 4:int32] + s9_111, 0x00, s0_62 - s9_111, out t1_525, out a0_526, out a1_527, out a2_528, out a3_529, out a4_530, out a5_531);
			}
			Eq_2 a3_107 = *((word32) a0 + 4);
			Eq_204052 a5_110 = 0x00;
			s9_111.u0 = 0x00;
			do
			{
				a5_110 = (word32) a5_110.u0 + 1;
				s9_111 = (word16) s9_111.u0 + (word32) (*((word32) a3_107 + a5_110 * 0x02));
			} while (a5_110 < s0_62 >> 1);
		}
		else
		{
			s1_157 = 0x14;
			s9_111.u0 = 0x00;
			a6_275 = a6;
		}
		word32 a4_535;
		word32 a5_536;
		word32 a1_532;
		word32 a2_533;
		word32 a3_534;
		if (pbuf_add_header(a0, 0x14, out a1_532, out a2_533, out a3_534, out a4_535, out a5_536) != 0x00)
			goto l2303F856;
		Eq_2 a4_209;
		s0 = *((word32) a0 + 4);
		((word32) s0 + 8)->u1 = (byte) a3;
		((word32) s0 + 9)->u1 = (byte) a5;
		Eq_2 a5_145 = *a2;
		*((word32) s0 + 16) = (byte) a5_145;
		((word32) s0 + 0x0011)->u1 = (byte) (a5_145 >> 0x08);
		*((word32) s0 + 18) = (byte) (a5_145 >> 0x10);
		ui32 a4_162 = (s1_157 >> 0x02 | 64) & 0x00FF;
		*s0 = (byte) a4_162;
		((word32) s0 + 19)->u1 = (byte) (a5_145 >> 0x18);
		((word32) s0 + 1)->u1 = (byte) a4;
		word32 a5_537;
		Eq_2 a0_188 = lwip_htons((word32) *((word32) a0 + 8), out a5_537);
		*((word32) s0 + 2) = (byte) a0_188;
		Eq_2 a0_193 = (word32) g_w4200DF28;
		((word32) s0 + 3)->u1 = (byte) (a0_188 >> 0x08);
		((word32) s0 + 6)->u1 = 0x00;
		((word32) s0 + 7)->u1 = 0x00;
		word32 a5_538;
		Eq_2 a0_197 = lwip_htons(a0_193, out a5_538);
		((word32) s0 + 5)->u1 = (byte) (a0_197 >> 0x08);
		word32 a5_201 = (word32) g_w4200DF28;
		*((word32) s0 + 4) = (byte) a0_197;
		int32 s7_147 = a3 << 8 | a5;
		int32 a4_170 = a4_162 << 8 | a4;
		g_w4200DF28 = (word16) (a5_201 + 0x01);
		s1 = (word32) a0_188 + ((word32) ((word16) (a4_170 >> 8 | a4_170 << 0x08)) + ((word32) s9_111 + ((word32) ((word16) (s7_147 << 0x08 | s7_147 >> 0x08)) + ((word32) ((word16) a5_145) + (a5_145 >> 0x10)))));
		s6 = a3 << 8;
		s7 = s7_147 >> 0x08;
		s5.u0 = 0x4200DF28;
		word32 a0_203 = a0_197 + s1;
		if (a1 == 0x00)
			a4_209 = g_t2308DE8C;
		else
			a4_209 = *a1;
		((word32) s0 + 0x0F)->u1 = (byte) (a4_209 >> 0x18);
		*((word32) s0 + 0x0C) = (byte) a4_209;
		((word32) s0 + 0x0D)->u1 = (byte) (a4_209 >> 0x08);
		uint32 a5_221 = a4_209 >> 0x10;
		((word32) s0 + 0x0E)->u1 = (byte) a5_221;
		uint32 a4_225 = (a4_209 & 0x0FFFFFFF) + a0_203 + a5_221;
		uint32 a4_229 = (a4_225 & 0x0FFFFFFF) + (a4_225 >> 0x10);
		uint32 a5_234 = (word32) (word16) ~((a4_229 >> 0x10) + a4_229);
		*((word32) s0 + 0x0A) = (byte) a5_234;
		((word32) s0 + 11)->u1 = (byte) (a5_234 >> 8);
		a3.u0 = 0x0FFFFFFF;
	}
	else
	{
		s2_242 = s2;
		if ((word32) *((word32) a0 + 0x0A) <= 0x13)
			goto l2303F856;
		s2_242 = fp + -52;
		a6_275 = a6;
	}
	word32 a4_241 = (word32) g_w4201FDC8;
	g_w4201FDC8 = (word16) (a4_241 + 0x01);
	<anonymous> * a5_255 = *((word32) a6 + 20);
	word32 t1_314;
	word32 t4_315;
	word32 t5_316;
	word32 t6_317;
	a5_255();
l2303F81E:
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = a0_303;
	a3Out = s2;
	a4Out = a4_308;
	a5Out = a5_309;
	a7Out = a7;
	s2Out = s2_242;
	s3Out = s3_29;
	s4Out = dwArg0168;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s8Out = dwArg0148;
	s9Out = s9_111;
	return dwLoc08;
}

// 2303FA1C: Register Eq_2 ip4_output_if_opt(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 a7, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Stack uint16 wArg00, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 a7Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out)
// Called from:
//      igmp_send
//      ip4_output_if
Eq_2 ip4_output_if_opt(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 a7, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, uint16 wArg00, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & a7Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out)
{
	word32 t1_4 = (word32) wArg00;
	if (a2 != 0x00 && (a1 == 0x00 || *a1 == 0x00))
		a1 = (word32) a6 + 4;
	uint16 wArg00_84 = (uint16) t1_4;
	ptr32 a0_56;
	ptr32 a3_58;
	ptr32 a4_59;
	ptr32 a5_60;
	ptr32 s0_63;
	ptr32 s1_64;
	ptr32 s3_65;
	ptr32 s4_66;
	ptr32 s8_67;
	ptr32 s9_68;
	ptr32 a7_73;
	ptr32 s2_74;
	ptr32 s5_75;
	ptr32 s6_76;
	ptr32 s7_77;
	Eq_2 ra_62 = ip4_output_if_opt_src(ra, s0, s1, a0, a1, a2, a3, a4, a5, a6, a7, s4, s5, s6, s7, wArg00_84, out s0_63, out s1_64, out a0_56, out a3_58, out a4_59, out a5_60, out a7_73, out s2_74, out s3_65, out s4_66, out s5_75, out s6_76, out s7_77, out s8_67, out s9_68);
	s0Out = s0_63;
	s1Out = s1_64;
	a0Out = a0_56;
	a3Out = a3_58;
	a4Out = a4_59;
	a5Out = a5_60;
	a7Out = a7_73;
	s2Out = s2_74;
	s3Out = s3_65;
	s4Out = s4_66;
	s5Out = s5_75;
	s6Out = s6_76;
	s7Out = s7_77;
	s8Out = s8_67;
	s9Out = s9_68;
	return ra_62;
}

// 2303FA36: Register Eq_2 ip4_output_if(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register out (ptr32 Eq_204373) s0Out, Register out (ptr32 Eq_204374) s1Out, Register out ptr32 a0Out, Register out Eq_204376 a3Out, Register out (ptr32 Eq_204377) a4Out, Register out (ptr32 Eq_204378) a5Out, Register out ptr32 a7Out, Register out (ptr32 Eq_204380) s2Out, Register out Eq_204381 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out, Register out ptr32 s9Out)
// Called from:
//      raw_sendto
//      tcp_output_control_segment
//      tcp_output
//      icmp_input
//      icmp_dest_unreach
Eq_2 ip4_output_if(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, struct Eq_204373 & s0Out, struct Eq_204374 & s1Out, ptr32 & a0Out, union Eq_204376 & a3Out, struct Eq_204377 & a4Out, struct Eq_204378 & a5Out, ptr32 & a7Out, struct Eq_204380 & s2Out, union Eq_204381 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out, ptr32 & s9Out)
{
	ptr32 a0_21;
	Eq_204376 a3_24;
	struct Eq_204377 * a4_25;
	struct Eq_204378 * a5_26;
	ptr32 a7_28;
	struct Eq_204373 * s0_30;
	struct Eq_204374 * s1_31;
	struct Eq_204380 * s2_32;
	Eq_204381 s3_33;
	ptr32 s4_34;
	ptr32 s5_35;
	ptr32 s6_36;
	ptr32 s7_37;
	ptr32 s8_38;
	ptr32 s9_39;
	Eq_2 ra_29 = ip4_output_if_opt(ra, s0, s1, a0, a1, a2, a3, a4, a5, a6, 0x00, s4, s5, s6, s7, 0x00, out s0_30, out s1_31, out a0_21, out a3_24, out a4_25, out a5_26, out a7_28, out s2_32, out s3_33, out s4_34, out s5_35, out s6_36, out s7_37, out s8_38, out s9_39);
	s0Out = s0_30;
	s1Out = s1_31;
	a0Out = a0_21;
	a3Out = a3_24;
	a4Out = a4_25;
	a5Out = a5_26;
	a7Out = a7_28;
	s2Out = s2_32;
	s3Out = s3_33;
	s4Out = s4_34;
	s5Out = s5_35;
	s6Out = s6_36;
	s7Out = s7_37;
	s8Out = s8_38;
	s9Out = s9_39;
	return ra_29;
}

