pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303FA48: Register Eq_2 ip4_output_if_src(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 a6, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register out (ptr32 Eq_204437) s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_204441) s2Out, Register out (ptr32 Eq_225410) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out)
// Called from:
//      udp_sendto
Eq_2 ip4_output_if_src(Eq_2 ra, Eq_2 s0, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 a6, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, struct Eq_204437 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_204441 & s2Out, union Eq_225410 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out)
{
	ptr32 a0_21;
	ptr32 a3_23;
	ptr32 a4_24;
	struct Eq_204437 * s1_29;
	union Eq_225410 * s3_30;
	ptr32 s4_31;
	struct Eq_204441 * s2_39;
	ptr32 s5_40;
	ptr32 s6_41;
	word32 s0_62;
	word32 a5_63;
	word32 a7_64;
	word32 s7_65;
	word32 s8_66;
	word32 s9_67;
	Eq_2 ra_27 = ip4_output_if_opt_src(ra, s0, s1, a0, a1, a2, a3, a4, a5, a6, 0x00, s4, s5, s6, s7, 0x00, out s0_62, out s1_29, out a0_21, out a3_23, out a4_24, out a5_63, out a7_64, out s2_39, out s3_30, out s4_31, out s5_40, out s6_41, out s7_65, out s8_66, out s9_67);
	s1Out = s1_29;
	a0Out = a0_21;
	a3Out = a3_23;
	a4Out = a4_24;
	s2Out = s2_39;
	s3Out = s3_30;
	s4Out = s4_31;
	s5Out = s5_40;
	s6Out = s6_41;
	return ra_27;
}

// 2303FA5A: Register Eq_2 ip4_addr_isbroadcast_u32(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_200352 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      etharp_input
//      etharp_query
//      etharp_output
//      ip4_input_accept
//      ip4_input
//      raw_input
//      tcp_input
//      udp_input
//      icmp_input
Eq_2 ip4_addr_isbroadcast_u32(Eq_2 a0, Eq_2 a1, union Eq_200352 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	Eq_2 a0_11;
	Eq_2 a5_10 = ~0x02;
	if (a0 <= 0x02)
	{
		a5_10 = (word32) *((word32) a1 + 65);
		a0_11 = a5_10 & 2;
		if ((a5_10 & 2) != 0x00)
		{
			a0_11.u0 = 0x00;
			if (a5_10 != a0)
			{
				a5_10 = (a5_10 ^ a0) & (word32) a0 - 1;
				if (a5_10 == 0x00)
				{
					Eq_200352 a3_17 = ~((word32) a0 - 1);
					a3Out = a3_17;
					a4Out.u0 = <invalid>;
					a5Out = a5_10;
					return (word32) ((a3_17 & a0) - a3_17 < 1);
				}
			}
		}
	}
	else
		a0_11.u0 = 0x01;
	a3Out = (word32) a0 - 1;
	a4Out.u0 = <invalid>;
	a5Out = a5_10;
	return a0_11;
}

// 2303FA94: Register word32 ip4addr_aton(Register Eq_2 a0, Register Eq_2 a1, Register out Eq_185985 a0Out, Register out (ptr32 Eq_2) a3Out, Register out (ptr32 Eq_185987) a4Out, Register out (ptr32 Eq_185988) a5Out, Register out (ptr32 Eq_2) s4Out)
// Called from:
//      lwip_getaddrinfo
//      dns_gethostbyname
//      ipaddr_addr
//      dhcpd_start
//      set_if
word32 ip4addr_aton(Eq_2 a0, Eq_2 a1, union Eq_185985 & a0Out, union Eq_2 & a3Out, struct Eq_185987 & a4Out, struct Eq_185988 & a5Out, union Eq_2 & s4Out)
{
	struct Eq_185988 * a5_102 = (word32) *a0;
	struct Eq_185987 * a4_10 = fp + -32;
	while (true)
	{
		Eq_185985 s0_114;
		ui32 a3_24 = (word32) a5_102->b2308DC6D;
		union Eq_2 * a3_117 = a3_24 & 0x04;
		if ((a3_24 & 0x04) == 0x00)
			break;
		word32 a7_177 = 0x0A;
		if (a5_102 == (struct Eq_185988 *) 48)
		{
			a5_102 = (word32) *((word32) a0 + 1);
			if ((a5_102 & 223) != 88)
			{
				a0 = (word32) a0 + 1;
				a7_177 = 0x08;
			}
			else
			{
				a5_102 = (word32) *((word32) a0 + 2);
				a7_177 = 0x10;
				a0 = (word32) a0 + 2;
			}
		}
		Eq_2 a2_138 = a0;
		Eq_2 a0_103 = 0x00;
l2303FAE4:
		a3_117 = (word32) a5_102->b2308DC6D;
		if ((a3_117 & 4) != 0x00)
		{
			a0_103 = (char *) (a5_102 + ((word32) a0_103 + a7_177) / 587783278) - 48;
			goto l2303FAFE;
		}
		if (a7_177 == 0x10 && (a3_117 & 0x0044) != 0x00)
		{
			ui32 a0_142 = a0_103 << 4;
			Eq_204576 a5_143 = (char *) a5_102 + 0x0A;
			Eq_204579 t1_144 = 97;
			if ((a3_117 & 0x03) != 0x02)
				t1_144.u0 = 65;
			a0_103 = a0_142 | a5_143 - t1_144;
l2303FAFE:
			a5_102 = (word32) *((word32) a2_138 + 1);
			a2_138 = (word32) a2_138 + 1;
			goto l2303FAE4;
		}
		if (a5_102 != (struct Eq_185988 *) 46)
		{
			if (a5_102 != null)
			{
				a3_117 &= 0x08;
				s0_114.u0 = 0x00;
				if ((a3_117 & 0x08) == 0x00)
					goto l2303FB78;
			}
			s0_114 = (a4_10 - (fp + -32) >> 2) + 0x01;
			a5_102 = (struct Eq_185988 *) 0x02;
			if (s0_114 == 0x02)
			{
				a5_102 = (struct Eq_185988 *) 0x01000000;
				s0_114.u0 = 0x00;
				if (a0_103 >= 0x01000000)
					goto l2303FB78;
				a4_10 = (struct Eq_185987 *) 0x00FF;
				if (true)
					goto l2303FB78;
				a5_102 = null;
				goto l2303FBCA;
			}
			if (s0_114 <= 0x02)
			{
				if (s0_114 == 0x00)
					goto l2303FB78;
				goto l2303FB6A;
			}
			ui32 a5_84;
			if (s0_114 != 0x03)
			{
				a5_102 = (struct Eq_185988 *) 0x04;
				if (s0_114 != 0x04)
					goto l2303FB6A;
				s0_114.u0 = 0x00;
				if (a0_103 > 0x00FF || false)
					goto l2303FB78;
				s4 = dwArg74;
				if (a3_117 > (union Eq_2 *) 0x00FF || a4_10 > (struct Eq_185987 *) 0x00FF)
					goto l2303FB78;
				a3_117 <<= 16;
				a5_84 = a3_117 | 0x04000000;
				a4_10 <<= 8;
			}
			else
			{
				a5_102 = (struct Eq_185988 *) 0x10000000;
				s0_114.u0 = 0x00;
				if (a0_103 >= 0x10000000)
					goto l2303FB78;
				a3_117 = (union Eq_2 *) 0x00FF;
				if (true)
					goto l2303FB78;
				s4 = dwArg94;
				if (a4_10 > (struct Eq_185987 *) 0x00FF)
					goto l2303FB78;
				a5_84 = 0x00;
				a4_10 <<= 16;
			}
			a5_102 = a5_84 | a4_10;
l2303FBCA:
			a0_103 |= a5_102;
l2303FB6A:
			s0_114.u0 = 0x01;
			if (a1 != 0x00)
				*lwip_htonl(a0_103, out a3_117, out a4_10, out a5_102) = a1;
			goto l2303FB78;
		}
		if (a4_10 == fp + -20)
			break;
		++a4_10;
		a4_10[0x03FF] = (struct Eq_185987) a0_103;
		a5_102 = (word32) *((word32) a2_138 + 1);
		a0 = (word32) a2_138 + 1;
	}
	s0_114.u0 = 0x00;
l2303FB78:
	a0Out = s0_114;
	a3Out = a3_117;
	a4Out = a4_10;
	a5Out = a5_102;
	s4Out = s4;
	return dwArgE4;
}

// 2303FBF2: Register Eq_2 ipaddr_addr(Register Eq_2 a0, Register out ptr32 a0Out, Register out ptr32 a3Out)
// Called from:
//      bl_rx_sm_disconnect_ind
//      wifi_sta_ip_set_cmd
//      tcpc_entry
//      iperf_server_udp
//      iperf_client_udp
//      iperf_client_tcp
Eq_2 ipaddr_addr(Eq_2 a0, ptr32 & a0Out, ptr32 & a3Out)
{
	ptr32 a3_10;
	word32 s4_56;
	word32 a5_55;
	word32 a4_54;
	ptr32 a0_25;
	Eq_2 s0_14 = ip4addr_aton(a0, fp + ~0x13, out a0_25, out a3_10, out a4_54, out a5_55, out s4_56);
	if (a0_25 == 0x00)
		a0_25 = ~0x00;
	a0Out = a0_25;
	a3Out = a3_10;
	return s0_14;
}

// 2303FC0A: Register (ptr32 Eq_122798) ip4addr_ntoa_r(Register (ptr32 Eq_122798) a1, Register int32 a2, Register out (ptr32 Eq_122800) a3Out, Register out (ptr32 Eq_122798) a4Out, Register out (ptr32 Eq_122800) a5Out)
// Called from:
//      wifi_sta_ip_set_cmd
//      ip4addr_ntoa
//      stats_netstat
struct Eq_122798 * ip4addr_ntoa_r(struct Eq_122798 * a1, int32 a2, struct Eq_122800 & a3Out, struct Eq_122798 & a4Out, struct Eq_122800 & a5Out)
{
	struct Eq_122798 * t4_42 = a1;
	int32 a0_10 = 0x00;
	struct Eq_122800 * a3_11 = &fp->bFFFFFFF8 + 4;
	do
	{
		uint32 a6_18 = (word32) a3_11->b0000;
		struct Eq_122800 * a5_19 = null;
		while (true)
		{
			Mem31[fp + a5_19 + 0x0FF8:byte] = SLICE((a6_18 & 0x0A) + 48, byte, 0);
			int32 t3_27 = a5_19 + 1;
			uint32 a4_29 = a6_18 >> 0x0A;
			if (a6_18 <= 0x09)
				break;
			a6_18 = a4_29 & 0x00FF;
			a5_19 = t3_27 & 0x00FF;
		}
		a3_11->b0000 = (byte) (a4_29 & 0x00FF);
		int32 a6_40 = a0_10;
		struct Eq_122798 * a4_43 = t4_42;
		while (true)
		{
			struct Eq_122798 * a0_62;
			++a0_10;
			if (a5_19 == (struct Eq_122800 *) 0x00FF)
				break;
			word32 a7_48 = a5_19 + -1;
			if (a6_40 >= a2)
				goto l2303FCA2;
			++a4_43;
			Mem60[a4_43 + 0x0FFF:byte] = SLICE(CONVERT(Mem55[a5_19 + fp + -8:byte], byte, word32), byte, 0);
			a6_40 = a0_10;
			a5_19 = a7_48 & 0x00FF;
		}
		if (a6_40 >= a2)
		{
l2303FCA2:
			a0_62 = null;
			goto l2303FC76;
		}
		a4_43->b0000 = 0x2E;
		++a3_11;
		a5_19 = fp;
		t4_42 = a4_43 + 1;
	} while (a3_11 != fp);
	a4_43->b0000 = 0x00;
	a0_62 = a1;
l2303FC76:
	a3Out = a3_11;
	a4Out = a4_43;
	a5Out = a5_19;
	return a0_62;
}

// 2303FCA6: Register word32 ip4addr_ntoa(Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      http_test_cmd
//      wifi_sta_ip_info
//      netif_status_callback
//      ota_tcp_cmd
//      TCP_Server
//      iperf_server
//      ping_recv
word32 ip4addr_ntoa(ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	ptr32 a3_7;
	ptr32 a4_8;
	ptr32 a5_9;
	word32 a0_6 = ip4addr_ntoa_r(&g_t420150BC.b000A + 0x00E6, 0x10, out a3_7, out a4_8, out a5_9);
	a3Out = a3_7;
	a4Out = a4_8;
	a5Out = a5_9;
	return a0_6;
}

// 2303FCB4: void mem_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg84, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
// Called from:
//      lwip_init
void mem_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg84, Eq_2 dwArgF8, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	g_dw4200EF34 = 1107591104;
	*(word32 *) 0x02000000 = 1107591104;
	g_b42047FC4 = 0x00;
	g_dw4200EF38 = 0x44047FC0;
	*(word32 *) 0x20002000 = 0x44047FC0;
	*(byte *) 1141145540 = 0x01;
	g_dw4200EF2C = 1107591104;
	*(word16 *) 0x42020E46 = 0x00;
	sys_mutex_new(ra, 0x4200DF30, 0x4200E000, 0x02000000, 0x42020000, mstatus, dwArg00, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178);
}

// 2303FD02: Register Eq_181744 mem_free(Register Eq_2 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg24, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0178, Stack Eq_2 dwArg0198, Register out Eq_181744 s1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_181747 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s8Out)
// Called from:
//      httpc_free_state
//      pbuf_free
//      dhcp_server_recv
//      dhcp_server_stop
Eq_181744 mem_free(Eq_2 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg24, Eq_2 dwArg84, Eq_2 dwArgA4, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0158, Eq_2 dwArg0178, Eq_2 dwArg0198, union Eq_181744 & s1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_181747 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s8Out)
{
	if (a0 == 0x00)
	{
		s1Out = s1;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		a7Out = a7;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s8Out = s8;
		return s0;
	}
	Eq_181744 s1_207;
	Eq_2 s2_208 = 1107426712;
	s1_207 = s1;
	if ((a0 & 3) != 0x00)
	{
l2303FD26:
		word32 a4_446;
		word32 a5_447;
		word32 a2_445;
		sys_arch_protect(a4, mstatus, out a2_445, out a4_446, out a5_447);
		((word32) s2_208 + 0x00B4)->u0 = (word16) ((word32) *((word32) s2_208 + 0x00B4) + 0x01);
		Eq_2 a4_245;
		Eq_181747 a5_246;
		Eq_2 a3_244 = sys_arch_unprotect(a3, mstatus, out a4_245, out a5_246);
		s1Out = s1_207;
		a3Out = a3_244;
		a4Out = a4_245;
		a5Out = a5_246;
		a7Out = a7;
		s2Out = s2_208;
		s3Out = s3;
		s4Out = dwArg04;
		s5Out = s5;
		s6Out = s6;
		s8Out = s4;
		return s1;
	}
	s1_207 = (word32) a0 - 8;
	if ((word32) a0 - 8 < g_t4200DF34)
		goto l2303FD26;
	a3 = g_t4200DF38;
	a4 = (word32) a0 + 0x0C;
	s3.u0 = 1107353400;
	if (a3 < (word32) a0 + 0x0C)
		goto l2303FD26;
	Eq_2 s1_42;
	struct Eq_204890 * s2_43;
	union Eq_2 * s3_44;
	union Eq_2 * s4_45;
	word32 a1_448;
	Eq_2 a4_194;
	struct Eq_204895 * s0_41 = sys_mutex_lock(a3, (word32) a0 + 0x0C, 1107426712, mstatus, s4, dwArg24, s3, dwArgD8, dwArg0118, out s1_42, out a1_448, out a4_194, out s2_43, out s3_44, out s4_45);
	Eq_2 a5_129 = (word32) s0_41->bFFFFFFFC;
	if (a5_129 != 0x00)
	{
		up32 a1_50 = (word32) s0_41->wFFFFFFF8;
		a5_129.u0 = 0x02000000;
		if (a1_50 > 0x02000000)
			goto l2303FD82;
		a4_194 = (word32) s0_41->wFFFFFFFA;
		if (a4_194 <= 0x02000000)
		{
			a5_129 = *s4_45;
			Eq_2 a2_56 = (word32) (word16) (s1_42 - a5_129);
			if (a2_56 != a4_194)
			{
				a4_194 = CONVERT(Mem19[a4_194 + a5_129:uint16], uint16, word32);
				if (a4_194 != a2_56)
					goto l2303FD82;
			}
			Eq_2 a6_61 = *s3_44;
			Eq_2 a4_64 = (word32) a5_129 + a1_50;
			if (a4_64 != a6_61)
			{
				a4_194 = (word32) *((word32) a4_64 + 2);
				if (a4_194 != a2_56)
					goto l2303FD82;
			}
			Eq_2 a3_69 = g_t4200DF2C;
			s0_41->b0FFC = 0x00;
			Eq_2 a4_126 = 0x4200DF2C;
			if (s1_42 < a3_69)
				s1_42->u0 = 0x4200DF2C;
			s2_43->w00B0 = (word16) ((word32) a2_56 + ((word32) s2_43->w00B0 - a1_50));
			Eq_2 a3_93 = (word32) a5_129 + (word32) s0_41->wFFFFFFF8;
			if (s1_42 != a3_93)
			{
				Eq_2 a1_95 = (word32) *((word32) a3_93 + 4);
				if (a1_95 == 0x00 && a6_61 != a3_93)
				{
					a4_126 = *a1_95;
					if (a3_93 == a1_95)
						*s1_42 = a4_126;
					s0_41->w0FF8 = (word16) (word32) *a3_93;
					ptr32 a3_105 = (word32) *a3_93;
					if (a3_105 != 0x02000000)
						(word32) a5_129 + a3_105 + 2 = (word32) (word16) a2_56;
				}
			}
			word32 a2_113 = (word32) s0_41->wFFFFFFFA;
			Eq_2 a3_115 = (word32) a5_129 + a2_113;
			if (s1_42 != a3_115)
			{
				Eq_2 a1_118 = (word32) *((word32) a3_115 + 4);
				if (a1_118 == 0x00)
				{
					Eq_2 a4_119 = *a1_118;
					if (s1_42 == a1_118)
						*a3_115 = a4_119;
					*a3_115 = (word16) (word32) s0_41->wFFFFFFF8;
					a4_126 = (word32) s0_41->wFFFFFFF8;
					if (a4_126 != 0x02000000)
					{
						a5_129 += a4_126;
						*((word32) a5_129 + 2) = (word16) a2_113;
					}
				}
			}
			word32 a1_453;
			Eq_2 a3_171;
			Eq_2 a4_172;
			Eq_181747 a5_173;
			ptr32 a7_175;
			Eq_181744 s1_177;
			Eq_2 s2_178;
			Eq_2 s3_179;
			Eq_2 s4_180;
			ptr32 s5_181;
			ptr32 s6_182;
			Eq_2 s8_183;
			Eq_181744 s0_176 = sys_mutex_unlock(0x4200DF30, a4_126, a5_129, mstatus, dwArg08, dwArg24, dwArgA4, dwArg0118, dwArg0158, dwArg0198, out s1_177, out a1_453, out a3_171, out a4_172, out a5_173, out a7_175, out s2_178, out s3_179, out s4_180, out s5_181, out s6_182, out s8_183);
			s1Out = s1_177;
			a3Out = a3_171;
			a4Out = a4_172;
			a5Out = a5_173;
			a7Out = a7_175;
			s2Out = s2_178;
			s3Out = s3_179;
			s4Out = s4_180;
			s5Out = s5_181;
			s6Out = s6_182;
			s8Out = s8_183;
			return s0_176;
		}
	}
l2303FD82:
	word32 s8_452;
	word32 s4_451;
	word32 a1_449;
	word32 a5_450;
	sys_mutex_unlock(0x4200DF30, a4_194, a5_129, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_207, out a1_449, out a3, out a4, out a5_450, out a7, out s2_208, out s3, out s4_451, out s5, out s6, out s8_452);
	goto l2303FD26;
}

