pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 2303FE6E: void mem_trim(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0178)
// Called from:
//      dhcp_option_trailer
void mem_trim(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, Eq_2 s2, Eq_2 s3, Eq_2 s4, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, Eq_2 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0138, Eq_2 dwArg0178)
{
	Eq_2 s0_24 = (word32) (word16) ((word32) a1 + 3 & ~0x03);
	if (s0_24 > 11)
	{
		if (s0_24 > 0x02000000)
			goto l2303FE98;
	}
	else
		s0_24.u0 = 0x0C;
	if (s0_24 >= a1)
	{
		Eq_2 a5_35 = g_t4200DF34;
		if (a0 < a5_35)
		{
l2303FEBE:
			word32 a5_435;
			word32 a2_433;
			word32 a4_434;
			sys_arch_protect(a4, mstatus, out a2_433, out a4_434, out a5_435);
			g_w4201FE4C = (word16) ((word32) g_w4201FE4C + 0x01);
			word32 a4_436;
			word32 a5_437;
			sys_arch_unprotect(a3, mstatus, out a4_436, out a5_437);
			goto l2303FED8;
		}
		a4 = g_t4200DF38;
		if (a0 >= a4)
			goto l2303FEBE;
		uint32 s2_44 = (word32) *((word32) a0 - 8) + ~0x07 << 16;
		Eq_2 s3_49 = (word32) (word16) ((s2_44 >> 0x10) - (word32) ((word16) (((word32) a0 - 8) - a5_35)));
		if (s3_49 >= s0_24)
		{
			if (s3_49 == s0_24)
			{
l2303FED8:
				0x00 = (uint16) dwArgA8;
				return;
			}
			Eq_2 a4_117;
			up32 s0_110;
			struct Eq_205191 * a1_58;
			up32 s1_65;
			up32 s2_66;
			up32 s3_67;
			struct Eq_205195 * s4_68;
			word32 a4_438;
			struct Eq_204895 * s0_64 = sys_mutex_lock(a3, a4, s2_44 >> 0x10, mstatus, s4, dwArg24, s3, dwArgD8, dwArg0118, out s1_65, out a1_58, out a4_438, out s2_66, out s3_67, out s4_68);
			Eq_2 a5_148 = g_t4200DF34;
			Eq_2 a2_74 = (word32) a5_148 + (word32) s4_68->wFFFFFFF8;
			if ((word32) *((word32) a2_74 + 4) == 0x00)
			{
				a4_117 = (word32) (word16) (s0_64 + (s1_65 + 8) / 0x0FFD);
				word32 a6_118 = (word32) *a2_74;
				word32 a3_119 = a5_148 + a4_117;
				if (g_t4200DF2C == a2_74)
					a3_119->t0000.u1 = 0x4200DF2C;
				a3_119->b0004 = 0x00;
				a3_119->t0000 = (word16) a6_118;
				a3_119->w0002 = (word16) s1_65;
				s4_68->w0FF8 = (word16) a4_117;
				int32 a3_130 = (word32) a3_119->t0000;
				if (a3_130 != 0x02000000)
					(word32) a5_148 + a3_130 + 2 = (int32) (word16) a4_117;
				s0_110 = s0_64 + ((s1_65 - s2_66) + (word32) g_w4201FE48) / 0x0FFD;
			}
			else
			{
				a4_117 = &s0_64->bFFFFFFFC + 24;
				if (s3_67 < &s0_64->bFFFFFFFC + 24)
					goto l2303FF8E;
				a4_117 = (word32) (word16) (s0_64 + (s1_65 + 8) / 0x0FFD);
				Eq_205300 a2_81 = a1_58->t0000;
				word32 a3_83 = a5_148 + a4_117;
				if (a3_83 < a1_58)
					a3_83->t0000 = a2_81;
				a3_83->b0004 = 0x00;
				word32 a2_88 = (word32) s4_68->wFFFFFFF8;
				a3_83->w0002 = (word16) s1_65;
				a3_83->t0000 = (word16) a2_88;
				s4_68->w0FF8 = (word16) a4_117;
				struct Eq_205328 * a3_94 = (word32) a3_83->t0000;
				if (a3_94 != (struct Eq_205328 *) 0x02000000)
					Mem98[a5_148 + a3_94 + 2:word16] = SLICE(a4_117, word16, 0);
				s0_110 = s0_64 + ((s1_65 - s2_66) + (word32) g_w4201FE48) / 0x0FFD;
			}
			g_w4201FE48 = (word16) s0_110;
			a5_148.u0 = 1107426712;
l2303FF8E:
			word32 a3_441;
			word32 s1_439;
			word32 a5_443;
			word32 a1_440;
			word32 a7_444;
			word32 a4_442;
			word32 s4_447;
			word32 s2_445;
			word32 s6_449;
			word32 s3_446;
			word32 s8_450;
			word32 s5_448;
			sys_mutex_unlock(0x4200DF30, a4_117, a5_148, mstatus, s2, dwArg04, dwArg84, dwArgF8, dwArg0138, dwArg0178, out s1_439, out a1_440, out a3_441, out a4_442, out a5_443, out a7_444, out s2_445, out s3_446, out s4_447, out s5_448, out s6_449, out s8_450);
			goto l2303FED8;
		}
	}
l2303FE98:
	goto l2303FED8;
}

// 2303FFF8: Register Eq_183067 mem_malloc(Register Eq_2 ra, Register Eq_2 s0, Register Eq_183067 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg14, Stack Eq_2 dwArg34, Stack Eq_2 dwArg94, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0188, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_183084 a5Out, Register out ptr32 a7Out, Register out Eq_2 s2Out, Register out ptr32 s3Out, Register out Eq_183088 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s8Out)
// Called from:
//      httpc_init_connection_common.constprop.5
//      dhcp_start
//      pbuf_alloc
//      dhcp_server_recv
//      dhcp_server_start
Eq_183067 mem_malloc(Eq_2 ra, Eq_2 s0, Eq_183067 a0, Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg14, Eq_2 dwArg34, Eq_2 dwArg94, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0188, ptr32 & a0Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_183084 & a5Out, ptr32 & a7Out, union Eq_2 & s2Out, ptr32 & s3Out, union Eq_183088 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s8Out)
{
	ptr32 s0_18;
	if (a0 != 0x00)
	{
		s1 = (word32) (word16) ((word32) a0 + 3 & ~0x03);
		a5.u0 = 11;
		if (s1 > 11)
		{
			a5.u0 = 0x02000000;
			s0_18 = 0x00;
			if (s1 > 0x02000000)
				goto l2304001A;
		}
		else
			s1.u0 = 0x0C;
		s0_18 = 0x00;
		if (s1 < a0)
		{
l2304001A:
			a0Out = s0_18;
			a1Out = a1;
			a3Out = a3;
			a4Out = a4;
			a5Out = a5;
			a7Out = a7;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s8Out = s8;
			return s1;
		}
		up32 s1_42;
		word32 s2_408;
		word32 s3_409;
		word32 s4_410;
		word32 a1_406;
		word32 a4_407;
		struct Eq_204895 * s0_41 = sys_mutex_lock(a3, a4, s2, mstatus, s0, dwArg34, ra, dwArgE8, dwArg0128, out s1_42, out a1_406, out a4_407, out s2_408, out s3_409, out s4_410);
		Eq_2 a6_124 = g_t4200DF2C;
		Eq_2 a7_52 = g_t4200DF34;
		up32 a3_57 = (word32) (word16) (a6_124 - a7_52);
		up32 a4_59 = 0x02000000 - s1_42;
		while (a3_57 < a4_59)
		{
			Eq_2 s0_64 = (word32) a7_52 + a3_57;
			up32 a5_67 = (word32) *s0_64;
			if ((word32) *((word32) s0_64 + 4) == 0x00)
			{
				up32 a2_70 = ~0x07 - a3_57 + a5_67;
				if (a2_70 >= s1_42)
				{
					Eq_2 a5_111;
					Eq_2 a4_126 = 1107426712;
					if (a2_70 >= s1_42 + 20)
					{
						word32 a5_90 = (word32) (word16) (s1_42 + 8 + a3_57);
						struct Eq_205498 * a2_91 = (word32) a7_52 + a5_90;
						a2_91->b0004 = 0x00;
						word32 a1_93 = (word32) *s0_64;
						a2_91->w0002 = (word16) a3_57;
						a2_91->w0000 = (word16) a1_93;
						s0_64->u0 = (word16) a5_90;
						((word32) s0_64 + 4)->u1 = 0x01;
						ptr32 a3_99 = (word32) a2_91->w0000;
						if (a3_99 != 0x02000000)
							(word32) a7_52 + a3_99 + 2 = (word32) (word16) a5_90;
						a5_111 = (word32) g_w4201FE4A;
						Eq_2 s1_112 = (word32) (word16) (s1_42 + ((word32) g_w4201FE48 + 0x08));
						g_w4201FE48 = (word16) s1_112;
						if (a5_111 < s1_112)
							g_w4201FE4A = (word16) s1_112;
					}
					else
					{
						((word32) s0_64 + 4)->u1 = 0x01;
						Eq_2 a3_83 = (word32) g_w4201FE4A;
						a5_111 = (word32) (word16) (a5_67 + (word32) g_w4201FE48 - a3_57);
						g_w4201FE48 = (word16) a5_111;
						if (a3_83 < a5_111)
							g_w4201FE4A = (word16) a5_111;
					}
					if (a6_124 == s0_64)
					{
						a5_111 = g_t4200DF38;
						while (true)
						{
							a4_126 = (word32) *((word32) a6_124 + 4);
							if (a4_126 == 0x00 || a5_111 == a6_124)
								break;
							a6_124 = (word32) a7_52 + (word32) (*a6_124);
						}
						g_t4200DF2C = a6_124;
					}
					s0_18 = (word32) sys_mutex_unlock((char *) s0_41 - 0x00D0, a4_126, a5_111, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1, out a1, out a3, out a4, out a5, out a7, out s2, out s3, out s4, out s5, out s6, out s8) + 8;
					goto l2304001A;
				}
			}
			a3_57 = a5_67;
		}
		word32 a4_194 = (word32) g_w4201FE44;
		g_w4201FE44 = (word16) (a4_194 + 0x01);
		sys_mutex_unlock((char *) s0_41 - 0x00D0, a4_194 + 0x01, 1107426712, mstatus, dwLoc08, dwArg14, dwArg94, dwArg0108, dwArg0148, dwArg0188, out s1, out a1, out a3, out a4, out a5, out a7, out s2, out s3, out s4, out s5, out s6, out s8);
	}
	s0_18 = 0x00;
	goto l2304001A;
}

// 23040154: Register Eq_2 do_memp_malloc_pool(Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      memp_malloc
Eq_2 do_memp_malloc_pool(Eq_2 s1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	struct Eq_205604 * a4_16;
	word32 a2_71;
	word32 a5_72;
	Eq_2 a0_14 = sys_arch_protect(a4, mstatus, out a2_71, out a4_16, out a5_72);
	Eq_2 a5_19 = *s1;
	if (s1 != 0x00)
	{
		s1 = a4_16->t0000;
		a4_16->t0000 = a5_19;
		struct Eq_205625 * a5_28 = (word32) a4_16->w0004;
		a4_16->w0004 = (word16) ((char *) a5_28 + 1);
		a3 = a0_14;
		up32 a4_32 = (word32) a5_28->w0005;
		if ((word32) a5_28->w0007 < a4_32)
			a5_28->w0007 = (word16) a4_32;
	}
	else
		a4_16->t0000 = (word16) ((word32) a4_16->t0000 + 0x01);
	ptr32 a4_42;
	ptr32 a5_43;
	Eq_2 a3_41 = sys_arch_unprotect(a3, mstatus, out a4_42, out a5_43);
	a0Out = s1;
	a2Out = dwArg10;
	a3Out = a3_41;
	a4Out = a4_42;
	a5Out = a5_43;
	return s1;
}

// 230401AC: Register (ptr32 Eq_205668) memp_init_pool(Register Eq_205669 a5)
// Called from:
//      memp_init
struct Eq_205668 * memp_init_pool(Eq_205669 a5)
{
	*a5 = 0x00;
	struct Eq_205668 ** a4_14 = null;
	struct Eq_205676 * a0_11 = *((word32) a5 + 8);
	word32 a5_10 = a5 + 0x03 & ~0x03;
	while (true)
	{
		struct Eq_205668 ** a3_13 = (word32) a0_11->w0006;
		if (a4_14 >= a3_13)
			break;
		struct Eq_205668 * a3_17 = *a3_13;
		a3_17->ptr0000 = a5_10;
		a0_11 = a3_17->ptr000C;
		a5_10->ptr0000 = a3_17;
		a4_14 = (struct Eq_205668 **) ((char *) a4_14 + 1);
		a5_10 += (word32) a0_11->w0004 / 4;
	}
	struct Eq_205668 * a0_24 = a5_10->ptr0000;
	a5_10->w0002 = (word16) a3_13;
	return a0_24;
}

// 230401DE: Register word32 memp_init(Register out ptr32 a2Out)
// Called from:
//      lwip_init
word32 memp_init(ptr32 & a2Out)
{
	struct Eq_205720 * s0_18 = &g_t4201FD98;
	word32 s1_19;
	for (s1_19 = 587752172; s1_19 != ~0x230862AF; s1_19 += 0x04)
	{
		Eq_205669 a5_24 = s1_19 + 0x00;
		int32 * s3_26 = *a5_24;
		word32 a0_31 = memp_init_pool(a5_24);
		++s0_18;
		s0_18[45] = (struct Eq_205720) *s3_26;
	}
	a2Out = dwArg48;
	return a0_31;
}

