pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_text_0003.c
// 23040230: Register Eq_2 memp_malloc(Register Eq_2 s1, Register up32 a0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out (ptr32 Eq_186026) a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      lwip_getaddrinfo
//      tcpip_input
//      tcpip_try_callback
//      altcp_alloc
//      igmp_lookup_group
//      pbuf_alloc
//      raw_new
//      tcp_listen_with_backlog_and_err
//      tcp_seg_copy
//      tcp_new_ip_type
//      tcp_create_segment
//      sys_timeout
//      udp_new_ip_type
//      recv_udp
//      recv_raw
//      netconn_alloc
//      cmd_sntp_start
Eq_2 memp_malloc(Eq_2 s1, up32 a0, Eq_2 a3, Eq_2 a4, ptr32 mstatus, struct Eq_186026 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out)
{
	if (a0 > 0x0E)
	{
		a0Out = null;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = 0x0E;
		return s1;
	}
	else
	{
		struct Eq_186026 * a0_16;
		ptr32 a2_17;
		Eq_2 a3_18;
		Eq_2 a4_19;
		ptr32 a5_20;
		Eq_2 s1_22 = do_memp_malloc_pool(s1, a3, a4, mstatus, out a0_16, out a2_17, out a3_18, out a4_19, out a5_20);
		a0Out = a0_16;
		a2Out = a2_17;
		a3Out = a3_18;
		a4Out = a4_19;
		a5Out = a5_20;
		return s1_22;
	}
}

// 2304024E: Register word32 memp_free(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_185856) a5Out)
// Called from:
//      lwip_freeaddrinfo
//      tcpip_input
//      tcpip_try_callback
//      altcp_free
//      igmp_stop
//      igmp_leavegroup_netif
//      pbuf_free
//      raw_remove
//      tcp_seg_free
//      tcp_abort
//      tcp_shutdown
//      sys_untimeout
//      sys_check_timeouts
//      udp_remove
//      netconn_new_with_proto_and_callback
//      netconn_alloc
//      netconn_free
//      netbuf_delete
word32 memp_free(Eq_2 a0, Eq_2 a1, Eq_2 a3, Eq_2 a4, ptr32 mstatus, union Eq_2 & a0Out, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_185856 & a5Out)
{
	if (a0 > 0x0E || a1 == 0x00)
	{
		a0Out = a0;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = (struct Eq_185856 *) 0x0E;
		return s1;
	}
	else
	{
		struct Eq_205774 * a4_22;
		word32 a5_72;
		word32 a2_71;
		Eq_2 a0_20 = sys_arch_protect(a4, mstatus, out a2_71, out a4_22, out a5_72);
		struct Eq_205783 * a5_25 = (word32) a4_22->w0004;
		a4_22->w0004 = (word16) &a5_25->ptrFFFFFFFF;
		struct Eq_205794 * a5_29 = a5_25->ptrFFFFFFFF;
		a5_29->t0000 = a1;
		word32 s1_31 = a5_29->dw000C;
		*a1 = a5_29;
		Eq_2 a4_39;
		struct Eq_185856 * a5_40;
		Eq_2 a3_38 = sys_arch_unprotect(a3, mstatus, out a4_39, out a5_40);
		a0Out = a0_20;
		a2Out = dwArg10;
		a3Out = a3_38;
		a4Out = a4_39;
		a5Out = a5_40;
		return s1_31;
	}
}

// 23040296: void netif_null_output_ip4()
void netif_null_output_ip4()
{
}

// 2304029A: Register Eq_2 netif_issue_reports(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_205818 a1, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack (ptr32 Eq_52584) dwArg10, Stack Eq_2 dwArg24, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB0, Stack Eq_2 dwArgB4, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0188, Register out ptr32 s1Out, Register out Eq_205818 a1Out, Register out ptr32 a3Out, Register out Eq_205838 a4Out, Register out Eq_205839 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      netif_do_set_ipaddr
//      netif_set_up
//      netif_set_link_up
Eq_2 netif_issue_reports(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_205818 a1, ptr32 mstatus, Eq_2 dwArg08, struct Eq_52584 * dwArg10, Eq_2 dwArg24, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB0, Eq_2 dwArgB4, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArg0108, Eq_2 dwArg0188, ptr32 & s1Out, union Eq_205818 & a1Out, ptr32 & a3Out, union Eq_205838 & a4Out, union Eq_205839 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & mstatusOut)
{
	Eq_205838 a4_108 = (word32) *((word32) a0 + 65);
	ptr32 a3_104 = 0x05;
	if ((a4_108 & 5) == 0x05)
	{
		a1 &= 0x01;
		if ((a1 & 0x01) != 0x00)
		{
			Eq_2 a0_15 = *(union Eq_2 *) 0x09;
			Eq_2 s0_16 = a0_15;
			if (true)
			{
				a4_108 &= 0x08;
				if ((a4_108 & 0x08) != 0x00)
				{
					word32 a0_228;
					ra = etharp_request(ra, a0_15, a0_15, mstatus, s0, dwArg08, dwArg24, dwArg58, dwArg68, dwArg88, dwArg94, dwArg98, dwArgA8, dwArgB0, dwArgB4, dwArgC8, dwArgD8, dwArg0108, dwArg0188, out s0_16, out s1, out a0_228, out a1, out a3_104, out a4_108, out s2, out s3, out s4, out s5, out s6, out s7, out mstatus);
				}
				ui32 a5_48 = (word32) *((word32) s0_16 + 65);
				a5 = a5_48 & 32;
				if ((a5_48 & 32) != 0x00)
				{
					Eq_205818 a1_61;
					ptr32 a3_63;
					Eq_205838 a4_64;
					Eq_205839 a5_65;
					ptr32 s4_67;
					s1Out = igmp_report_groups(s0, dwArg10, a5_48 & 32, out a1_61, out a3_63, out a4_64, out a5_65, out s4_67);
					a1Out = a1_61;
					a3Out = a3_63;
					a4Out = a4_64;
					a5Out = a5_65;
					s2Out = s2;
					s3Out = s3;
					s4Out = s4_67;
					s5Out = s5;
					s6Out = s6;
					s7Out = s7;
					mstatusOut = mstatus;
					return ra;
				}
			}
			s1Out = s1;
			a1Out = a1;
			a3Out = a3_104;
			a4Out = a4_108;
			a5Out = a5;
			s2Out = s2;
			s3Out = s3;
			s4Out = s4;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7;
			mstatusOut = mstatus;
			return ra;
		}
	}
	s1Out = s1;
	a1Out = a1;
	a3Out = 0x05;
	a4Out = a4_108;
	a5Out = a5;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	mstatusOut = mstatus;
	return ra;
}

Eq_2 g_t230402AA = 
	{
		0xCD85
	};
// 230402E4: Register Eq_2 netif_do_set_ipaddr(Register Eq_2 ra, Register Eq_2 s1, Register ptr32 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s3, Register Eq_2 s4, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg90, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a1Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out ptr32 mstatusOut)
// Called from:
//      netif_set_ipaddr
//      netif_set_addr
Eq_2 netif_do_set_ipaddr(Eq_2 ra, Eq_2 s1, ptr32 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s3, Eq_2 s4, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg90, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0168, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a1Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, ptr32 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, ptr32 & mstatusOut)
{
	Eq_2 a0_5 = *((word32) a5 + 4);
	ptr32 a1_7 = *a4;
	if (a4 == a5)
	{
		s0Out = s0;
		s1Out = s1;
		a1Out = a1_7;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s2Out = s2;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		mstatusOut = mstatus;
		return ra;
	}
	else
	{
		*a5 = a2;
		Eq_2 a3_35;
		Eq_2 a4_36;
		Eq_2 a5_37;
		ptr32 mstatus_40;
		word32 s1_42;
		struct Eq_206056 ** s2_45;
		word32 s4_251;
		Eq_2 ra_41 = tcp_netif_ip_addr_changed(ra, a2, fp + ~0x13, a3, a4, s3, s4, s7, mstatus, s2, dwLoc08, dwArg08, dwArg18, dwArg34, dwArg38, dwArg48, dwArg58, dwArg5C, s1, dwArg78, dwArg98, dwArg9C, dwArgA8, dwArgC8, out s1_42, out a3_35, out a4_36, out a5_37, out s2_45, out s4_251, out mstatus_40);
		raw_netif_ip_addr_changed(s1_42, fp + ~0x13, a3_35, a4_36, udp_netif_ip_addr_changed(s1_42, fp + ~0x13, a3_35, a4_36, a5_37));
		*((char *) *s2_45 + 4) = (struct Eq_206056 **) a0_5;
		word32 s4_252;
		ptr32 a1_104;
		Eq_2 a3_102;
		Eq_2 a4_103;
		Eq_2 a5_106;
		ptr32 mstatus_114;
		Eq_2 s1_107;
		Eq_2 s2_116;
		Eq_2 s3_117;
		ptr32 s5_118;
		ptr32 s6_119;
		Eq_2 s7_120;
		Eq_2 ra_115 = netif_issue_reports(ra_41, a0_5, a0_5, 0x01, mstatus_40, s2, dwLoc10, dwArg04, dwArg38, dwArg48, s1, dwArg74, dwArg78, dwArg88, dwArg90, dwArg94, dwArgA8, dwArgB8, dwArgE8, dwArg0168, out s1_107, out a1_104, out a3_102, out a4_103, out a5_106, out s2_116, out s3_117, out s4_252, out s5_118, out s6_119, out s7_120, out mstatus_114);
		ptr32 s0_99 = *((word32) a5_106 + 28);
		if (a5_106 != 0x00)
			a5_106();
		s0Out = s0_99;
		s1Out = s1_107;
		a1Out = a1_104;
		a3Out = a3_102;
		a4Out = a4_103;
		a5Out = a5_106;
		s2Out = s2_116;
		s3Out = s3_117;
		s4Out = dwArg04;
		s5Out = s5_118;
		s6Out = s6_119;
		s7Out = s7_120;
		mstatusOut = mstatus_114;
		return ra_115;
	}
}

